{"full_name": "Mohamed M. Sabry", "email": "msabry@ntu.edu.sg", "name_card": "Asst Prof Mohamed M. Sabry", "designations": ["Assistant Professor, School of Computer Science and Engineering"], "urls": {"dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00314", "website": "http://www.ecs-97.webself.net/"}, "biography": "Mohamed M. Sabry obtained his Ph.D. from EPFL in 2013 and was a postdoc in Stanford University from 2014 till 2017. His primary research interests are system-level design and optimization and resource management of computing systems by leveraging the benefits of emerging technologies (for computing, storage, interconnect, and cooling) to boost computing performance and energy efficiency beyond what is achievable today from large-scale cloud to small-scale embedded domains.  This includes device-, circuit-, and architecture modeling, design-space exploration and hardware-software co-optimization. His work on Nanoengineered Computing System Technology (N3XT), under the supervision of Prof. Subhasish Mitra and Prof. H.-S. Philip Wong has received worldwide recognition in various news press. It shows the prospects of monolithic 3D computing systems enabled by emerging nanotechnologies, such as carbon nanotubes and resistive memories.He has been awarded the Swiss National Science Foundation Early Post-Doctoral Mobility Fellowship in 2013.", "keywords": ["Systems and Engineering Management", "Computer Science and Engineering", "Electrical and Electronic Engineering", "Machines & Systems", "Nanotechnology & Nano-Science", "Computing Hardware and Architecture", "Hardware and Embedded Systems"], "grants": ["Artificial Neural Networks for Frequency-Voltage Prediction Using On-Die Measurements", "Developing Flexible Synapse Network Towards Future Brain-inspired Wearable Applications", "Hardware-Software Co-optimisatoin for Deep Learning", "Memristive Halide Perovskites for Next Generation Embedded Neuromorphic Computing", "Spin Orbit Coupling based IntelligencE TechnologY (SOCIETY)"]}