{"full_name": "Lu Shijian", "email": "shijian.lu@ntu.edu.sg", "name_card": "Assoc Prof Lu Shijian", "image_path": "./profile_image/lu_shijian.jpg", "designations": ["Associate Professor, School of Computer Science and Engineering"], "biography": "Shijian received his PhD in electrical and computer engineering from the National University of Singapore. He is currently an Associate Professor with the School of Computer Science and Engineering, Nanyang Technological University (NTU), Singapore. His major research interests include image and video analytics, visual intelligence, and machine learning. He has published more than 100 international refereed journal and conference papers and co-authored up to10 patents in these research areas. Before joining in NTU, he took a number of leadership roles in the Institute for Infocomm Research (I2R), under the Agency for Science, Technology, and Research (A*SATR) in Singapore, including Head of Visual Attention Lab, Deputy Head of Satellite Department, Co-Chair of the Image and Pervasive Access Laboratory. He is currently an Associate Editor for the journal Pattern Recognition (PR) and Neurocomputing. He has also served in the program committee of a number of conferences such as the Senior Program Committee of the International Joint Conferences on Artificial Intelligence and Association for the Advancement of Artificial Intelligence.", "keywords": ["Computer Vision and Sensing", "Neuroscience", "Graphics and Interactive Computing", "Economics", "Smart Cities"], "grants": ["Automated Synthesis of High-Fidelity Images for Deep Network Training", "LADIS: Learnable Augmentation for Data-Limited Image Synthesis", "Simple and Efficient 3D Modelling with Neural Radiance Fields"], "urls": {"dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp01128", "orcid": null, "personal": "https://personal.ntu.edu.sg/shijian.lu/index.htm", "uymk-a0aaaaj": "https://scholar.google.com.sg/citations?view_op=list_works&hl=en&hl=en&user=uYmK-A0AAAAJ&sortby=pubdate", "8439329200": "https://www.scopus.com/authid/detail.uri?authorId=8439329200"}}