{"full_name": "Zhang Tianwei", "email": "tianwei.zhang@ntu.edu.sg", "name_card": "Asst Prof Zhang Tianwei", "image_path": "./profile_image/zhang_tianwei.jpg", "designations": ["Assistant Professor, School of Computer Science and Engineering"], "biography": "Dr. Tianwei Zhang received his Bachelor’s degree in physics at Peking University, in 2011, and the Ph.D degree in Electrical Engineering at Princeton University in 2017. He worked at Amazon as a software engineer from 2017 to 2019. He joined Nanyang Technological University as an assistant professor in 2019. He has published papers in top-tier architecture and security conferences and journals. He has served on the Program Committee of many conferences, and reviewers of journals.", "keywords": ["Computer Science and Engineering"], "grants": ["A Framework for Intellectual Property Protection of Deep Learning Applications", "A Systematic Study about the Integrity Threats and Protection of Sensory Data in Autonomous Vehicles", "Building Security Tools for Investigating and Introspecting Applications in Trusted Execution Environment", "Design and Evaluation of Cyber Attacks against AI Chips", "Detecting and Preventing Robotic Attacks", "Human mesh reconstruction, Learning from small datasets, Self-supervised learning", "Securing Face Recognition: An Imaging Polarimetry Approach to Face Anti-spoofing", "Smart Safe and Robust Motion Control for Multi-Robot Systems", "Towards Building Unified Autonomous Vehicle Scene Representation for Physical AV Adversarial Attacks and Visual Robustness Enhancement", "TRUSTWORTHY AI CENTRE NTU (TAICeN)", "TRUSTWORTHY AI CENTRE NTU (TAICeN) (NTU)", "TRUSTWORTHY AI CENTRE NTU (TAICeN) (NUS)", "TRUSTWORTHY AI CENTRE NTU (TAICeN) (SMU)", "Trustworthy and Explainable AI “Safe, Fair and Robust AI System Development, Transparent or Explainable AI System Development, Explainability and Trust (Safe, Fair, Robust) Assessment”"], "urls": {"dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00562", "orcid": null, "personal": "https://personal.ntu.edu.sg/tianwei.zhang/", "google_scholar": "https://scholar.google.com/citations?user=9vpiYDIAAAAJ&hl=en&oi=ao", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=55635885400"}}