{"full_name": "Chng Eng Siong", "email": "aseschng@ntu.edu.sg", "name_card": "Assoc Prof Chng Eng Siong", "image_path": "./profile_image/chng_eng_siong.jpg", "designations": ["Associate Professor, School of Computer Science and Engineering"], "biography": "Dr Chng Eng Siong is currently an Associate Professor in the School of Computer Science and Engineering (SCSE), Nanyang Technological University (NTU), Singapore. Prior to joining NTU in 2003, he has worked in several research centers/companies, namely: Knowles Electronics (USA), Lernout and Hauspie (Belgium), Institute of Infocomm Research (I2R, Singapore), and RIKEN (Japan). He received both PhD and BEng (Hons) from Edinburgh University, U.K. in 1996 and 1991 respectively. His area of focus is in speech research, machine learning and signal processing. To date, he has been Principal Investigator of research grants awarded by AI-SG, NTU-Rolls Royce, Mindef, MOE and AStar with a total funding amount of over S$9 million under the “Speech and Language Technology Program (SLTP)” at SCSE. He has graduated more than 15 PhD students and 8 Masters Engineering students. His publications include 2 edited books and over 100 journal/conference papers. He has served as the publication chair for 5 international conferences (Human Agent Interaction 2016, INTERSPEECH 2014, APSIPA-2010, APSIPA-2011, ISCSLP-2006) and local organizing committee in ASRU 2019.", "keywords": ["Computational Intelligence", "Smart Cities", "Artificial and Augmented Intelligence"], "grants": ["Artificial Intelligence-based advisory system for blood sugar management in elderly diabetics", "Development of Medical AI Speech-to-Text Engine for Implementation in the Emergency Department and Acute Ward", "ISSAC", "Multi-Channel Far-field Speaker Diarization for Meeting Rooms with Overlap Speaker Detection", "Project ANPASSEN", "SASEAF FY22 Dr Luong Hieu Thi (Voice Anti-Spoofing, Fake Speech Detection)", "SingaKids Pic2Speak: Multilingual AI Tutor – Uplifting Singapore’s Bilingual Edge", "Single-Channel Far-field Speaker Diarization for Interview Rooms with Far-field Voice Activity Detection", "Strategic Centre For Research In Privacy-Preserving Technologies & Systems (SCRIPTS)", "Voice command recognition under noisy conditions"], "urls": {"dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00098", "orcid": "https://orcid.org/0000-0001-6257-7399", "personal": "https://personal.ntu.edu.sg/aseschng/default.html", "google_scholar": "https://scholar.google.com/citations?user=FJodrCcAAAAJ", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=24474196000"}}