{"goog_sch_url": "https://scholar.google.com/citations?hl=en&user=9mD7MHgAAAAJ", "name": "Smitha K G", "interests": ["Circuits and Systems in Signal Processing", "Computer Arithmetic", "Cognitive radios."], "co_authors_url": [{"name": "Vinod A Prasad", "url": "https://scholar.google.com/citations?user=yhYd0_4AAAAJ&hl=en", "aff": "Professor, Information Communication Technology, Singapore Institute of Technology"}, {"name": "Abhishek Ambede", "url": "https://scholar.google.com/citations?user=Qx64584AAAAJ&hl=en", "aff": "Ericsson Research"}, {"name": "Neethu Robinson", "url": "https://scholar.google.com/citations?user=RzmIFTkAAAAJ&hl=en", "aff": "Nanyang Technological University"}, {"name": "Sharad Sinha", "url": "https://scholar.google.com/citations?user=ZgvhpvEAAAAJ&hl=en", "aff": "Indian Institute of Technology (IIT), Goa"}, {"name": "Kavitha P Thomas", "url": "https://scholar.google.com/citations?user=1k0KaIkAAAAJ&hl=en", "aff": "Research Fellow"}, {"name": "Sumit J Darak", "url": "https://scholar.google.com/citations?user=mWVoHMkAAAAJ&hl=en", "aff": "Associate Professor, IIIT-Delhi"}, {"name": "Mahesh Panicker", "url": "https://scholar.google.com/citations?user=hhcChScAAAAJ&hl=en", "aff": "Associate Professor, Indian Institute of Technology (IIT) Palakkad"}, {"name": "Arish Sateesan", "url": "https://scholar.google.com/citations?user=bgypT7gAAAAJ&hl=en", "aff": "KU Leuven, Belgium"}, {"name": "Edmund Lai", "url": "https://scholar.google.com/citations?user=vPIlibUAAAAJ&hl=en", "aff": "Professor, Auckland University of Technology"}, {"name": "Niharika Agrawal", "url": "https://scholar.google.com/citations?user=Qj_-pFsAAAAJ&hl=en", "aff": "PhD scholar"}, {"name": "Tan Zheng Hui Ernest", "url": "https://scholar.google.com/citations?user=gw75oM4AAAAJ&hl=en", "aff": "Advanced Remanufacturing and Technology Centre, A*STAR"}, {"name": "Tushar Chouhan", "url": "https://scholar.google.com/citations?user=e6GQkBYAAAAJ&hl=en", "aff": "Researcher, AMD"}, {"name": "Harshit", "url": "https://scholar.google.com/citations?user=Ip7tNaMAAAAJ&hl=en", "aff": "Graduate Student, Computer Science, Stony Brook University"}, {"name": "Hossam A. H. Fahmy", "url": "https://scholar.google.com/citations?user=t5y96LcAAAAJ&hl=en", "aff": "Professor, Cairo University, Egypt"}], "citation_table": {"columns": ["All", "Since 2018"], "Citations": [789, 474], "h-index": [17, 11], "i10-index": [25, 14]}, "citation_graph": {"2009": 7, "2010": 11, "2011": 8, "2012": 22, "2013": 32, "2014": 52, "2015": 35, "2016": 75, "2017": 64, "2018": 66, "2019": 73, "2020": 74, "2021": 98, "2022": 98, "2023": 64}, "articles": [{"title": "EEG based stress level identification", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=9mD7MHgAAAAJ&pagesize=100&citation_for_view=9mD7MHgAAAAJ:IWHjjKOFINEC", "authors": ["Guo Jun", "Kavallur Gopi Smitha"], "publication_date": "2016/10/9", "conference": "2016 IEEE international conference on systems, man, and cybernetics (SMC)", "description": "This paper investigates detection of patterns in brain waves while induced with mental stress. Electroencephalogram (EEG) is the most commonly used brain signal acquisition method as it is simple, economical and portable. An automatic EEG based stress recognition system is designed and implemented in this study with two effective stressors to induce different levels of mental stress. The Stroop colour-word test and mental arithmetic test are used as stressors to induce low level and high level of stress respectively, and their relevant C# applications are developed in Microsoft Visual Studio to interface with Emotiv Epoc device. Power band features from EEG signals are analyzed and using the relative difference of beta and alpha power as feature along with Support Vector Machine as classifier, three-levels of stress can be recognized with an accuracy of 75%. For two-level stress analysis, accuracy of 88% and …", "total_citations": 136, "citation_graph": {"2017": 6, "2018": 10, "2019": 14, "2020": 14, "2021": 38, "2022": 31, "2023": 21}}, {"title": "Low-complexity reconfigurable fast filter bank for multi-standard wireless receivers", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=9mD7MHgAAAAJ&pagesize=100&citation_for_view=9mD7MHgAAAAJ:TQgYirikUcIC", "authors": ["Sumit J Darak", "Smitha Kavallur Pisharath Gopi", "Vinod Achutavarrier Prasad", "Edmund Lai"], "publication_date": "2013/7/3", "journal": "IEEE Transactions on Very Large Scale Integration (VLSI) Systems", "description": "This brief presents a new low-complexity reconfigurable fast filter bank (RFFB) for wireless communication applications such as spectrum sensing and channelization. In RFFB, the bandwidth and center frequency of sub-bands can be varied with high frequency resolution without hardware reimplementation. This is achieved with an improved modified frequency transformation-based variable digital filter (MFT-VDF) at the first stage of the proposed multistage implementation. Existing second-order frequency transformation-based low-pass VDFs have limited cutoff frequency range which is approximately 12.5% of the sampling frequency. The proposed low-pass MFT-VDF offers unabridged control over the cutoff frequency on a wide frequency range thereby, improving the cutoff frequency range of existing VDFs. The design example shows that the RFFB is easy to design and offers substantial savings in gate counts …", "total_citations": 47, "citation_graph": {"2013": 1, "2014": 4, "2015": 4, "2016": 13, "2017": 6, "2018": 5, "2019": 2, "2020": 3, "2021": 3, "2022": 1, "2023": 4}}, {"title": "Two player EEG-based neurofeedback ball game for attention enhancement", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=9mD7MHgAAAAJ&pagesize=100&citation_for_view=9mD7MHgAAAAJ:mVmsd5A6BfQC", "authors": ["Sun Shenjie", "KG Smitha", "Kavitha P Thomas", "AP Vinod"], "publication_date": "2014/10/5", "conference": "Systems, Man and Cybernetics (SMC), 2014 IEEE International Conference on", "description": "Brain computer interface (BCI) based neurofeedback games have the potential to enhance the cognitive skills of healthy people as well as subjects with cognitive and memory impairment. Electroencephalogram (EEG) has been used as a common brain imaging modality as it is easy and cheap among all the other non-invasive techniques. This paper proposes an EEG driven gaming interface where the subject's attention (concentration) is used to control the game successfully. The proposed game scenario requires the player to push a ball from one end of game's graphical user interface to the other end using his attention level. Attention level of the player is quantified using the ratio of theta to beta band power in EEG signals. The experimental analysis shows that the proposed game is capable of enhancing player's attention skill as well as enhances the ability of the player to sustain attention for longer duration …", "total_citations": 43, "citation_graph": {"2015": 2, "2016": 3, "2017": 5, "2018": 5, "2019": 3, "2020": 10, "2021": 5, "2022": 7, "2023": 3}}, {"title": "Fast two-stage spectrum detector for cognitive radios in uncertain noise channels", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=9mD7MHgAAAAJ&pagesize=100&citation_for_view=9mD7MHgAAAAJ:5nxA0vEk-isC", "authors": ["Prashob R Nair", "A Prasad Vinod", "Kavallur Gopi Smitha", "Anoop Kumar Krishna"], "publication_date": "2012/7/24", "journal": "IET communications", "description": "An enormous influx of wireless services and devices coupled with inefficient usage of electromagnetic spectrum has led to an apparent scarcity of usable radio bandwidth. Cognitive radio is leading the trend for increasing the spectrum efficiency by utilising the vacancy in the radio spectrum created by absence of the licensed primary user. This paradigm shift can only take place if the means to detect the primary user are well established so that an ecosystem can be created where both primary and secondary users can co-exist without interfering with each other. In this study the authors propose a two-stage detection mechanism which gives an improved performance over conventional single-stage detectors yet optimises the usage of the second stage, thereby reducing the sensing time as compared to conventional two-stage spectrum sensing algorithms. A hardware implementation of the algorithm has also been …", "total_citations": 35, "citation_graph": {"2012": 2, "2013": 4, "2014": 3, "2015": 5, "2016": 6, "2017": 3, "2018": 2, "2019": 3, "2020": 5, "2021": 2}}, {"title": "A Multi-Resolution Fast Filter Bank for Spectrum Sensing in Military Radio Receivers", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=9mD7MHgAAAAJ&pagesize=100&citation_for_view=9mD7MHgAAAAJ:Tyk-4Ss8FVUC", "authors": ["KG Smitha", "AP Vinod"], "journal": "Very Large Scale Integration (VLSI) Systems, IEEE Transactions on", "description": "In this paper, we propose a multi-resolution filter bank (MRFB)-based on the fast filter bank design for multiple resolution spectrum sensing in military radio receivers. The proposed method overcomes the constraint of fixed sensing resolution in spectrum sensors based on conventional discrete Fourier transform filter banks (DFTFB). The flexibility in realizing multiple sensing resolution spectrum sensor is achieved by suitably designing the prototype filter and efficiently selecting the varying resolution subbands without hardware re-implementation. Design examples show that the sensing performance of proposed MRFB is comparable to that of conventional fixed resolution DFTFB. The complexity comparison shows that the proposed MRFB architecture has a gate count reduction of 36.5% over the DFTFB. The proposed MRFB architecture achieves an average power reduction of 20.8% over DFTFB.", "total_citations": 35, "citation_graph": {"2012": 1, "2013": 4, "2014": 5, "2015": 3, "2016": 9, "2017": 3, "2018": 3, "2019": 2, "2020": 1, "2021": 0, "2022": 1, "2023": 2}}, {"title": "Facial emotion recognition system for autistic children: a feasible study based on FPGA implementation", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=9mD7MHgAAAAJ&pagesize=100&citation_for_view=9mD7MHgAAAAJ:9ZlFYXVOiuMC", "authors": ["Kavallur Gopi Smitha", "A Prasad Vinod"], "publication_date": "2015/11", "journal": "Medical & biological engineering & computing", "description": "Children with autism spectrum disorder have difficulty in understanding the emotional and mental states from the facial expressions of the people they interact. The inability to understand other people’s emotions will hinder their interpersonal communication. Though many facial emotion recognition algorithms have been proposed in the literature, they are mainly intended for processing by a personal computer, which limits their usability in on-the-move applications where portability is desired. The portability of the system will ensure ease of use and real-time emotion recognition and that will aid for immediate feedback while communicating with caretakers. Principal component analysis (PCA) has been identified as the least complex feature extraction algorithm to be implemented in hardware. In this paper, we present a detailed study of the implementation of serial and parallel implementation of PCA in order …", "total_citations": 32, "citation_graph": {"2016": 4, "2017": 4, "2018": 4, "2019": 5, "2020": 5, "2021": 6, "2022": 1, "2023": 3}}, {"title": "A low-complexity uniform and non-uniform digital filter bank based on an improved coefficient decimation method for multi-standard communication channelizers", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=9mD7MHgAAAAJ&pagesize=100&citation_for_view=9mD7MHgAAAAJ:M3ejUd6NZC8C", "authors": ["Abhishek Ambede", "Kavallur Gopi Smitha", "A Prasad Vinod"], "publication_date": "2013/12", "journal": "Circuits, Systems, and Signal Processing", "description": "It has been shown in literature that the coefficient decimation (CD) techniques can be efficiently used to realize low-complexity finite impulse response (FIR) filters with flexible frequency responses. In this paper, we propose a novel filter bank (FB) design technique based on the combination of the conventional coefficient decimation method (CDM) and the modified coefficient decimation method recently proposed by us. In the proposed FB, subbands of desired bandwidths are obtained by the spectral subtraction of the lowpass and highpass frequency responses obtained after performing CD operations on the prototype filter, using appropriate decimation factors. The proposed FB that provides uniform as well as non-uniform subbands can be used for multi-standard channelization in wireless communication receivers. We show that the proposed FB has a significantly lower complexity along with superior …", "total_citations": 30, "citation_graph": {"2013": 2, "2014": 5, "2015": 4, "2016": 2, "2017": 3, "2018": 3, "2019": 3, "2020": 1, "2021": 3, "2022": 3, "2023": 1}}, {"title": "Flexible low complexity uniform and nonuniform digital filter banks with high frequency resolution for multistandard radios", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=9mD7MHgAAAAJ&pagesize=100&citation_for_view=9mD7MHgAAAAJ:dhFuZR0502QC", "authors": ["Abhishek Ambede", "KG Smitha", "A Prasad Vinod"], "publication_date": "2014/5/14", "journal": "IEEE Transactions on Very Large Scale Integration (VLSI) Systems", "description": "Multistandard radios typically employ digital filter banks (FBs) for channelization of wideband input signals consisting of multiple radio channels corresponding to different wireless communication standards. In this paper, we propose a new design technique to obtain uniform as well as nonuniform digital FBs for multistandard channelization. In the proposed FB design technique, the improved coefficient decimation method (ICDM) is used to obtain different low-pass, high-pass, and multiband frequency responses using a single low-pass prototype filter. These frequency responses are algebraically operated upon using appropriate spectral subtraction, complementary filter response operation, and frequency response masking operations to obtain the desired sub-bands in the FB. With the help of suitable design examples, we show that our FB is a low complexity and flexible alternative to the other digital FBs in the …", "total_citations": 28, "citation_graph": {"2016": 7, "2017": 5, "2018": 4, "2019": 3, "2020": 2, "2021": 1, "2022": 3, "2023": 3}}]}