{"goog_sch_url": "https://scholar.google.com/citations?hl=en&user=N2O4KmIAAAAJ", "name": "Siyuan Liu", "interests": ["Trust", "Crowdsourcing", "Serious Games", "Agent", "Human Computation"], "co_authors_url": [], "citation_table": {"columns": ["All", "Since 2018"], "Citations": [685, 350], "h-index": [14, 9], "i10-index": [18, 9]}, "citation_graph": {"2008": 3, "2009": 3, "2010": 3, "2011": 7, "2012": 20, "2013": 21, "2014": 46, "2015": 74, "2016": 79, "2017": 60, "2018": 41, "2019": 90, "2020": 59, "2021": 69, "2022": 61, "2023": 30}, "articles": [{"title": "Using blockchain to build trusted LoRaWAN sharing server", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=N2O4KmIAAAAJ&pagesize=100&citation_for_view=N2O4KmIAAAAJ:qxL8FJ1GzNcC", "authors": ["Jun Lin", "Zhiqi Shen", "Chunyan Miao", "Siyuan Liu"], "publication_date": "2017/9", "journal": "International Journal of Crowd Science", "description": "Purpose\nWith the rapid growth of the Internet of Things (IoT) market and requirement, low power wide area (LPWA) technologies have become popular. In various LPWA technologies, Narrow Band IoT (NB-IoT) and long range (LoRa) are two main leading competitive technologies. Compared with NB-IoT networks, which are mainly built and managed by mobile network operators, LoRa wide area networks (LoRaWAN) are mainly operated by private companies or organizations, which suggests two issues: trust of the private network operators and lack of network coverage. This study aims to propose a conceptual architecture design of a blockchain built-in solution for LoRaWAN network servers to solve these two issues for LoRaWAN IoT solution.\nDesign/methodology/approach\nThe study proposed modeling, model analysis and architecture design.\nFindings\nThe proposed solution uses the blockchain technology to …", "total_citations": 119, "citation_graph": {"2018": 4, "2019": 47, "2020": 30, "2021": 18, "2022": 12, "2023": 7}}, {"title": "Using blockchain to build trusted LoRaWAN sharing server", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=N2O4KmIAAAAJ&pagesize=100&citation_for_view=N2O4KmIAAAAJ:4TOpqqG69KYC", "authors": ["Jun Lin", "Zhiqi Shen", "Chunyan Miao", "Siyuan Liu"], "publication_date": "2017/9", "journal": "International Journal of Crowd Science", "description": "Purpose\nWith the rapid growth of the Internet of Things (IoT) market and requirement, low power wide area (LPWA) technologies have become popular. In various LPWA technologies, Narrow Band IoT (NB-IoT) and long range (LoRa) are two main leading competitive technologies. Compared with NB-IoT networks, which are mainly built and managed by mobile network operators, LoRa wide area networks (LoRaWAN) are mainly operated by private companies or organizations, which suggests two issues: trust of the private network operators and lack of network coverage. This study aims to propose a conceptual architecture design of a blockchain built-in solution for LoRaWAN network servers to solve these two issues for LoRaWAN IoT solution.\nDesign/methodology/approach\nThe study proposed modeling, model analysis and architecture design.\nFindings\nThe proposed solution uses the blockchain technology to …", "total_citations": 119, "citation_graph": {"2018": 4, "2019": 47, "2020": 30, "2021": 18, "2022": 12, "2023": 7}}, {"title": "A fuzzy logic based reputation model against unfair ratings", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=N2O4KmIAAAAJ&pagesize=100&citation_for_view=N2O4KmIAAAAJ:W7OEmFMy1HYC", "authors": ["Siyuan Liu", "Han Yu", "Chunyan Miao", "Alex C Kot"], "publication_date": "2013/5/6", "book": "Proceedings of the 2013 international conference on Autonomous agents and multi-agent systems", "description": "Reputation systems have become more and more important in facilitating transactions in online systems. However, the accuracy of reputation systems has always been a concern for the users due to the existence of unfair ratings. Though many approaches have been proposed to mitigate the adverse effect of unfair ratings, most of them use the credibility of the rating provider alone to decide whether the rating is unfair without considering other aspects of the rating itself. Models that do consider multiple aspects often combine them through arbitrarily set weights. Therefore, they cannot work well when the credibility is not evaluated accurately or when the weights are not set properly. To resolve this problem, in this paper, we propose a reputation model which considers and combines the temporal, similarity and quantity aspects of the user ratings based on fuzzy logic to improve the accuracy of reputation evaluation. Experimental results based on a set of real user data from a cyber competition show that the proposed model is more robust against unfair ratings than the existing approaches, especially under Sybil attack conditions.", "total_citations": 83, "citation_graph": {"2012": 1, "2013": 1, "2014": 5, "2015": 18, "2016": 15, "2017": 16, "2018": 8, "2019": 7, "2020": 2, "2021": 6, "2022": 2, "2023": 1}}, {"title": "iCLUB: An integrated clustering-based approach to improve the robustness of reputation systems", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=N2O4KmIAAAAJ&pagesize=100&citation_for_view=N2O4KmIAAAAJ:u5HHmVD_uO8C", "authors": ["Siyuan Liu", "Jie Zhang", "Chunyan Miao", "Yin-Leng Theng", "Alex C Kot"], "publication_date": "2011/5/2", "book": "The 10th International Conference on Autonomous Agents and Multiagent Systems-Volume 3", "description": "The problem of unfair testimonies has to be addressed effectively to improve the robustness of reputation systems. We propose an integrated CLUstering-Based approach called iCLUB to filter unfair testimonies for reputation systems using multi-nominal testimonies, in multiagent-based electronic commerce. It adopts clustering and considers buying agents’ local and global knowledge about selling agents. Experimental evaluation demonstrates promising results of our approach in filtering various types of unfair testimonies.", "total_citations": 75, "citation_graph": {"2011": 1, "2012": 9, "2013": 6, "2014": 17, "2015": 15, "2016": 7, "2017": 3, "2018": 4, "2019": 5, "2020": 2, "2021": 3, "2022": 2}}, {"title": "Dynamic witness selection for trustworthy distributed cooperative sensing in cognitive radio networks", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=N2O4KmIAAAAJ&pagesize=100&citation_for_view=N2O4KmIAAAAJ:IjCSPb-OGe4C", "authors": ["Han Yu", "Siyuan Liu", "Alex C Kot", "Chunyan Miao", "Cyril Leung"], "publication_date": "2011/9/25", "conference": "2011 IEEE 13th International Conference on Communication Technology", "description": "Cooperative spectrum sensing by secondary user (SU) nodes in cognitive radio networks (CRNs) is a promising approach to increase the spectrum access efficiency and overall network performance. However, unreliable sensing results or malicious behaviors from cooperator SU nodes can be very disruptive and reduce the network performance. Trust and reputation modeling has been identified as one of the potential solutions to address this problem, but the current centralized trust evaluation approach in CRN lacks scalability. Although some decentralized trust models have been proposed in CRN, without proper protection mechanisms, they are vulnerable to collusive behaviors by the witness SU nodes when they share testimonies about the trustworthiness of neighboring SU nodes. In this paper, we propose a clustering based witness selection method to address this problem. By dividing the witness SU nodes …", "total_citations": 50, "citation_graph": {"2012": 2, "2013": 4, "2014": 6, "2015": 6, "2016": 10, "2017": 5, "2018": 6, "2019": 2, "2020": 2, "2021": 3, "2022": 2}}, {"title": "A block oriented fingerprinting scheme in relational database", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=N2O4KmIAAAAJ&pagesize=100&citation_for_view=N2O4KmIAAAAJ:Y0pCki6q_DkC", "authors": ["Siyuan Liu", "Shuhong Wang", "Robert H Deng", "Weizhong Shao"], "publication_date": "2005", "conference": "Information Security and Cryptology–ICISC 2004: 7th International Conference, Seoul, Korea, December 2-3, 2004, Revised Selected Papers 7", "description": "The need for protecting rights over relational data is of ever increasing concern. There have recently been some pioneering works in this area. In this paper, we propose an effective fingerprinting scheme based on the idea of block method in the area of multimedia fingerprinting. The scheme ensures that certain bit positions of the data contain specific values. The bit positions are determined by the keys known only to the owner of the data and different buyers of the database have different bit positions and different specific values for those bit positions. The detection of the fingerprint can be completed even with a small subset of a marked relation in case that the sample contains the fingerprint. Our extensive analysis shows that the proposed scheme is robust against various forms of attacks, including adding, deleting, shuffling or modifying tuples or attributes and colluding with other recipients of a relation …", "total_citations": 45, "citation_graph": {"2005": 2, "2006": 1, "2007": 1, "2008": 2, "2009": 1, "2010": 3, "2011": 1, "2012": 6, "2013": 3, "2014": 3, "2015": 0, "2016": 0, "2017": 3, "2018": 1, "2019": 1, "2020": 6, "2021": 3, "2022": 4, "2023": 4}}, {"title": "An integrated clustering‐based approach to filtering unfair multi‐nominal testimonies", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=N2O4KmIAAAAJ&pagesize=100&citation_for_view=N2O4KmIAAAAJ:qjMakFHDy7sC", "authors": ["Siyuan Liu", "Jie Zhang", "Chunyan Miao", "Yin‐Leng Theng", "Alex C Kot"], "publication_date": "2014/5", "journal": "Computational Intelligence", "description": "Reputation systems have contributed much to the success of electronic marketplaces. However, the problem of unfair testimonies has to be addressed effectively to improve the robustness of reputation systems. Until now, most of the existing approaches focus only on reputation systems using binary testimonies, and thus have limited applicability and effectiveness. In this paper, We propose an integrated CLUstering‐Based approach called iCLUB to filter unfair testimonies for reputation systems using multinominal testimonies, in an example application of multiagent‐based e‐commerce. It adopts clustering techniques and considers buyer agents’ local as well as global knowledge about seller agents. Experimental evaluation demonstrates the promising results of our approach in filtering various types of unfair testimonies, its robustness against collusion attacks, and better performance compared to competing models.", "total_citations": 35, "citation_graph": {"2013": 3, "2014": 7, "2015": 2, "2016": 4, "2017": 6, "2018": 3, "2019": 4, "2020": 1, "2021": 0, "2022": 3}}, {"title": "An agent-based game for the predictive diagnosis of parkinson's disease", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=N2O4KmIAAAAJ&pagesize=100&citation_for_view=N2O4KmIAAAAJ:WF5omc3nYNoC", "authors": ["Yundong Cai", "Zhiqi Shen", "Siyuan Liu", "Han Yu", "Xiaogang Han", "Jun Ji", "Martin J McKeown", "Cyril Leung", "Chunyan Miao"], "publication_date": "2014/5/5", "book": "Proceedings of the 2014 international conference on Autonomous agents and multi-agent systems", "description": "Existing Parkinson's Disease (PD) diagnosis relies heavily on doctors' observations combined with neurological exams. Such a technique is often inconvenient, infrequent, and subjective, which leads to a high misdiagnosis rate. As several cardinal symptoms of PD require long term observations, a technology platform which allows potential PD patients to exhibit related behaviors in a natural setting over long period of time is needed. In this paper, we describe an agent-based game for the predictive diagnosis of PD. Agents in this tablet based game provide companionship, encouragement, and analysis capabilities to help retain users' interest, and analyze their risk of developing PD symptoms based on their in-game behavior. The game has been launched together with a world renowned PD research centre for clinical trial. It can potentially provide a new dimension of longitudinal interactive behavior data to assist …", "total_citations": 32, "citation_graph": {"2015": 11, "2016": 12, "2017": 1, "2018": 2, "2019": 0, "2020": 1, "2021": 1}}, {"title": "An incentive mechanism to elicit truthful opinions for crowdsourced multiple choice consensus tasks", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=N2O4KmIAAAAJ&pagesize=100&citation_for_view=N2O4KmIAAAAJ:_FxGoFyzp5QC", "authors": ["Siyuan Liu", "Chunyan Miao", "Yuan Liu", "Han Yu", "Jie Zhang", "Cyril Leung"], "publication_date": "2015/12/6", "conference": "2015 IEEE/WIC/ACM International Conference on Web Intelligence and Intelligent Agent Technology (WI-IAT)", "description": "Crowdsourcing is a rapidly growing technology to harness human intelligence to solve problems that are not suitable for automation. It is especially suitable for consensus tasks which collect opinions from human workers to gain insight into real-world phenomena. In these tasks, motivating workers to provide their truthful opinions is a challenging problem. Most existing incentive mechanisms proposed to address this problem assume that workers share a common prior. However, this assumption is not always valid in practice, resulting in that the existing approaches may discourage workers to provide their truthful opinions. In this paper, we propose a novel incentive mechanism -- iMET -- to elicit truthful opinions for crowdsourced multiple-choice consensus tasks. By incorporating the concepts of worker credibility and similarity, iMET rewards workers for providing truthful opinions without assuming a common prior …", "total_citations": 19, "citation_graph": {"2015": 1, "2016": 8, "2017": 4, "2018": 1, "2019": 2, "2020": 0, "2021": 1}}, {"title": "Productive aging through intelligent personalized crowdsourcing", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=N2O4KmIAAAAJ&pagesize=100&citation_for_view=N2O4KmIAAAAJ:kNdYIx-mwKoC", "authors": ["Han Yu", "Chunyan Miao", "Siyuan Liu", "Zhengxiang Pan", "Nur Syahidah Khalid", "Zhiqi Shen", "Cyril Leung"], "publication_date": "2016/3/5", "journal": "Proceedings of the AAAI Conference on Artificial Intelligence", "description": "The current generation of senior citizens are enjoying unparalleled levels of good health than previous generations. The need for personal fulfilment after retirement has driven many of them to participate in productive aging activities such as volunteering. This paper outlines the Silver Productive (SP) mobile app, a system powered by the RTS-P intelligent personalized task sub-delegation approach with dynamic worker effort pricing functions. It provides an algorithmic crowdsourcing platform to enable seniors to contribute their effort through productive aging activities and help organizations efficiently utilize seniors' collective productivity.", "total_citations": 17, "citation_graph": {"2015": 1, "2016": 5, "2017": 4, "2018": 1, "2019": 0, "2020": 2, "2021": 2, "2022": 2}}, {"title": "A dempster-shafer theory based witness trustworthiness model to cope with unfair ratings in e-marketplace", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=N2O4KmIAAAAJ&pagesize=100&citation_for_view=N2O4KmIAAAAJ:d1gkVwhDpl0C", "authors": ["Siyuan Liu", "Alex C Kot", "Chunyan Miao", "Yin-Leng Theng"], "publication_date": "2012/8/7", "book": "Proceedings of the 14th annual international conference on electronic commerce", "description": "Reputation systems have contributed much to resisting against the threats from malicious seller agents in electronic marketplaces. Buyer agents can benefit from modeling the reputation of seller agents to make a decision on which seller to have transaction with. However, the existence of unfair ratings decreases the accuracy of the seller agents' reputation evaluation, which will lead to inappropriate sellers to be selected and hence harm buyers' profits. In this paper, to address the problem of unfair ratings, we propose a witness trustworthiness model based on Dempster-Shafer theory to evaluate the trustworthiness of a witness's ratings regarding a particular seller. The proposed approach uses local and global ratings together to model a witness's trustworthiness which is specific for different sellers. The experimental results demonstrate that the proposed approach can effectively address the problem of unfair …", "total_citations": 17, "citation_graph": {"2013": 2, "2014": 2, "2015": 5, "2016": 0, "2017": 3, "2018": 1, "2019": 2, "2020": 0, "2021": 0, "2022": 1, "2023": 1}}, {"title": "Ping pong: An exergame for cognitive inhibition training", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=N2O4KmIAAAAJ&pagesize=100&citation_for_view=N2O4KmIAAAAJ:9ZlFYXVOiuMC", "authors": ["Hao Zhang", "Zhiqi Shen", "Siyuan Liu", "Dazhong Yuan", "Chunyan Miao"], "publication_date": "2021/7/21", "journal": "International Journal of Human–Computer Interaction", "description": "Cognitive inhibition, a key constituent of healthy cognition, has been shown to be susceptible to age-related cognitive declines. Research has shown that cognitive rehabilitation training can facilitate older adults to maintain healthy cognitive functions. Compared to cognitive rehabilitation alone, the combination of physical and cognitive exercises is more effective to train older adults’ cognitive functions. Focusing on the training of older adults’ cognitive inhibition, we design the Ping Pong exergame in this work, which incorporates the traditional cognitive task with physical exercises in the game environment to improve older adults’ cognitive inhibition. A longitudinal study was conducted to evaluate the usability of Ping Pong exergame and its effectiveness on training older adults’ cognitive inhibition. The results show that the Ping Pong exergame received a good usability score and players presented significantly …", "total_citations": 16, "citation_graph": {"2021": 7, "2022": 5, "2023": 4}}]}