{"goog_sch_url": "https://scholar.google.com/citations?hl=en&user=LybJ7ksAAAAJ", "name": "Long Cheng", "interests": ["data management", "data mining"], "co_authors_url": [], "citation_table": {"columns": ["All", "Since 2018"], "Citations": [1868, 1567], "h-index": [25, 24], "i10-index": [45, 45]}, "citation_graph": {"2014": 27, "2015": 61, "2016": 78, "2017": 104, "2018": 99, "2019": 118, "2020": 180, "2021": 328, "2022": 395, "2023": 442}, "articles": [{"title": "Collective spatial keyword queries: a distance owner-driven approach", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=LybJ7ksAAAAJ&pagesize=100&citation_for_view=LybJ7ksAAAAJ:u-x6o8ySG0sC", "authors": ["Cheng Long", "Raymond Chi-Wing Wong", "Ke Wang", "Ada Wai-Chee Fu"], "publication_date": "2013/6/22", "book": "Proceedings of the 2013 ACM SIGMOD International Conference on Management of Data", "description": "Recently, spatial keyword queries become a hot topic in the literature. One example of these queries is the collective spatial keyword query (CoSKQ) which is to find a set of objects in the database such that it covers a set of given keywords collectively and has the smallest cost. Unfortunately, existing exact algorithms have severe scalability problems and existing approximate algorithms, though scalable, cannot guarantee near-to-optimal solutions. In this paper, we study the CoSKQ problem and address the above issues.\nFirstly, we consider the CoSKQ problem using an existing cost measurement called the maximum sum cost. This problem is called MaxSum-CoSKQ and is known to be NP-hard. We observe that the maximum sum cost of a set of objects is dominated by at most three objects which we call the distance owners of the set. Motivated by this, we propose a distance owner-driven approach which …", "total_citations": 147, "citation_graph": {"2012": 1, "2013": 1, "2014": 10, "2015": 21, "2016": 12, "2017": 29, "2018": 16, "2019": 18, "2020": 16, "2021": 15, "2022": 3, "2023": 2}}, {"title": "Direction-preserving trajectory simplification", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=LybJ7ksAAAAJ&pagesize=100&citation_for_view=LybJ7ksAAAAJ:UeHWp8X0CEIC", "authors": ["Cheng Long", "Raymond Chi-Wing Wong", "HV Jagadish"], "publication_date": "2013/8/1", "journal": "Proceedings of the VLDB Endowment", "description": "Trajectories of moving objects are collected in many applications. Raw trajectory data is typically very large, and has to be simplified before use. In this paper, we introduce the notion of direction-preserving trajectory simplification, and show both analytically and empirically that it can support a broader range of applications than traditional position-preserving trajectory simplification. We present a polynomial-time algorithm for optimal direction-preserving simplification, and another approximate algorithm with a quality guarantee. Extensive experimental evaluation with real trajectory data shows the benefit of the new techniques.", "total_citations": 109, "citation_graph": {"2012": 1, "2013": 0, "2014": 3, "2015": 8, "2016": 14, "2017": 14, "2018": 13, "2019": 12, "2020": 10, "2021": 16, "2022": 11, "2023": 4}}, {"title": "On good and fair paper-reviewer assignment", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=LybJ7ksAAAAJ&pagesize=100&citation_for_view=LybJ7ksAAAAJ:2osOgNQ5qMEC", "authors": ["Cheng Long", "Raymond Chi-Wing Wong", "Yu Peng", "Liangliang Ye"], "publication_date": "2013/12/7", "conference": "2013 IEEE 13th International Conference on Data Mining (ICDM)", "description": "Peer review has become the most common practice for judging papers submitted to a conference for decades. An extremely important task involved in peer review is to assign submitted papers to reviewers with appropriate expertise which is referred to as paper-reviewer assignment. In this paper, we study the paper-reviewer assignment problem from both the goodness aspect and the fairness aspect. For the goodness aspect, we propose to maximize the topic coverage of the paper-reviewer assignment. This objective is new and the problem based on this objective is shown to be NP-hard. To solve this problem efficiently, we design an approximate algorithm which gives a 1/3-approximation. For the fairness aspect, we perform a detailed study on conflict-of-interest (COI) types and discuss several issues related to using COI, which, we hope, can raise some open discussions among researchers on the COI study …", "total_citations": 89, "citation_graph": {"2015": 4, "2016": 6, "2017": 5, "2018": 6, "2019": 11, "2020": 10, "2021": 17, "2022": 12, "2023": 16}}, {"title": "Adaptive dynamic bipartite graph matching: A reinforcement learning approach", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=LybJ7ksAAAAJ&pagesize=100&citation_for_view=LybJ7ksAAAAJ:mVmsd5A6BfQC", "authors": ["Yansheng Wang", "Yongxin Tong", "Cheng Long", "Pan Xu", "Ke Xu", "Weifeng Lv"], "publication_date": "2019/4/8", "conference": "2019 IEEE 35th international conference on data engineering (ICDE)", "description": "Online bipartite graph matching is attracting growing research attention due to the development of dynamic task assignment in sharing economy applications, where tasks need be assigned dynamically to workers. Past studies lack practicability in terms of both problem formulation and solution framework. On the one hand, some problem settings in prior online bipartite graph matching research are impractical for real-world applications. On the other hand, existing solutions to online bipartite graph matching are inefficient due to the unnecessary real-time decision making. In this paper, we propose the dynamic bipartite graph matching (DBGM) problem to be better aligned with real-world applications and devise a novel adaptive batch-based solution framework with a constant competitive ratio. As an effective and efficient implementation of the solution framework, we design a reinforcement learning based algorithm …", "total_citations": 88, "citation_graph": {"2019": 4, "2020": 23, "2021": 19, "2022": 15, "2023": 27}}, {"title": "Minimizing Seed Set for Viral Marketing", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=LybJ7ksAAAAJ&pagesize=100&citation_for_view=LybJ7ksAAAAJ:u5HHmVD_uO8C", "authors": ["Cheng Long", "RC-W Wong"], "publication_date": "2011/12/11", "conference": "2011 IEEE 11th International Conference on Data Mining (ICDM)", "description": "Viral marketing has attracted considerable concerns in recent years due to its novel idea of leveraging the social network to propagate the awareness of products. Specifically, viral marketing is to first target a limited number of users (seeds) in the social network by providing incentives, and these targeted users would then initiate the process of awareness spread by propagating the information to their friends via their social relationships. Extensive studies have been conducted for maximizing the awareness spread given the number of seeds. However, all of them fail to consider the common scenario of viral marketing where companies hope to use as few seeds as possible yet influencing at least a certain number of users. In this paper, we propose a new problem, called J-MIN-Seed, whose objective is to minimize the number of seeds while at least J users are influenced. J-MIN-Seed, unfortunately, is proved to be …", "total_citations": 88, "citation_graph": {"2011": 1, "2012": 2, "2013": 2, "2014": 8, "2015": 6, "2016": 13, "2017": 6, "2018": 7, "2019": 10, "2020": 9, "2021": 10, "2022": 6, "2023": 4}}, {"title": "Efficient algorithms for optimal location queries in road networks", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=LybJ7ksAAAAJ&pagesize=100&citation_for_view=LybJ7ksAAAAJ:Tyk-4Ss8FVUC", "authors": ["Zitong Chen", "Yubao Liu", "Raymond Chi-Wing Wong", "Jiamin Xiong", "Ganglin Mai", "Cheng Long"], "publication_date": "2014/6/18", "book": "Proceedings of the 2014 ACM SIGMOD international conference on Management of data", "description": "In this paper, we study the optimal location query problem based on road networks. Specifically, we have a road network on which some clients and servers are located. Each client finds the server that is closest to her for service and her cost of getting served is equal to the (network) distance between the client and the server serving her multiplied by her weight or importance. The optimal location query problem is to find a location for setting up a new server such that the maximum cost of clients being served by the servers (including the new server) is minimized. This problem has been studied before, but the state-of-the-art is still not efficient enough. In this paper, we propose an efficient algorithm for the optimal location query problem, which is based on a novel idea of \\emph{nearest location component}. We also discuss three extensions of the optimal location query problem, namely the optimal multiple-location …", "total_citations": 72, "citation_graph": {"2014": 2, "2015": 7, "2016": 10, "2017": 15, "2018": 9, "2019": 7, "2020": 4, "2021": 5, "2022": 4, "2023": 7}}, {"title": "Trajectory simplification: On minimizing the direction-based error", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=LybJ7ksAAAAJ&pagesize=100&citation_for_view=LybJ7ksAAAAJ:YsMSGLbcyi4C", "authors": ["Cheng Long", "Raymond Chi-Wing Wong", "HV Jagadish"], "publication_date": "2014/9/1", "journal": "Proceedings of the VLDB Endowment", "description": "Trajectory data is central to many applications with moving objects. Raw trajectory data is usually very large, and so is simplified before it is stored and processed. Many trajectory simplification notions have been proposed, and among them, the direction-preserving trajectory simplification (DPTS) which aims at protecting the direction information has been shown to perform quite well. However, existing studies on DPTS require users to specify an error tolerance which users might not know how to set properly in some cases (e.g., the error tolerance could only be known at some future time and simply setting one error tolerance does not meet the needs since the simplified trajectories would usually be used in many different applications which accept different error tolerances). In these cases, a better solution is to minimize the error while achieving a pre-defined simplification size. For this purpose, in this paper, we …", "total_citations": 66, "citation_graph": {"2015": 1, "2016": 6, "2017": 8, "2018": 12, "2019": 5, "2020": 8, "2021": 12, "2022": 10, "2023": 3}}, {"title": "Viral marketing for dedicated customers", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=LybJ7ksAAAAJ&pagesize=100&citation_for_view=LybJ7ksAAAAJ:Y0pCki6q_DkC", "authors": ["Cheng Long", "Raymond Chi-Wing Wong"], "publication_date": "2014/12/1", "journal": "Information systems", "description": "Viral marketing has attracted considerable concerns in recent years due to its novel idea of leveraging the social network to propagate the awareness of products. Specifically, viral marketing first targets a limited number of users (seeds) in the social network by providing incentives, and these targeted users would then initiate the process of awareness spread by propagating the information to their friends via their social relationships. Extensive studies have been conducted for maximizing the awareness spread given the number of seeds (the Influence Maximization problem). However, all of them fail to consider the common scenario of viral marketing where companies hope to use as few seeds as possible yet influencing at least a certain number of users. In this paper, we propose a new problem, called J-MIN-Seed, whose objective is to minimize the number of seeds while at least J users are influenced. J-MIN …", "total_citations": 61, "citation_graph": {"2014": 2, "2015": 2, "2016": 3, "2017": 10, "2018": 9, "2019": 3, "2020": 15, "2021": 2, "2022": 6, "2023": 6}}, {"title": "Unsupervised fake news detection: A graph-based approach", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=LybJ7ksAAAAJ&pagesize=100&citation_for_view=LybJ7ksAAAAJ:bEWYMUwI8FkC", "authors": ["Siva Charan Reddy Gangireddy", "Deepak P", "Cheng Long", "Tanmoy Chakraborty"], "publication_date": "2020/7/13", "book": "Proceedings of the 31st ACM conference on hypertext and social media", "description": "Fake news has become more prevalent than ever, correlating with the rise of social media that allows every user to rapidly publish their views or hearsay. Today, fake news spans almost every realm of human activity, across diverse fields such as politics and healthcare. Most existing methods for fake news detection leverage supervised learning methods and expect a large labelled corpus of articles and social media user engagement information, which are often hard, time-consuming and costly to procure. In this paper, we consider the task of unsupervised fake news detection, which considers fake news detection in the absence of labelled historical data. We develop GTUT, a graph-based approach for the task which operates in three phases. Starting off with identifying a seed set of fake and legitimate articles exploiting high-level observations on inter-user behavior in fake news propagation, it progressively …", "total_citations": 55, "citation_graph": {"2020": 5, "2021": 21, "2022": 12, "2023": 16}}, {"title": "Long short‐term memory neural network for ionospheric total electron content forecasting over China", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=LybJ7ksAAAAJ&pagesize=100&citation_for_view=LybJ7ksAAAAJ:GnPB-g6toBAC", "authors": ["Pan Xiong", "Dulin Zhai", "Cheng Long", "Huiyu Zhou", "Xuemin Zhang", "Xuhui Shen"], "publication_date": "2021/4", "journal": "Space Weather", "description": "An increasing number of terrestrial‐ and space‐based radio‐communication systems are influenced by the ionospheric space weather, making the ionospheric state increasingly important to forecast. In this study, a novel extended encoder‐decoder long short‐term memory extended (ED‐LSTME) neural network, which can predict ionospheric total electron content (TEC) is proposed. Useful inherent features were automatically extracted from the historical TEC by LSTM layers, and the performance of the proposed model was enhanced by considering solar flux and geomagnetic activity data. The proposed ED‐LSTME model was validated using 15‐min TEC values from GPS measurements over one solar cycle (from January 2006 to July 2018) collected at 15 GPS stations in China. Different assessment experiments were conducted in different geographical locations and seasons as well as under varying …", "total_citations": 53, "citation_graph": {"2021": 4, "2022": 27, "2023": 22}}, {"title": "Learning to generate maps from trajectories", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=LybJ7ksAAAAJ&pagesize=100&citation_for_view=LybJ7ksAAAAJ:mB3voiENLucC", "authors": ["Sijie Ruan", "Cheng Long", "Jie Bao", "Chunyang Li", "Zisheng Yu", "Ruiyuan Li", "Yuxuan Liang", "Tianfu He", "Yu Zheng"], "publication_date": "2020/4/3", "journal": "Proceedings of the AAAI conference on artificial intelligence", "description": "Accurate and updated road network data is vital in many urban applications, such as car-sharing, and logistics. The traditional approach to identifying the road network, ie, field survey, requires a significant amount of time and effort. With the wide usage of GPS embedded devices, a huge amount of trajectory data has been generated by different types of mobile objects, which provides a new opportunity to extract the underlying road network. However, the existing trajectory-based map recovery approaches require many empirical parameters and do not utilize the prior knowledge in existing maps, which over-simplifies or over-complicates the reconstructed road network. To this end, we propose a deep learning-based map generation framework, ie, DeepMG, which learns the structure of the existing road network to overcome the noisy GPS positions. More specifically, DeepMG extracts features from trajectories in both spatial view and transition view and uses a convolutional deep neural network T2RNet to infer road centerlines. After that, a trajectory-based post-processing algorithm is proposed to refine the topological connectivity of the recovered map. Extensive experiments on two real-world trajectory datasets confirm that DeepMG significantly outperforms the state-of-the-art methods.", "total_citations": 50, "citation_graph": {"2020": 6, "2021": 9, "2022": 18, "2023": 17}}, {"title": "Efficient k-regret query algorithm with restriction-free bound for any dimensionality", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=LybJ7ksAAAAJ&pagesize=100&citation_for_view=LybJ7ksAAAAJ:4DMP91E08xMC", "authors": ["Min Xie", "Raymond Chi-Wing Wong", "Jian Li", "Cheng Long", "Ashwin Lall"], "publication_date": "2018/5/27", "book": "Proceedings of the 2018 international conference on management of data", "description": "Extracting interesting tuples from a large database is an important problem in multi-criteria decision making. Two representative queries were proposed in the literature: top- k queries and skyline queries. A top- k query requires users to specify their utility functions beforehand and then returns k tuples to the users. A skyline query does not require any utility function from users but it puts no control on the number of tuples returned to users. Recently, a k-regret query was proposed and received attention from the community because it does not require any utility function from users and the output size is controllable, and thus it avoids those deficiencies of top- k queries and skyline queries. Specifically, it returns k tuples that minimize a criterion called the maximum regret ratio .\nIn this paper, we present the lower bound of the maximum regret ratio for the k -regret query. Besides, we propose a novel algorithm, called …", "total_citations": 49, "citation_graph": {"2018": 5, "2019": 4, "2020": 7, "2021": 13, "2022": 15, "2023": 5}}, {"title": "Multimode process monitoring based on robust dictionary learning with application to aluminium electrolysis process", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=LybJ7ksAAAAJ&pagesize=100&citation_for_view=LybJ7ksAAAAJ:ZeXyd9-uunAC", "authors": ["Chunhua Yang", "Longfei Zhou", "Keke Huang", "Hongquan Ji", "Cheng Long", "Xiaofang Chen", "Yongfang Xie"], "publication_date": "2019/3/7", "journal": "Neurocomputing", "description": "In modern process industries, many parameters or states can be acquired with sensors, and these parameters or states often have a close relationship with operation conditions. Unfortunately, the process often operates under different modes, and labels thereof are often unknown. In practice, labeling for sampled data is expensive and time-consuming, so identifying the operation conditions of the industrial process is difficult. In addition, sampled data from the industrial system are always contaminated by outliers or noise. Therefore, a robust process monitoring method for the multimode process is particularly important and challenging. In this paper, a robust dictionary learning method is proposed for processes with multiple unknown modes. Firstly, by taking the sparsity of outliers into account, a robust dictionary learning method is proposed to identify and remove the outliers and noise in the sampled training data …", "total_citations": 47, "citation_graph": {"2019": 2, "2020": 11, "2021": 12, "2022": 13, "2023": 9}}, {"title": "Context-aware deep model for joint mobility and time prediction", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=LybJ7ksAAAAJ&pagesize=100&citation_for_view=LybJ7ksAAAAJ:TQgYirikUcIC", "authors": ["Yile Chen", "Cheng Long", "Gao Cong", "Chenliang Li"], "publication_date": "2020/1/20", "book": "Proceedings of the 13th International Conference on Web Search and Data Mining", "description": "Mobility prediction, which is to predict where a user will arrive based on the user's historical mobility records, has attracted much attention. We argue that it is more useful to know not only where but also when a user will arrive next in many scenarios such as targeted advertising and taxi service. In this paper, we propose a novel context-aware deep model called DeepJMT for jointly performing mobility prediction (to know where) and time prediction (to know when). The DeepJMT model consists of (1) a hierarchical recurrent neural network (RNN) based sequential dependency encoder, which is more capable of capturing a user's mobility regularities and temporal patterns compared to vanilla RNN based models; (2) a spatial context extractor and a periodicity context extractor to extract location semantics and the user's periodicity, respectively; and (3) a co-attention based social & temporal context extractor which …", "total_citations": 45, "citation_graph": {"2020": 2, "2021": 18, "2022": 15, "2023": 10}}, {"title": "Towards advancing the earthquake forecasting by machine learning of satellite data", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=LybJ7ksAAAAJ&pagesize=100&citation_for_view=LybJ7ksAAAAJ:hMod-77fHWUC", "authors": ["Pan Xiong", "Lei Tong", "Kun Zhang", "Xuhui Shen", "Roberto Battiston", "Dimitar Ouzounov", "Roberto Iuppa", "Danny Crookes", "Cheng Long", "Huiyu Zhou"], "publication_date": "2021/6/1", "journal": "Science of The Total Environment", "description": "Earthquakes have become one of the leading causes of death from natural hazards in the last fifty years. Continuous efforts have been made to understand the physical characteristics of earthquakes and the interaction between the physical hazards and the environments so that appropriate warnings may be generated before earthquakes strike. However, earthquake forecasting is not trivial at all. Reliable forecastings should include the analysis and the signals indicating the coming of a significant quake. Unfortunately, these signals are rarely evident before earthquakes occur, and therefore it is challenging to detect such precursors in seismic analysis. Among the available technologies for earthquake research, remote sensing has been commonly used due to its unique features such as fast imaging and wide image-acquisition range. Nevertheless, early studies on pre-earthquake and remote-sensing anomalies …", "total_citations": 44, "citation_graph": {"2021": 7, "2022": 17, "2023": 20}}, {"title": "Interaction-aware kalman neural networks for trajectory prediction", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=LybJ7ksAAAAJ&pagesize=100&citation_for_view=LybJ7ksAAAAJ:qUcmZB5y_30C", "authors": ["Ce Ju", "Zheng Wang", "Cheng Long", "Xiaoyu Zhang", "Dong Eui Chang"], "publication_date": "2020/10/19", "conference": "2020 IEEE Intelligent Vehicles Symposium (IV)", "description": "Forecasting the motion of surrounding obstacles (vehicles, bicycles, pedestrians and etc.) benefits the on-road motion planning for intelligent and autonomous vehicles. Complex scenes always yield great challenges in modeling the patterns of surrounding traffic. For example, one main challenge comes from the intractable interaction effects in a complex traffic system. In this paper, we propose a multi-layer architecture Interaction-aware Kalman Neural Networks (IaKNN) which involves an interaction layer for resolving high-dimensional traffic environmental observations as interaction-aware accelerations, a motion layer for transforming the accelerations to interaction-aware trajectories, and a filter layer for estimating future trajectories with a Kalman filter network. Attributed to the multiple traffic data sources, our end-to-end trainable approach technically fuses dynamic and interaction-aware trajectories boosting the …", "total_citations": 44, "citation_graph": {"2019": 1, "2020": 5, "2021": 8, "2022": 17, "2023": 12}}, {"title": "Effective and efficient sports play retrieval with deep representation learning", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=LybJ7ksAAAAJ&pagesize=100&citation_for_view=LybJ7ksAAAAJ:IWHjjKOFINEC", "authors": ["Zheng Wang", "Cheng Long", "Gao Cong", "Ce Ju"], "publication_date": "2019/7/25", "book": "Proceedings of the 25th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining", "description": "With the proliferation of commercial tracking systems, sports data is being generated at an unprecedented speed and the interest in sports play retrieval has grown dramatically as well. However, it is challenging to design an effective, efficient and robust similarity measure for sports play retrieval. To this end, we propose a deep learning approach to learn the representations of sports plays, called play2vec, which is robust against noise and takes only linear time to compute the similarity between two sports plays. We conduct experiments on real-world soccer match data, and the results show that our solution performs more effectively and efficiently compared with the state-of-the-art methods.", "total_citations": 37, "citation_graph": {"2019": 1, "2020": 8, "2021": 11, "2022": 8, "2023": 9}}]}