{"goog_sch_url": "https://scholar.google.com/citations?hl=en&user=jhD-lGAAAAAJ", "name": "Vidya Sudarshan", "interests": [], "co_authors_url": [{"name": "U Rajendra Acharya (SCI Highly Cited...", "url": "https://scholar.google.com/citations?user=8FjY99sAAAAJ&hl=en", "aff": "Professor of Artificial Intelligence in Healthcare,University of Southern Queensland, Australia", "citation_table": {"columns": ["All", "Since 2018"], "Citations": [74868, 58392], "h-index": [136, 120], "i10-index": [657, 605]}}, {"name": "Joel Koh En Wei", "url": "https://scholar.google.com/citations?user=OS0w9RgAAAAJ&hl=en", "aff": "AI Scientist, Cogninet Australia Pty Ltd", "citation_table": {"columns": ["All", "Since 2018"], "Citations": [4191, 3669], "h-index": [35, 34], "i10-index": [56, 56]}}, {"name": "jen hong, tan", "url": "https://scholar.google.com/citations?user=uJlD-A0AAAAJ&hl=en", "aff": "Highly Cited Researcher in Computer Science, National University of Singapore", "citation_table": {"columns": ["All", "Since 2018"], "Citations": [13016, 11534], "h-index": [52, 47], "i10-index": [82, 77]}}, {"name": "Ru San Tan", "url": "https://scholar.google.com/citations?user=2IBQZ50AAAAJ&hl=en", "aff": "Consultant, National Heart Centre;Duke-NUS Medical School", "citation_table": {"columns": ["All", "Since 2018"], "Citations": [19350, 13996], "h-index": [63, 56], "i10-index": [215, 184]}}, {"name": "Hamido Fujita", "url": "https://scholar.google.com/citations?user=MxzV1nQAAAAJ&hl=en", "aff": "Iwate Prefectural University", "citation_table": {"columns": ["All", "Since 2018"], "Citations": [24484, 22582], "h-index": [82, 81], "i10-index": [304, 273]}}, {"name": "Shu Lih Oh", "url": "https://scholar.google.com/citations?user=r1loSs8AAAAJ&hl=en", "aff": "AI Scientist, Cogninet Australia Pty Ltd", "citation_table": {"columns": ["All", "Since 2018"], "Citations": [11077, 10876], "h-index": [38, 38], "i10-index": [58, 58]}}, {"name": "Kuang Chua Chua", "url": "https://scholar.google.com/citations?user=IyJ3oDgAAAAJ&hl=en", "aff": "Ngee Ann Polytechnic, Singapore", "citation_table": {"columns": ["All", "Since 2018"], "Citations": [7112, 4819], "h-index": [47, 38], "i10-index": [64, 58]}}, {"name": "Yuki Hagiwara", "url": "https://scholar.google.com/citations?user=P6WI2DQAAAAJ&hl=en", "aff": "Highly Cited Researcher in Cross-Field, Fraunhofer IKS", "citation_table": {"columns": ["All", "Since 2018"], "Citations": [9511, 9297], "h-index": [34, 34], "i10-index": [48, 48]}}, {"name": "Muhammad Adam", "url": "https://scholar.google.com/citations?user=zXBM-D4AAAAJ&hl=en", "aff": "Department of Biomedical Engineering, Temasek Polytechnic, Singapore", "citation_table": {"columns": ["All", "Since 2018"], "Citations": [5089, 4898], "h-index": [19, 19], "i10-index": [23, 23]}}, {"name": "EYK Ng", "url": "https://scholar.google.com/citations?user=9QW1LYAAAAAJ&hl=en", "aff": "Nanyang Technological University", "citation_table": {"columns": ["All", "Since 2018"], "Citations": [17823, 10027], "h-index": [68, 48], "i10-index": [266, 198]}}, {"name": "Filippo Molinari", "url": "https://scholar.google.com/citations?user=ttbUYiQAAAAJ&hl=en", "aff": "Full Professor of Biomedical Engineering, Politecnico di Torino", "citation_table": {"columns": ["All", "Since 2018"], "Citations": [9178, 5749], "h-index": [52, 40], "i10-index": [159, 131]}}, {"name": "Oliver Faust", "url": "https://scholar.google.com/citations?user=srIlYwwAAAAJ&hl=en", "aff": "Anglia Ruskin University Cambridge Campus", "citation_table": {"columns": ["All", "Since 2018"], "Citations": [7116, 5144], "h-index": [40, 38], "i10-index": [81, 63]}}, {"name": "Hojjat Adeli", "url": "https://scholar.google.com/citations?user=TQMpoh8AAAAJ&hl=en", "aff": "The Ohio State University", "citation_table": {"columns": ["All", "Since 2018"], "Citations": [48141, 25019], "h-index": [130, 85], "i10-index": [398, 295]}}, {"name": "Muthu Rama Krishnan Mookiah, PhD", "url": "https://scholar.google.com/citations?user=50dKdRYAAAAJ&hl=en", "aff": "Postdoctoral Researcher, University of Dundee, Scotland, UK", "citation_table": {"columns": ["All", "Since 2018"], "Citations": [4129, 2759], "h-index": [38, 31], "i10-index": [59, 50]}}, {"name": "Vinitha Sree S", "url": "https://scholar.google.com/citations?user=YKcX4D0AAAAJ&hl=en", "aff": "Principal Data Scientist, Egoscue Foundation", "citation_table": {"columns": ["All", "Since 2018"], "Citations": [7947, 4999], "h-index": [43, 37], "i10-index": [63, 56]}}, {"name": "Louis Tong", "url": "https://scholar.google.com/citations?user=lnRSnNEAAAAJ&hl=en", "aff": "Professor, Eye-ACP, Duke-National University of Singapore Medical School, Singapore", "citation_table": {"columns": ["All", "Since 2018"], "Citations": [15470, 9838], "h-index": [63, 49], "i10-index": [191, 166]}}], "citation_table": {"columns": ["All", "Since 2018"], "Citations": [3371, 2786], "h-index": [29, 27], "i10-index": [40, 39]}, "citation_graph": {}, "articles": [{"title": "Application of entropies for automated diagnosis of epilepsy using EEG signals: A review", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:WF5omc3nYNoC", "authors": ["U Rajendra Acharya", "Hamido Fujita", "Vidya K Sudarshan", "Shreya Bhat", "Joel EW Koh"], "publication_date": "2015/11/1", "description": "Epilepsy is the neurological disorder of the brain which is difficult to diagnose visually using Electroencephalogram (EEG) signals. Hence, an automated detection of epilepsy using EEG signals will be a useful tool in medical field. The automation of epilepsy detection using signal processing techniques such as wavelet transform and entropies may optimise the performance of the system. Many algorithms have been developed to diagnose the presence of seizure in the EEG signals. The entropy is a nonlinear parameter that reflects the complexity of the EEG signal. Many entropies have been used to differentiate normal, interictal and ictal EEG signals. This paper discusses various entropies used for an automated diagnosis of epilepsy using EEG signals. We have presented unique ranges for various entropies used to differentiate normal, interictal, and ictal EEG signals and also ranked them depending on the …", "total_citations": 453, "citation_graph": {"2016": 41, "2017": 50, "2018": 64, "2019": 55, "2020": 52, "2021": 66, "2022": 70, "2023": 50}}, {"title": "Automated detection and localization of myocardial infarction using electrocardiogram: a comparative study of different leads", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:UebtZRa9Y70C", "authors": ["U Rajendra Acharya", "Hamido Fujita", "Vidya K Sudarshan", "Shu Lih Oh", "Muhammad Adam", "Joel EW Koh", "Jen Hong Tan", "Dhanjoo N Ghista", "Roshan Joy Martis", "Chua K Chua", "Chua Kok Poo", "Ru San Tan"], "publication_date": "2016/5/1", "journal": "Knowledge-Based Systems", "description": "Identification and timely interpretation of changes occurring in the 12 electrocardiogram (ECG) leads is crucial to identify the types of myocardial infarction (MI). However, manual annotation of this complex nonlinear ECG signal is not only cumbersome and time consuming but also inaccurate. Hence, there is a need of computer aided techniques to be applied for the ECG signal analysis process. Going further, there is a need for incorporating this computerized software into the ECG equipment, so as to enable automated detection of MIs in clinics. Therefore, this paper proposes a novel method of automated detection and localization of MI by using ECG signal analysis. In our study, a total of 200 twelve lead ECG subjects (52 normal and 148 with MI) involving 611,405 beats (125,652 normal beats and 485,753 beats of MI ECG) are segmented from the 12 lead ECG signals. Firstly, ECG signal obtained from 12 ECG …", "total_citations": 224, "citation_graph": {"2016": 6, "2017": 25, "2018": 19, "2019": 34, "2020": 33, "2021": 42, "2022": 38, "2023": 27}}, {"title": "A novel depression diagnosis index using nonlinear features in EEG signals", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:eQOLeE2rZwMC", "authors": ["U Rajendra Acharya", "Vidya K Sudarshan", "Hojjat Adeli", "Jayasree Santhosh", "Joel EW Koh", "Subha D Puthankatti", "Amir Adeli"], "publication_date": "2015/9/1", "journal": "European neurology", "description": "Depression is a mental disorder characterized by persistent occurrences of lower mood states in the affected person. The electroencephalogram (EEG) signals are highly complex, nonlinear, and nonstationary in nature. The characteristics of the signal vary with the age and mental state of the subject. The signs of abnormality may be invisible to the naked eyes. Even when they are visible, deciphering the minute changes indicating abnormality is tedious and time consuming for the clinicians. This paper presents a novel method for automated EEG-based diagnosis of depression using nonlinear methods: fractal dimension, largest Lyapunov exponent, sample entropy, detrended fluctuation analysis, Hurst's exponent, higher order spectra, and recurrence quantification analysis. A novel Depression Diagnosis Index (DDI) is presented through judicious combination of the nonlinear features. The DDI calculated …", "total_citations": 220, "citation_graph": {"2015": 2, "2016": 7, "2017": 26, "2018": 21, "2019": 39, "2020": 23, "2021": 35, "2022": 33, "2023": 32}}, {"title": "Automated characterization and classification of coronary artery disease and myocardial infarction by decomposition of ECG signals: A comparative study", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:ULOm3_A8WrAC", "authors": ["U Rajendra Acharya", "Hamido Fujita", "Muhammad Adam", "Oh Shu Lih", "Vidya K Sudarshan", "Tan Jen Hong", "Joel EW Koh", "Yuki Hagiwara", "Chua K Chua", "Chua Kok Poo", "Tan Ru San"], "publication_date": "2017/1/20", "journal": "Information Sciences", "description": "Cardiovascular diseases (CVDs) are the main cause of cardiac death worldwide. The Coronary Artery Disease (CAD) is one of the leading causes of these CVD deaths. CAD condition progresses rapidly, if not diagnosed and treated at an early stage may eventually lead to an irreversible state of heart muscle death called Myocardial Infarction (MI). Normally, the presence of these cardiac conditions is primarily reflected on the electrocardiogram (ECG) signal. However, it is challenging and requires rich experience to manually interpret the visual subtle changes occurring in the ECG waveforms. Thus, many automated diagnostic systems are developed to overcome these limitations. In this study, the performance of an automated diagnostic system developed for detection of CAD and MI using three methods such as Discrete Wavelet Transform (DWT), Empirical Mode Decomposition (EMD) and Discrete Cosine …", "total_citations": 213, "citation_graph": {"2017": 29, "2018": 22, "2019": 38, "2020": 39, "2021": 36, "2022": 26, "2023": 22}}, {"title": "Computer-aided diagnosis of depression using EEG signals", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:Tyk-4Ss8FVUC", "authors": ["U Rajendra Acharya", "Vidya K Sudarshan", "Hojjat Adeli", "Jayasree Santhosh", "Joel EW Koh", "Amir Adeli"], "publication_date": "2015/6/1", "journal": "European neurology", "description": "The complex, nonlinear and non-stationary electroencephalogram (EEG) signals are very tedious to interpret visually and highly difficult to extract the significant features from them. The linear and nonlinear methods are effective in identifying the changes in EEG signals for the detection of depression. Linear methods do not exhibit the complex dynamical variations in the EEG signals. Hence, chaos theory and nonlinear dynamic methods are widely used in extracting the EEG signal features for computer-aided diagnosis (CAD) of depression. Hence, this article presents the recent efforts on CAD of depression using EEG signals with a focus on using nonlinear methods. Such a CAD system is simple to use and may be used by the clinicians as a tool to confirm their diagnosis. It should be of a particular value to enable the early detection of depression.", "total_citations": 179, "citation_graph": {"2015": 6, "2016": 6, "2017": 17, "2018": 16, "2019": 22, "2020": 25, "2021": 27, "2022": 36, "2023": 24}}, {"title": "An integrated index for detection of sudden cardiac death using discrete wavelet transform and nonlinear features", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:qjMakFHDy7sC", "authors": ["U Rajendra Acharya", "Hamido Fujita", "Vidya K Sudarshan", "Vinitha S Sree", "Lim Wei Jie Eugene", "Dhanjoo N Ghista", "Ru San Tan"], "publication_date": "2015/7/1", "journal": "Knowledge-Based Systems", "description": "Early prediction of person at risk of Sudden Cardiac Death (SCD) with or without the onset of Ventricular Tachycardia (VT) or Ventricular Fibrillation (VF) still remains a continuing challenge to clinicians. In this work, we have presented a novel integrated index for prediction of SCD with a high level of accuracy by using electrocardiogram (ECG) signals. To achieve this, nonlinear features (Fractal Dimension (FD), Hurst’s exponent (H), Detrended Fluctuation Analysis (DFA), Approximate Entropy (ApproxEnt), Sample Entropy (SampEnt), and Correlation Dimension (CD)) are first extracted from the second level Discrete Wavelet Transform (DWT) decomposed ECG signal. The extracted nonlinear features are ranked using t-value and then, a combination of highly ranked features are used in the formulation and employment of an integrated Sudden Cardiac Death Index (SCDI). This calculated novel SCDI can be used to …", "total_citations": 133, "citation_graph": {"2015": 5, "2016": 19, "2017": 17, "2018": 14, "2019": 20, "2020": 12, "2021": 14, "2022": 16, "2023": 14}}, {"title": "Application of higher-order spectra for the characterization of coronary artery disease using electrocardiogram signals", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:KlAtU1dfN6UC", "authors": ["U Rajendra Acharya", "Vidya K Sudarshan", "Joel EW Koh", "Roshan Joy Martis", "Jen Hong Tan", "Shu Lih Oh", "Adam Muhammad", "Yuki Hagiwara", "Muthu Rama Krishanan Mookiah", "Kok Poo Chua", "Chua K Chua", "Ru San Tan"], "publication_date": "2017/1/1", "journal": "Biomedical Signal Processing and Control", "description": "Coronary Artery Disease (CAD) is the root cause for chain of catastrophic heart diseases such as Ischemic Heart Disease (IHD), Myocardial Infarction (MI) or Heart Attack (HA) and Heart Failure (HF). Early detection and treatment of this CAD condition is essential and may help in preventing it from progressing further. However, faster and accurate identification of CAD from Electrocardiogram (ECG) signals using manual interpretations is not an easy task to achieve. Thus, computer-aided techniques are necessary for the automated characterization of CAD condition. Therefore, this work proposes application of Higher-Order Statistics and Spectra (HOS) for an automated classification of normal and CAD conditions using ECG signals. In this paper, 182,013 beats (137,587 normal beats and 44,426 beats with CAD) ECG beats are used. HOS bispectrum and cumulant features are extracted from each ECG beat. The …", "total_citations": 126, "citation_graph": {"2017": 17, "2018": 12, "2019": 15, "2020": 24, "2021": 28, "2022": 19, "2023": 10}}, {"title": "Sudden cardiac death (SCD) prediction based on nonlinear heart rate variability features and SCD index", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:5nxA0vEk-isC", "authors": ["Hamido Fujita", "U Rajendra Acharya", "Vidya K Sudarshan", "Dhanjoo N Ghista", "S Vinitha Sree", "Lim Wei Jie Eugene", "Joel EW Koh"], "publication_date": "2016/6/1", "journal": "Applied Soft Computing", "description": "In our previous work, we have developed a sudden cardiac death index (SCDI) using electrocardiogram (ECG) signals that could effectively predict the occurrence of SCD four minutes before the onset. Thus, the prediction of SCD before its onset by using heart rate variability (HRV) signals is a worthwhile task for further investigation. Therefore, in this paper, a new novel methodology to automatically classify the HRV signals of normal and subjects at risk of SCD by using nonlinear techniques has been presented. In this study, we have predicted SCD by analyzing four-minutes of HRV signals (separately for each one-minute interval) prior to SCD occurrence by using nonlinear features such as Renyi entropy (REnt), fuzzy entropy (FE), Hjorth's parameters (activity, mobility and complexity), Tsallis entropy (TEnt), and energy features of discrete wavelet transform (DWT) coefficients. All the clinically significant features …", "total_citations": 120, "citation_graph": {"2016": 5, "2017": 14, "2018": 11, "2019": 26, "2020": 19, "2021": 17, "2022": 17, "2023": 11}}, {"title": "Computer-aided diagnosis of diabetic subjects by heart rate variability signals using discrete wavelet transform method", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:d1gkVwhDpl0C", "authors": ["U Rajendra Acharya", "K Sudarshan Vidya", "Dhanjoo N Ghista", "Wei Jie Eugene Lim", "Filippo Molinari", "Meena Sankaranarayanan"], "publication_date": "2015/6/1", "journal": "Knowledge-based systems", "description": "Diabetes Mellitus (DM), a chronic lifelong condition, is characterized by increased blood sugar levels. As there is no cure for DM, the major focus lies on controlling the disease. Therefore, DM diagnosis and treatment is of great importance. The most common complications of DM include retinopathy, neuropathy, nephropathy and cardiomyopathy. Diabetes causes cardiovascular autonomic neuropathy that affects the Heart Rate Variability (HRV). Hence, in the absence of other causes, the HRV analysis can be used to diagnose diabetes. The present work aims at developing an automated system for classification of normal and diabetes classes by using the heart rate (HR) information extracted from the Electrocardiogram (ECG) signals. The spectral analysis of HRV recognizes patients with autonomic diabetic neuropathy, and gives an earlier diagnosis of impairment of the Autonomic Nervous System (ANS …", "total_citations": 119, "citation_graph": {"2015": 4, "2016": 16, "2017": 19, "2018": 13, "2019": 16, "2020": 17, "2021": 11, "2022": 12, "2023": 10}}, {"title": "Automated detection of premature delivery using empirical mode and wavelet packet decomposition techniques with uterine electromyogram signals", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:mVmsd5A6BfQC", "authors": ["U Rajendra Acharya", "Vidya K Sudarshan", "Soon Qing Rong", "Zechariah Tan", "Choo Min Lim", "Joel EW Koh", "Sujatha Nayak", "Sulatha V Bhandary"], "publication_date": "2017/6/1", "journal": "Computers in biology and medicine", "description": "An accurate detection of preterm labor and the risk of preterm delivery before 37 weeks of gestational age is crucial to increase the chance of survival rate for both mother and the infant. Thus, the uterine contractions measured using uterine electromyogram (EMG) or electro hysterogram (EHG) need to have high sensitivity in the detection of true preterm labor signs. However, visual observation and manual interpretation of EHG signals at the time of emergency situation may lead to errors. Therefore, the employment of computer-based approaches can assist in fast and accurate detection during the emergency situation. This work proposes a novel algorithm using empirical mode decomposition (EMD) combined with wavelet packet decomposition (WPD), for automated prediction of pregnant women going to have premature delivery by using uterine EMG signals. The EMD is performed up to 11 levels on the normal …", "total_citations": 102, "citation_graph": {"2017": 7, "2018": 14, "2019": 15, "2020": 21, "2021": 16, "2022": 19, "2023": 10}}, {"title": "Automated characterization of fatty liver disease and cirrhosis using curvelet transform and entropy features extracted from ultrasound images", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:YOwf2qJgpHMC", "authors": ["U Rajendra Acharya", "U Raghavendra", "Hamido Fujita", "Yuki Hagiwara", "Joel EW Koh", "Tan Jen Hong", "Vidya K Sudarshan", "Anushya Vijayananthan", "Chai Hong Yeong", "Anjan Gudigar", "Kwan Hoong Ng"], "publication_date": "2016/12/1", "journal": "Computers in biology and medicine", "description": "Fatty liver disease (FLD) is reversible disease and can be treated, if it is identified at an early stage. However, if diagnosed at the later stage, it can progress to an advanced liver disease such as cirrhosis which may ultimately lead to death. Therefore, it is essential to detect it at an early stage before the disease progresses to an irreversible stage. Several non-invasive computer-aided techniques are proposed to assist in the early detection of FLD and cirrhosis using ultrasound images. In this work, we are proposing an algorithm to discriminate automatically the normal, FLD and cirrhosis ultrasound images using curvelet transform (CT) method. Higher order spectra (HOS) bispectrum, HOS phase, fuzzy, Kapoor, max, Renyi, Shannon, Vajda and Yager entropies are extracted from CT coefficients. These extracted features are subjected to locality sensitive discriminant analysis (LSDA) feature reduction method. Then …", "total_citations": 102, "citation_graph": {"2017": 11, "2018": 23, "2019": 20, "2020": 11, "2021": 15, "2022": 14, "2023": 8}}, {"title": "Ultrasound-based tissue characterization and classification of fatty liver disease: A screening and diagnostic paradigm", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:u-x6o8ySG0sC", "authors": ["U Rajendra Acharya", "Oliver Faust", "Filippo Molinari", "S Vinitha Sree", "Sameer P Junnarkar", "Vidya Sudarshan"], "publication_date": "2015/2/1", "journal": "Knowledge-Based Systems", "description": "Fatty Liver Disease (FLD) is a progressively prevalent disease that is present in about 15% of the world population. Normally benign and reversible if detected at an early stage, FLD, if left undetected and untreated, can progress to an irreversible advanced liver disease, such as fibrosis, cirrhosis, liver cancer and liver failure, which can cause death. Ultrasound (US) is the most widely used modality to detect FLD. However, the accuracy of US-based diagnosis depends on both the training and expertise of the radiologist. US-based Computer Aided Diagnosis (CAD) techniques for FLD detection can improve accuracy, speed and objectiveness of the diagnosis, and thereby, reduce operator dependability. In this paper, we first review the advantages and limitations of different diagnostic methods which are currently available to detect FLD. We then review the state-of-the-art US-based CAD techniques that utilize a range …", "total_citations": 100, "citation_graph": {"2015": 7, "2016": 17, "2017": 16, "2018": 15, "2019": 14, "2020": 8, "2021": 9, "2022": 7, "2023": 7}}, {"title": "Application of wavelet techniques for cancer diagnosis using ultrasound images: a review", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:roLk4NBRz8UC", "authors": ["Vidya K Sudarshan", "Muthu Rama Krishnan Mookiah", "U Rajendra Acharya", "Vinod Chandran", "Filippo Molinari", "Hamido Fujita", "Kwan Hoong Ng"], "publication_date": "2016/2/1", "description": "Ultrasound is an important and low cost imaging modality used to study the internal organs of human body and blood flow through blood vessels. It uses high frequency sound waves to acquire images of internal organs. It is used to screen normal, benign and malignant tissues of various organs. Healthy and malignant tissues generate different echoes for ultrasound. Hence, it provides useful information about the potential tumor tissues that can be analyzed for diagnostic purposes before therapeutic procedures. Ultrasound images are affected with speckle noise due to an air gap between the transducer probe and the body. The challenge is to design and develop robust image preprocessing, segmentation and feature extraction algorithms to locate the tumor region and to extract subtle information from isolated tumor region for diagnosis. This information can be revealed using a scale space technique such as the …", "total_citations": 96, "citation_graph": {"2016": 8, "2017": 13, "2018": 9, "2019": 16, "2020": 15, "2021": 11, "2022": 11, "2023": 11}}, {"title": "Automated characterization of coronary artery disease, myocardial infarction, and congestive heart failure using contourlet and shearlet transforms of electrocardiogram signal", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:L8Ckcad2t8MC", "authors": ["U Rajendra Acharya", "Hamido Fujita", "Vidya K Sudarshan", "Shu Lih Oh", "Muhammad Adam", "Jen Hong Tan", "Jie Hui Koo", "Arihant Jain", "Choo Min Lim", "Kuang Chua Chua"], "publication_date": "2017/9/15", "journal": "Knowledge-Based Systems", "description": "Undiagnosed coronary artery disease (CAD) progresses rapidly and leads to myocardial infarction (MI) by reducing the blood flow to the cardiac muscles. Timely diagnosis of MI and its location is significant, else, it expands and may impair the left ventricular (LV) function. Thus, if CAD and MI are not picked up by electrocardiogram (ECG) during diagnostic test, it can lead to congestive heart failure (CHF). Therefore, in this paper, the characterization of three cardiac abnormalities namely, CAD, MI and CHF are compared. Performance of novel algorithms is based on contourlet and shearlet transformations of the ECG signals. Continuous wavelet transform (CWT) is performed on normal, CAD, MI and CHF ECG beat to obtain scalograms. Subsequently, contourlet and shearlet transformations are applied on the scalograms to obtain the respective coefficients. Entropies, first and second order statistical features namely …", "total_citations": 85, "citation_graph": {"2017": 4, "2018": 11, "2019": 20, "2020": 22, "2021": 14, "2022": 6, "2023": 8}}, {"title": "Computer-aided diagnosis of myocardial infarction using ultrasound images with DWT, GLCM and HOS methods: a comparative study", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:IjCSPb-OGe4C", "authors": ["K Sudarshan Vidya", "EYK Ng", "U Rajendra Acharya", "Siaw Meng Chou", "Ru San Tan", "Dhanjoo N Ghista"], "publication_date": "2015/7/1", "journal": "Computers in biology and medicine", "description": "Myocardial Infarction (MI) or acute MI (AMI) is one of the leading causes of death worldwide. Precise and timely identification of MI and extent of muscle damage helps in early treatment and reduction in the time taken for further tests. MI diagnosis using 2D echocardiography is prone to inter-/intra-observer variability in the assessment. Therefore, a computerised scheme based on image processing and artificial intelligent techniques can reduce the workload of clinicians and improve the diagnosis accuracy. A Computer-Aided Diagnosis (CAD) of infarcted and normal ultrasound images will be useful for clinicians. In this study, the performance of CAD approach using Discrete Wavelet Transform (DWT), second order statistics calculated from Gray-Level Co-Occurrence Matrix (GLCM) and Higher-Order Spectra (HOS) texture descriptors are compared. The proposed system is validated using 400 MI and 400 normal …", "total_citations": 78, "citation_graph": {"2015": 1, "2016": 11, "2017": 8, "2018": 5, "2019": 13, "2020": 9, "2021": 15, "2022": 9, "2023": 6}}, {"title": "Application of empirical mode decomposition (EMD) for automated identification of congestive heart failure using heart rate signals", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:Zph67rFs4hoC", "authors": ["U Rajendra Acharya", "Hamido Fujita", "Vidya K Sudarshan", "Shu Lih Oh", "Adam Muhammad", "Joel EW Koh", "Jen Hong Tan", "Chua K Chua", "Kok Poo Chua", "Ru San Tan"], "publication_date": "2017/10", "journal": "Neural Computing and Applications", "description": "Electrocardiogram is widely used to diagnose the congestive heart failure (CHF). It is the primary noninvasive diagnostic tool that can guide in the management and follow-up of patients with CHF. Heart rate variability (HRV) signals which are nonlinear in nature possess the hidden signatures of various cardiac diseases. Therefore, this paper proposes a nonlinear methodology, empirical mode decomposition (EMD), for an automated identification and classification of normal and CHF using HRV signals. In this work, HRV signals are subjected to EMD to obtain intrinsic mode functions (IMFs). From these IMFs, thirteen nonlinear features such as approximate entropy , sample entropy , Tsallis entropy , fuzzy entropy , Kolmogorov Sinai entropy , modified multiscale entropy , permutation entropy , Renyi entropy , Shannon entropy , wavelet entropy , signal activity , Hjorth …", "total_citations": 74, "citation_graph": {"2017": 10, "2018": 7, "2019": 15, "2020": 15, "2021": 10, "2022": 7, "2023": 9}}, {"title": "Towards precision medicine: from quantitative imaging to radiomics", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:-f6ydRqryjwC", "authors": ["U Rajendra Acharya", "Yuki Hagiwara", "Vidya K Sudarshan", "Wai Yee Chan", "Kwan Hoong Ng"], "publication_date": "2018/1", "description": "Radiology (imaging) and imaging-guided interventions, which provide multi-parametric morphologic and functional information, are playing an increasingly significant role in precision medicine. Radiologists are trained to understand the imaging phenotypes, transcribe those observations (phenotypes) to correlate with underlying diseases and to characterize the images. However, in order to understand and characterize the molecular phenotype (to obtain genomic information) of solid heterogeneous tumours, the advanced sequencing of those tissues using biopsy is required. Thus, radiologists image the tissues from various views and angles in order to have the complete image phenotypes, thereby acquiring a huge amount of data. Deriving meaningful details from all these radiological data becomes challenging and raises the big data issues. Therefore, interest in the application of radiomics has been growing in …", "total_citations": 72, "citation_graph": {"2018": 8, "2019": 16, "2020": 12, "2021": 8, "2022": 15, "2023": 13}}, {"title": "Automated characterization of arrhythmias using nonlinear features from tachycardia ECG beats", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:aqlVkmm33-oC", "authors": ["U Rajendra Acharya", "Hamido Fujita", "Muhammad Adam", "Oh Shu Lih", "Tan Jen Hong", "Vidya K Sudarshan", "Joel EW Koh"], "publication_date": "2016/10/9", "conference": "2016 IEEE international conference on systems, man, and cybernetics (SMC)", "description": "Arrhythmias are abnormal heartbeat rhythms, categorized as either harmless or life-threatening. Commonly, elderly people are more vulnerable to life-threatening arrhythmias, namely Atrial Fibrillation (A-Fib), Atrial Flutter (AFL) and Ventricular Fibrillation (V-Fib). Electrocardiogram (ECG) is the primary diagnostic tool that can be used to detect and diagnose cardiac abnormalities including serious arrhythmias. Therefore, using ECG signal beats, we have proposed a computer-aided diagnosis (CAD) system for automated diagnosis of serious arrhythmias. The ECG beats are analyzed using thirteen nonlinear features namely, Shannon entropy, Fuzzy entropy, Tsallis entropy, approximate entropy, Permutation entropy, Modified Multi Scale entropy, Wavelet entropy, Sample entropy, Renyi entropy, Signal Energy, Fractal Dimension, Kolmogorov Sinai entropy and Largest Lyapunov Exponent. Subsequently, the …", "total_citations": 71, "citation_graph": {"2017": 3, "2018": 10, "2019": 10, "2020": 10, "2021": 16, "2022": 10, "2023": 12}}, {"title": "Future IoT tools for COVID‐19 contact tracing and prediction: a review of the state‐of‐the‐science", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:hMod-77fHWUC", "authors": ["Vicnesh Jahmunah", "Vidya K Sudarshan", "Shu Lih Oh", "Raj Gururajan", "Rashmi Gururajan", "Xujuan Zhou", "Xiaohui Tao", "Oliver Faust", "Edward J Ciaccio", "Kwan Hoong Ng", "U Rajendra Acharya"], "publication_date": "2021/6", "description": "In 2020 the world is facing unprecedented challenges due to COVID‐19. To address these challenges, many digital tools are being explored and developed to contain the spread of the disease. With the lack of availability of vaccines, there is an urgent need to avert resurgence of infections by putting some measures, such as contact tracing, in place. While digital tools, such as phone applications are advantageous, they also pose challenges and have limitations (eg, wireless coverage could be an issue in some cases). On the other hand, wearable devices, when coupled with the Internet of Things (IoT), are expected to influence lifestyle and healthcare directly, and they may be useful for health monitoring during the global pandemic and beyond. In this work, we conduct a literature review of contact tracing methods and applications. Based on the literature review, we found limitations in gathering health data, such …", "total_citations": 68, "citation_graph": {"2020": 1, "2021": 16, "2022": 27, "2023": 24}}, {"title": "Computer-aided diagnosis of alcoholism-related EEG signals", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:9yKSN-GCB0IC", "authors": ["U Rajendra Acharya", "Vidya S", "Shreya Bhat", "Hojjat Adeli", "Amir Adeli"], "publication_date": "2014/12/31", "journal": "Epilepsy & Behavior", "description": "Alcoholism is a severe disorder that affects the functionality of neurons in the central nervous system (CNS) and alters the behavior of the affected person. Electroencephalogram (EEG) signals can be used as a diagnostic tool in the evaluation of subjects with alcoholism. The neurophysiological interpretation of EEG signals in persons with alcoholism (PWA) is based on observation and interpretation of the frequency and power in their EEGs compared to EEG signals from persons without alcoholism. This paper presents a review of the known features of EEGs obtained from PWA and proposes that the impact of alcoholism on the brain can be determined by computer-aided analysis of EEGs through extracting the minute variations in the EEG signals that can differentiate the EEGs of PWA from those of nonaffected persons. The authors advance the idea of automated computer-aided diagnosis (CAD) of alcoholism by …", "total_citations": 67, "citation_graph": {"2015": 4, "2016": 5, "2017": 8, "2018": 10, "2019": 7, "2020": 9, "2021": 10, "2022": 10, "2023": 4}}, {"title": "Automated diagnosis of congestive heart failure using dual tree complex wavelet transform and statistical features extracted from 2 s of ECG signals", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:qxL8FJ1GzNcC", "authors": ["Vidya K Sudarshan", "U Rajendra Acharya", "Shu Lih Oh", "Muhammad Adam", "Jen Hong Tan", "Chua Kuang Chua", "Kok Poo Chua", "Ru San Tan"], "publication_date": "2017/4/1", "journal": "Computers in biology and medicine", "description": "Identification of alarming features in the electrocardiogram (ECG) signal is extremely significant for the prediction of congestive heart failure (CHF). ECG signal analysis carried out using computer-aided techniques can speed up the diagnosis process and aid in the proper management of CHF patients. Therefore, in this work, dual tree complex wavelets transform (DTCWT)-based methodology is proposed for an automated identification of ECG signals exhibiting CHF from normal. In the experiment, we have performed a DTCWT on ECG segments of 2 s duration up to six levels to obtain the coefficients. From these DTCWT coefficients, statistical features are extracted and ranked using Bhattacharyya, entropy, minimum redundancy maximum relevance (mRMR), receiver-operating characteristics (ROC), Wilcoxon, t-test and reliefF methods. Ranked features are subjected to k-nearest neighbor (KNN) and decision tree …", "total_citations": 64, "citation_graph": {"2017": 1, "2018": 6, "2019": 9, "2020": 11, "2021": 9, "2022": 15, "2023": 13}}, {"title": "An integrated index for identification of fatty liver disease using radon transform and discrete cosine transform features in ultrasound images", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:Se3iqnhoufwC", "authors": ["U Rajendra Acharya", "Hamido Fujita", "Vidya K Sudarshan", "Muthu Rama Krishnan Mookiah", "Joel EW Koh", "Jen Hong Tan", "Yuki Hagiwara", "Chua Kuang Chua", "Sameer Padmakumar Junnarkar", "Anushya Vijayananthan", "Kwan Hoong Ng"], "publication_date": "2016/9/1", "journal": "Information Fusion", "description": "Alcoholic and non-alcoholic fatty liver disease is one of the leading causes of chronic liver diseases and mortality in Western countries and Asia. Ultrasound image assessment is most commonly and widely used to identify the Non-Alcoholic Fatty Liver Disease (NAFLD). It is one of the faster and safer non-invasive methods of NAFLD diagnosis available in imaging modalities. The diagnosis of NAFLD using biopsies is expensive, invasive, and causes anxiety to the patients. The advent of advanced image processing and data mining techniques have helped to develop faster, efficient, objective, and accurate decision support system for fatty liver disease using ultrasound images. This paper proposes a novel feature extraction models based on Radon Transform (RT) and Discrete Cosine Transform (DCT). First, Radon Transform (RT) is performed on the ultrasound images for every 1 degree to capture the low …", "total_citations": 58, "citation_graph": {"2016": 7, "2017": 5, "2018": 13, "2019": 7, "2020": 11, "2021": 6, "2022": 4, "2023": 4}}, {"title": "Automated prediction of sudden cardiac death risk using Kolmogorov complexity and recurrence quantification analysis features extracted from HRV signals", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:_FxGoFyzp5QC", "authors": ["U Rajendra Acharya", "Hamido Fujita", "Vidya K Sudarshan", "Dhanjoo N Ghista", "Wei Jie Eugene Lim", "Joel EW Koh"], "publication_date": "2015/10/9", "conference": "2015 IEEE international conference on systems, man, and cybernetics", "description": "Sudden Cardiac Death (SCD) is an unexpected sudden death of a person followed by Ventricular Fibrillation (VF) or Ventricular Tachycardia (VT) which is usually diagnosed using Electrocardiogram (ECG). Prediction of developing SCD is important for expeditious treatment and thus reducing the mortality rate. In our previous paper, we have developed the Sudden Cardiac Death Index (SCDI) to predict the SCD four minutes prior to its onset using nonlinear features extracted from Discrete Wavelet Transform (DWT) coefficients using ECG signals. In this present paper, we are proposing an automated prediction of SCD using Recurrence Quantification Analysis (RQA) and Kolmogorov complexity parameters extracted from Heart Rate Variability (HRV) signals. The extracted features ranked using t-test are subjected to k-Nearest Neighbor (k-NN), Decision Tree (DT), Support Vector Machine (SVM) and Probabilistic …", "total_citations": 51, "citation_graph": {"2016": 5, "2017": 0, "2018": 9, "2019": 8, "2020": 6, "2021": 11, "2022": 6, "2023": 6}}, {"title": "Automated Identification of Infarcted Myocardium Tissue Characterisation Using Ultrasound Images: A Review", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:u5HHmVD_uO8C", "authors": ["Vidya Sudarshan", "U Acharya", "E Ng", "S Chou", "R Tan", "Dhangoo N Ghista"], "publication_date": "2014/4/24", "description": "Myocardial infarction (MI) or acute myocardial infarction commonly known as heart attack is one of the major causes of cardiac death worldwide. It occurs when the blood supply to the portion of the heart muscle is blocked or stopped causing death of heart muscle cells. Early detection of MI will help to prevent the infarct expansion leading to left ventricle (LV) remodeling and further damage to the cardiac muscles. Timely identification of MI and the extent of LV remodeling are crucial to reduce the time taken for further tests, and save the cost due to early treatment. Echocardiography images are widely used to assess the differential diagnosis of normal and infarcted myocardium. The reading of ultrasound images is subjective due to interobserver variability and may lead to inconclusive findings which may increase the anxiety for patients. Hence, a computer-aided diagnostic (CAD) technique which uses …", "total_citations": 48, "citation_graph": {"2015": 2, "2016": 9, "2017": 9, "2018": 4, "2019": 1, "2020": 5, "2021": 6, "2022": 9, "2023": 2}}, {"title": "Automated characterization of cardiovascular diseases using relative wavelet nonlinear features extracted from ECG signals", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:r0BpntZqJG4C", "authors": ["Muhammad Adam", "Shu Lih Oh", "Vidya K Sudarshan", "Joel EW Koh", "Yuki Hagiwara", "Jen Hong Tan", "Ru San Tan", "U Rajendra Acharya"], "publication_date": "2018/7/1", "journal": "Computer methods and programs in biomedicine", "description": "Cardiovascular diseases (CVDs) are the leading cause of deaths worldwide. The rising mortality rate can be reduced by early detection and treatment interventions. Clinically, electrocardiogram (ECG) signal provides useful information about the cardiac abnormalities and hence employed as a diagnostic modality for the detection of various CVDs. However, subtle changes in these time series indicate a particular disease. Therefore, it may be monotonous, time-consuming and stressful to inspect these ECG beats manually. In order to overcome this limitation of manual ECG signal analysis, this paper uses a novel discrete wavelet transform (DWT) method combined with nonlinear features for automated characterization of CVDs. ECG signals of normal, and dilated cardiomyopathy (DCM), hypertrophic cardiomyopathy (HCM) and myocardial infarction (MI) are subjected to five levels of DWT. Relative wavelet of four …", "total_citations": 47, "citation_graph": {"2018": 2, "2019": 5, "2020": 5, "2021": 11, "2022": 15, "2023": 9}}, {"title": "Computer aided diagnosis of coronary artery disease, myocardial infarction and carotid atherosclerosis using ultrasound images: a review", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:4TOpqqG69KYC", "authors": ["Oliver Faust", "U Rajendra Acharya", "Vidya K Sudarshan", "Ru San Tan", "Chai Hong Yeong", "Filippo Molinari", "Kwan Hoong Ng"], "publication_date": "2017/1/1", "description": "The diagnosis of Coronary Artery Disease (CAD), Myocardial Infarction (MI) and carotid atherosclerosis is of paramount importance, as these cardiovascular diseases may cause medical complications and large number of death. Ultrasound (US) is a widely used imaging modality, as it captures moving images and image features correlate well with results obtained from other imaging methods. Furthermore, US does not use ionizing radiation and it is economical when compared to other imaging modalities. However, reading US images takes time and the relationship between image and tissue composition is complex. Therefore, the diagnostic accuracy depends on both time taken to read the images and experience of the screening practitioner. Computer support tools can reduce the inter-operator variability with lower subject specific expertise, when appropriate processing methods are used. In the current review …", "total_citations": 45, "citation_graph": {"2017": 5, "2018": 7, "2019": 7, "2020": 7, "2021": 11, "2022": 5, "2023": 3}}, {"title": "Longitudinal changes in tear evaporation rates after eyelid warming therapies in meibomian gland dysfunction", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:3fE2CSJIrl8C", "authors": ["Sharon Yeo", "Jen Hong Tan", "U Rajendra Acharya", "Vidya K Sudarshan", "Louis Tong"], "publication_date": "2016/4/1", "journal": "Investigative ophthalmology & visual science", "description": "Purpose: Lid warming is the major treatment for meibomian gland dysfunction (MGD). The purpose of the study was to determine the longitudinal changes of tear evaporation after lid warming in patients with MGD.\nMethods: Ninety patients with MGD were enrolled from a dry eye clinic at Singapore National Eye Center in an interventional trial. Participants were treated with hot towel (n= 22), EyeGiene (n= 22), or Blephasteam (n= 22) twice daily or a single 12-minute session of Lipiflow (n= 24). Ocular surface infrared thermography was performed at baseline and 4 and 12 weeks after the treatment, and image features were extracted from the captured images.\nResults: The baseline of conjunctival tear evaporation (TE) rate (n= 90) was 66.1±21.1 W/min. The rates were not significantly different between sexes, ages, symptom severities, tear breakup times, Schirmer test, corneal fluorescein staining, or treatment groups. Using a general linear model (repeat measures), the conjunctival TE rate was reduced with time after treatment. A higher baseline evaporation rate (≥ 66 W/min) was associated with greater reduction of evaporation rate after treatment. Seven of 10 thermography features at baseline were predictive of reduction in irritative symptoms after treatment.\nConclusions: Conjunctival TE rates can be effectively reduced by lid warming treatment in some MGD patients. Individual baseline thermography image features can be predictive of the response to lid warming therapy. For patients that do not have excessive TE, additional therapy, for example, anti-inflammatory therapy, may be required.(ClinicalTrials. gov number, NCT01683318 and …", "total_citations": 44, "citation_graph": {"2016": 2, "2017": 5, "2018": 7, "2019": 4, "2020": 6, "2021": 4, "2022": 10, "2023": 6}}, {"title": "Performance evaluation of Emergency Department patient arrivals forecasting models by including meteorological and calendar information: A comparative study", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:YFjsv_pBGBYC", "authors": ["Vidya K Sudarshan", "Mikkel Brabrand", "Troels Martin Range", "Uffe Kock Wiil"], "publication_date": "2021/8/1", "journal": "Computers in Biology and Medicine", "description": "The volume of daily patient arrivals at Emergency Departments (EDs) is unpredictable and is a significant reason of ED crowding in hospitals worldwide. Timely forecast of patients arriving at ED can help the hospital management in early planning and avoiding of overcrowding. Many different ED patient arrivals forecasting models have previously been proposed by using time series analysis methods. Even though the time series methods such as Linear and Logistic Regression, Autoregressive Integrated Moving Average (ARIMA), Seasonal ARIMA (SARIMA), Exponential Smoothing (ES), and Artificial Neural Network (ANN) have been explored extensively for the ED forecasting model development, the few significant limitations of these methods associated in the analysis of time series data make the models inadequate in many practical situations. Therefore, in this paper, Machine Learning (ML)-based Random …", "total_citations": 40, "citation_graph": {"2021": 2, "2022": 13, "2023": 24}}, {"title": "Automated diagnosis of dry eye using infrared thermography images", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:zYLM7Y9cAGgC", "authors": ["U Rajendra Acharya", "Jen Hong Tan", "Joel EW Koh", "Vidya K Sudarshan", "Sharon Yeo", "Cheah Loon Too", "Chua Kuang Chua", "EYK Ng", "Louis Tong"], "publication_date": "2015/7/1", "journal": "Infrared Physics & Technology", "description": "Dry Eye (DE) is a condition of either decreased tear production or increased tear film evaporation. Prolonged DE damages the cornea causing the corneal scarring, thinning and perforation. There is no single uniform diagnosis test available to date; combinations of diagnostic tests are to be performed to diagnose DE. The current diagnostic methods available are subjective, uncomfortable and invasive. Hence in this paper, we have developed an efficient, fast and non-invasive technique for the automated identification of normal and DE classes using infrared thermography images. The features are extracted from nonlinear method called Higher Order Spectra (HOS). Features are ranked using t-test ranking strategy. These ranked features are fed to various classifiers namely, K-Nearest Neighbor (KNN), Nave Bayesian Classifier (NBC), Decision Tree (DT), Probabilistic Neural Network (PNN), and Support Vector …", "total_citations": 36, "citation_graph": {"2015": 1, "2016": 3, "2017": 5, "2018": 4, "2019": 2, "2020": 7, "2021": 6, "2022": 5, "2023": 3}}, {"title": "Data mining framework for breast lesion classification in shear wave ultrasound: a hybrid feature paradigm", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:_kc_bZDykSQC", "authors": ["U Rajendra Acharya", "Wei Lin Ng", "Kartini Rahmat", "Vidya K Sudarshan", "Joel EW Koh", "Jen Hong Tan", "Yuki Hagiwara", "Chai Hong Yeong", "Kwan Hoong Ng"], "publication_date": "2017/3/1", "journal": "Biomedical Signal Processing and Control", "description": "Assessment of elasticity parameters of breast using ultrasound elastography (USE) provides exclusive information about the cancerous tissue. Shear wave elastography (SWE), a new USE imaging procedure is increasingly used for elasticity evaluation of breast lesions. SWE examination is gaining popularity in the characterization of benign and malignant breast lesions as it has high diagnostic performance accuracy. However, some degree of manual errors, such as probe compression or movement may cause inaccurate results. In addition, the systems cannot measure elasticity values in small lesions where the tissues do not vibrate enough. Thus, computer-aided methods suppress these technical or manual limitations of SWE during evaluation of breast lesions. Therefore, this paper proposes, a novel methodology for characterization of benign and malignant breast lesions using SWE. Original SWE image is …", "total_citations": 27, "citation_graph": {"2017": 4, "2018": 5, "2019": 2, "2020": 7, "2021": 2, "2022": 5, "2023": 2}}, {"title": "Diagnosis of response and non-response to dry eye treatment using infrared thermography images", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:2osOgNQ5qMEC", "authors": ["U Rajendra Acharya", "Jen Hong Tan", "S Vidya", "Sharon Yeo", "Cheah Loon Too", "Wei Jie Eugene Lim", "Kuang Chua Chua", "Louis Tong"], "publication_date": "2014/11/1", "journal": "Infrared Physics & Technology", "description": "The dry eye treatment outcome depends on the assessment of clinical relevance of the treatment effect. The potential approach to assess the clinical relevance of the treatment is to identify the symptoms responders and non-responders to the given treatments using the responder analysis. In our work, we have performed the responder analysis to assess the clinical relevance effect of the dry eye treatments namely, hot towel, EyeGiene®, and Blephasteam® twice daily and 12 min session of Lipiflow®. Thermography is performed at week 0 (baseline), at weeks 4 and 12 after treatment. The clinical parameters such as, change in the clinical irritations scores, tear break up time (TBUT), corneal staining and Schirmer’s symptoms tests values are used to obtain the responders and non-responders groups. We have obtained the infrared thermography images of dry eye symptoms responders and non-responders to the …", "total_citations": 27, "citation_graph": {"2015": 4, "2016": 1, "2017": 5, "2018": 2, "2019": 3, "2020": 3, "2021": 3, "2022": 3, "2023": 3}}, {"title": "Data mining framework for identification of myocardial infarction stages in ultrasound: A hybrid feature extraction paradigm (PART 2)", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:MXK_kJrjxJIC", "authors": ["Vidya K Sudarshan", "U Rajendra Acharya", "EYK Ng", "Ru San Tan", "Siaw Meng Chou", "Dhanjoo N Ghista"], "publication_date": "2016/4/1", "journal": "Computers in biology and medicine", "description": "Early expansion of infarcted zone after Acute Myocardial Infarction (AMI) has serious short and long-term consequences and contributes to increased mortality. Thus, identification of moderate and severe phases of AMI before leading to other catastrophic post-MI medical condition is most important for aggressive treatment and management. Advanced image processing techniques together with robust classifier using two-dimensional (2D) echocardiograms may aid for automated classification of the extent of infarcted myocardium. Therefore, this paper proposes novel algorithms namely Curvelet Transform (CT) and Local Configuration Pattern (LCP) for an automated detection of normal, moderately infarcted and severely infarcted myocardium using 2D echocardiograms. The methodology extracts the LCP features from CT coefficients of echocardiograms. The obtained features are subjected to Marginal Fisher …", "total_citations": 24, "citation_graph": {"2016": 3, "2017": 6, "2018": 2, "2019": 3, "2020": 5, "2021": 4, "2022": 1}}, {"title": "Automated interpretation of biopsy images for the detection of celiac disease using a machine learning approach", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:NMxIlDl6LWMC", "authors": ["Joel En Wei Koh", "Simona De Michele", "Vidya K Sudarshan", "V Jahmunah", "Edward J Ciaccio", "Chui Ping Ooi", "Raj Gururajan", "Rashmi Gururajan", "Shu Lih Oh", "Suzanne K Lewis", "Peter H Green", "Govind Bhagat", "U Rajendra Acharya"], "publication_date": "2021/5/1", "journal": "Computer Methods and Programs in Biomedicine", "description": "Background and objectives\nCeliac disease is an autoimmune disease occurring in about 1 in 100 people worldwide. Early diagnosis and efficient treatment are crucial in mitigating the complications that are associated with untreated celiac disease, such as intestinal lymphoma and malignancy, and the subsequent high morbidity. The current diagnostic methods using small intestinal biopsy histopathology, endoscopy, and video capsule endoscopy (VCE) involve manual interpretation of photomicrographs or images, which can be time-consuming and difficult, with inter-observer variability. In this paper, a machine learning technique was developed for the automation of biopsy image analysis to detect and classify villous atrophy based on modified Marsh scores. This is one of the first studies to employ conventional machine learning to automate the use of biopsy images for celiac disease detection and classification …", "total_citations": 18, "citation_graph": {"2021": 1, "2022": 9, "2023": 8}}, {"title": "A multicenter prospective randomized study comparing the efficacy of escalating higher biphasic versus low biphasic energy defibrillations in patients presenting with cardiac …", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:M3ejUd6NZC8C", "authors": ["Venkataraman Anantharaman", "Seow Yian Tay", "Peter George Manning", "Swee Han Lim", "Terrance Siang Jin Chua", "Mohan Tiru", "Rabind Antony Charles", "Vidya Sudarshan"], "publication_date": "2017/1/1", "journal": "Open Access Emergency Medicine", "description": "Background\nBiphasic defibrillation has been practiced worldwide for >15 years. Yet, consensus does not exist on the best energy levels for optimal outcomes when used in patients with ventricular fibrillation (VF)/pulseless ventricular tachycardia (VT).\nMethods\nThis prospective, randomized, controlled trial of 235 adult cardiac arrest patients with VF/VT was conducted in the emergency and cardiology departments. One group received low-energy (LE) shocks at 150–150–150 J and the other escalating higher-energy (HE) shocks at 200–300–360 J. If return of spontaneous circulation (ROSC) was not achieved by the third shock, LE patients crossed over to the HE arm and HE patients continued at 360 J. Primary end point was ROSC. Secondary end points were 24-hour, 7-day, and 30-day survival.\nResults\nBoth groups were comparable for age, sex, cardiac risk factors, and duration of collapse and VF/VT. Of the 118 …", "total_citations": 17, "citation_graph": {"2017": 1, "2018": 0, "2019": 4, "2020": 2, "2021": 6, "2022": 4}}, {"title": "An integrated index for automated detection of infarcted myocardium from cross-sectional echocardiograms using texton-based features (Part 1)", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:0EnyYjriUFMC", "authors": ["Vidya K Sudarshan", "U Rajendra Acharya", "EYK Ng", "Ru San Tan", "Siaw Meng Chou", "Dhanjoo N Ghista"], "publication_date": "2016/4/1", "journal": "Computers in biology and medicine", "description": "Cross-sectional view echocardiography is an efficient non-invasive diagnostic tool for characterizing Myocardial Infarction (MI) and stages of expansion leading to heart failure. An automated computer-aided technique of cross-sectional echocardiography feature assessment can aid clinicians in early and more reliable detection of MI patients before subsequent catastrophic post-MI medical conditions. Therefore, this paper proposes a novel Myocardial Infarction Index (MII) to discriminate infarcted and normal myocardium using features extracted from apical cross-sectional views of echocardiograms. The cross-sectional view of normal and MI echocardiography images are represented as textons using Maximum Responses (MR8) filter banks. Fractal Dimension (FD), Higher-Order Statistics (HOS), Hu’s moments, Gabor Transform features, Fuzzy Entropy (FEnt), Energy, Local binary Pattern (LBP), Renyi’s Entropy …", "total_citations": 17, "citation_graph": {"2016": 1, "2017": 5, "2018": 3, "2019": 0, "2020": 3, "2021": 3, "2022": 1, "2023": 1}}, {"title": "Shockable versus nonshockable life-threatening ventricular arrhythmias using dwt and nonlinear features of ECG signals", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:mB3voiENLucC", "authors": ["SHU LIH OH", "Yuki Hagiwara", "Muhammad Adam", "Vidya K Sudarshan", "Joel Ew Koh", "JEN HONG TAN", "Chua K Chua", "RU SAN TAN", "Eddie YK Ng"], "publication_date": "2017/11/5", "journal": "Journal of Mechanics in Medicine and Biology", "description": "Shockable ventricular arrhythmias (VAs) such as ventricular tachycardia (VT) and ventricular fibrillation (VFib) are the life-threatening conditions requiring immediate attention. Cardiopulmonary resuscitation (CPR) and defibrillation are the significant immediate recommended treatments for these shockable arrhythmias to obtain the return of spontaneous circulation. However, accurate classification of these shockable VAs from nonshockable ones is the key step during defibrillation by automated external defibrillator (AED). Therefore, in this work, we have proposed a novel algorithm for an automated differentiation of shockable and nonshockable VAs from electrocardiogram (ECG) signal. The ECG signals are segmented into 5, 8 and 10s. These segmented ECGs are subjected to four levels of discrete wavelet transformation (DWT). Various nonlinear features such as approximate entropy (, signal energy (), Fuzzy entropy (), Kolmogorov Sinai entropy (, permutation entropy (), Renyi entropy ( …", "total_citations": 15, "citation_graph": {"2018": 1, "2019": 1, "2020": 4, "2021": 4, "2022": 3, "2023": 2}}, {"title": "Automated identification of coronary artery disease from short-term 12 lead electrocardiogram signals by using wavelet packet decomposition and common spatial pattern techniques", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:TQgYirikUcIC", "authors": ["SHU LIH OH", "Muhammad Adam", "JEN HONG TAN", "YUKI HAGIWARA", "Vidya K Sudarshan", "JOEL EN WEI KOH", "Kuang Chua Chua", "KOK POO CHUA", "RU SAN TAN", "Eddie YK Ng"], "publication_date": "2017/11/13", "journal": "Journal of Mechanics in Medicine and Biology", "description": "The occlusion of the coronary arteries commonly known as coronary artery disease (CAD) restricts the normal blood circulation required to the heart muscles, thus results in an irreversible myocardial damage or death (myocardial infarction). Clinically, electrocardiogram (ECG) is performed as a primary diagnostic tool to capture these cardiac activities and detect the presence of CAD. However, the use of computer-aided techniques can reduce the visual burden and manual time required for the analysis of complex ECG signals in order to identify the CAD affected subjects from normal ones. Therefore, in this study, a novel computer-aided technique is proposed using 2s of 12 lead ECG signals for the identification of CAD affected patients. Each of the 2s 12 lead ECG signal beats (3791 normal and 12308 CAD ECG signal beats) are implemented with four levels of wavelet packet decomposition (WPD) to obtain various …", "total_citations": 13, "citation_graph": {"2018": 2, "2019": 2, "2020": 2, "2021": 3, "2022": 3, "2023": 1}}, {"title": "Characterization of cardiovascular diseases using wavelet packet decomposition and nonlinear measures of electrocardiogram signal", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:dhFuZR0502QC", "authors": ["Hamido Fujita", "Vidya K Sudarshan", "Muhammad Adam", "Shu Lih Oh", "Jen Hong Tan", "Yuki Hagiwara", "Kuang Chua Chua", "Kok Poo Chua", "U Rajendra Acharya"], "publication_date": "2017", "conference": "Advances in Artificial Intelligence: From Theory to Practice: 30th International Conference on Industrial Engineering and Other Applications of Applied Intelligent Systems, IEA/AIE 2017, Arras, France, June 27-30, 2017, Proceedings, Part I 30", "description": "Cardiovascular diseases (CVDs) remain as the primary causes of disability and mortality worldwide and are predicted to continue rise in the future due to inadequate preventive actions. Electrocardiogram (ECG) signal contains vital clinical information that assists significantly in the diagnosis of CVDs. Assessment of subtle ECG parameters that indicate the presence of CVDs are extremely difficult and requires long hours of manual examination for accurate diagnosis. Hence, automated computer-aided diagnosis systems might help in overcoming these limitations. In this study, a novel algorithm is proposed based on the combination of wavelet packet decomposition (WPD) and nonlinear features. The proposed method achieved classification results of 97.98% accuracy, 99.61% sensitivity and 94.84% specificity with 8 reliefF ranked features. The proposed methodology is highly efficient in helping clinical …", "total_citations": 13, "citation_graph": {"2017": 3, "2018": 2, "2019": 3, "2020": 1, "2021": 1, "2022": 3}}, {"title": "Shear wave elastography for characterization of breast lesions: Shearlet transform and local binary pattern histogram techniques", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:hFOr9nPyWt4C", "authors": ["U Rajendra Acharya", "Wei Lin Ng", "Kartini Rahmat", "Vidya K Sudarshan", "Joel EW Koh", "Jen Hong Tan", "Yuki Hagiwara", "Arkadiusz Gertych", "Farhana Fadzli", "Chai Hong Yeong", "Kwan Hoong Ng"], "publication_date": "2017/12/1", "journal": "Computers in biology and medicine", "description": "Shear wave elastography (SWE) examination using ultrasound elastography (USE) is a popular imaging procedure for obtaining elasticity information of breast lesions. Elasticity parameters obtained through SWE can be used as biomarkers that can distinguish malignant breast lesions from benign ones. Furthermore, the elasticity parameters extracted from SWE can speed up the diagnosis and possibly reduce human errors. In this paper, Shearlet transform and local binary pattern histograms (LBPH) are proposed as an original algorithm to differentiate malignant and benign breast lesions. First, Shearlet transform is applied on the SWE images to acquire low frequency, horizontal and vertical cone coefficients. Next, LBPH features are extracted from the Shearlet transform coefficients and subjected to dimensionality reduction using locality sensitivity discriminating analysis (LSDA). The reduced LSDA components …", "total_citations": 12, "citation_graph": {"2018": 1, "2019": 4, "2020": 5, "2021": 1, "2022": 1}}, {"title": "Data overloading in medical imaging: Emerging issues, challenges and opportunities in efficient data management", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:YsMSGLbcyi4C", "authors": ["KH Ng", "Oliver Faust", "Vidya Sudarshan", "Subhagata Chattopadhyay"], "publication_date": "2015/8/1", "description": "Imaging techniques have gained tremendous popularity and pace in current trend of medical diagnostics. The key reason lies in the fact that such techniques extract clinical information with higher speed and accuracy compared to manual diagnosis by doctors. Moreover, the images serve as important records/evidences of diseases, hence the images are stored for the future use. However, among these advantages, there are growing issues with wide spread applications of imaging techniques. To be specific these issues are data (i) overloading, (ii) security/privacy, (iii) storage, (iv) transfer (especially, across institutes, regions, countries). In this paper we review the individual sources of medical image data. Based on this review, we discuss enabling technologies and present Computer-Aided Diagnosis (CAD) as well as data mining as coping strategies for the overwhelming amount of digital image data encountered …", "total_citations": 11, "citation_graph": {"2016": 2, "2017": 2, "2018": 2, "2019": 1, "2020": 3, "2021": 0, "2022": 1}}, {"title": "Automated diagnosis of diabetes using entropies and diabetic index", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:8k81kl-MbHgC", "authors": ["U Rajendra Acharya", "Hamido Fujita", "Shreya Bhat", "Joel Ew Koh", "Muhammad Adam", "Dhanjoo N Ghista", "Vidya K Sudarshan", "KOK POO CHUA", "KUANG CHUA CHUA", "Filippo Molinari", "EYK Ng", "RU SAN TAN"], "publication_date": "2016/2/29", "journal": "Journal of Mechanics in Medicine and Biology", "description": "Diabetes Mellitus (DM) is a chronic metabolic disorder that hampers the body’s energy absorption capacity from the food. It is either caused by pancreatic malfunctioning or the body cells being inactive to insulin production. Prolonged diabetes results in severe complications, such as retinopathy, neuropathy, cardiomyopathy and cardiovascular diseases. DM is an incurable disorder. Thus, diagnosis and monitoring of diabetes is essential to prevent the body organs from severe damage. Heart Rate Variability (HRV) signal processing can be used as one of the methods for the diagnosis of DM. Our paper introduces a noninvasive technique of automated diabetic diagnosis using HRV signals. The R-R interval signals are decomposed using Shearlet transforms integrated with Continuous Wavelet Transform (CWT), and their characteristic features are extracted by using Shannon’s, Renyi’s, Kapur entropies, energy and …", "total_citations": 6, "citation_graph": {"2017": 2, "2018": 2, "2019": 0, "2020": 1, "2021": 1}}, {"title": "Infarcted left ventricle classification from cross-sectional echocardiograms using relative wavelet energy and entropy features", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:hqOjcs7Dif8C", "authors": ["Vidya K Sudarshan", "EYK Ng", "U Rajendra Acharya", "Ru San Tan", "Siaw Meng Chou", "Dhanjoo N Ghista"], "publication_date": "2016/2/23", "journal": "Journal of Mechanics in Medicine and Biology", "description": "Parasternal and apical echocardiography images captured from different cross-sectional planes (short-axis and four chambers) convey significant information about the structure and function of infarcted Left Ventricular (LV) myocardium. Thus, features from these cross-sectional views of echocardiograms extracted using computer-aided techniques may aid in characterizing Myocardial Infarction (MI). Therefore, this paper proposes a new algorithm for automated MI characterization using features extracted from parasternal short axis and apical four chambers cross-sectional views of 160 subjects (80 with MI and 80 normal) echocardiograms. The Stationary Wavelet Transform (SWT) method is used to extract the Relative Wavelet Energy and Entropy (RWE and RWEnt) features from the two cross-sectional views of echocardiography images separately. These features are ranked and subjected to classification in two …", "total_citations": 6, "citation_graph": {"2016": 1, "2017": 2, "2018": 1, "2019": 1, "2020": 1}}, {"title": "Performance evaluation of dry eye detection system using higher-order spectra features for different noise levels in IR thermal images", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:_Qo2XoVZTnwC", "authors": ["Vidya K Sudarshan", "Joel EW Koh", "Jen Hong Tan", "Yuki Hagiwara", "Kuang Chua Chua", "Eddie YK Ng", "Louis Tong"], "publication_date": "2017/11/17", "journal": "Journal of Mechanics in Medicine and Biology", "description": "The enhanced tear film evaporation and diminished tear production causes a dry eye (DE) condition. A non-invasive infrared (IR) thermography is most commonly used as a diagnostic tool for diagnosis of DE. However, the availability of high-quality IR thermal camera at low cost is difficult. Hence, an efficient DE detection system which can perform efficiently by using low-cost and low-quality images instead of conventional IR images would be a significant contribution. Therefore, in this work, we have evaluated the performance of automated non-invasive DE detection system using low-quality images obtained by adding different levels of noise to high-quality IR images. In this work, the performances of two non-linear higher-order spectra (HOS) cumulants and bispectrum features are compared. These features are extracted from the IR images with different levels of Gaussian noise. Principal component analysis (PCA …", "total_citations": 5, "citation_graph": {"2020": 2, "2021": 0, "2022": 1, "2023": 2}}, {"title": "Evaluation of evaporative dry eye disease using thermal images of ocular surface regions with DWT and gabor transform", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:4DMP91E08xMC", "authors": ["Vidya K Sudarshan", "Joel EW Koh", "U Rajendra Acharya", "Jen Hong Tan", "Muthu Rama Krishnan Mookiah", "Chua Kuang Chua", "Louis Tong"], "publication_date": "2017", "journal": "Application of infrared to biomedical sciences", "description": "Tear filmEvaporative Dry Eye DiseaseinstabilityGabor Transform is a major cause of dry eye (DE) Dry Eye (DE)diseaseDisease. TheOcular surface region’s lack of stability of the tear film may be associated with optical aberrations, visual disturbances, and ocular surface damage. It is clinically important to detect tear instability in DE as the treatment may involve specific measures such as chronic eyelid warming therapyChronic eyelid warming therapy. To achieve this, a practical and rapid method to analyze the relevant features from different regionsRegions of the ocular surfaceOcular surface in DE will be useful. Thus, in this chapter, efficiency of using the upper half and lower half regions of the ocular surface (cornea + conjunctiva) in the detection of evaporative dry eyeEvaporative Dry Eye Disease is assessed using infrared thermography images. Here, we define the ocular surface as the exposed area of the …", "total_citations": 5, "citation_graph": {"2018": 1, "2019": 0, "2020": 1, "2021": 0, "2022": 2, "2023": 1}}, {"title": "Electroencephalograms analysis and classification of neurological and psychological disorders", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:ufrVoPGSRksC", "authors": ["Prajna Upadhyaya", "G Muralidhar Bairy", "Vidya K Sudarshan"], "publication_date": "2015/12/1", "description": "Neurological and Psychological disorders are affecting large number of people worldwide disturbing their personality, behavior and day to day routine. Neurological disorders occur due to abnormalities in the central and the peripheral nervous system whereas damage or improper functioning of the brain causes psychological disorders. Early and non-invasive detection of these disorders can be achieved using electroencephalograms (EEG). The visual interpretation of information present in the EEG signals are subjective and prone to inter and intra observer variability. Hence in order to avoid variable predictions Computer-aided diagnostic tools can be used for analysis and interpretation of EEG signals. These CAD tools contain following techniques to generate the desired results: signal (data) acquisition, feature extraction and classification. This survey paper focuses the discussion on various CAD techniques …", "total_citations": 5, "citation_graph": {"2016": 1, "2017": 1, "2018": 0, "2019": 1, "2020": 1, "2021": 0, "2022": 0, "2023": 1}}, {"title": "Application of entropies for automated diagnosis of abnormalities in ultrasound images: A review", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:HDshCWvjkbEC", "authors": ["Yuki Hagiwara", "Vidya K Sudarshan", "Sook Sam Leong", "Anushya Vijaynanthan", "Kwan Hoong Ng"], "publication_date": "2017/11/13", "description": "Automation of diagnosis process in medical imaging using various computer-aided techniques is a leading topic of research. Among many computer-aided methods, nonlinear entropies are widely applied in the development of automated algorithms to diagnose abnormalities present in medical images. The use of entropy features in development of Computer-Aided Diagnosis (CAD) may enhance the accuracy of the system. Entropy features depict the nonlinearity of images and thereby the presence of complexity in the images. Various types of entropies have been employed in medical image analysis for automated diagnosis of abnormalities present in the images. This paper focuses on the diverse types of entropies employed in the development of CAD systems for the diagnosis of abnormalities in the medical images. In addition to the diagnosis, these entropies can be used to differentiate the images based on …", "total_citations": 4, "citation_graph": {"2018": 1, "2019": 1, "2020": 0, "2021": 0, "2022": 2}}, {"title": "Endoscopy, video capsule endoscopy, and biopsy for automated celiac disease detection: A review", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:J_g5lzvAfSwC", "authors": ["V Jahmunah", "Joel En Wei Koh", "Vidya K Sudarshan", "U Raghavendra", "Anjan Gudigar", "Shu Lih Oh", "Hui Wen Loh", "Oliver Faust", "Prabal Datta Barua", "Edward J Ciaccio", "U Rajendra Acharya"], "publication_date": "2022/12/16", "description": "Celiac Disease (CD) is a common ailment that affects approximately 1% of the world population. Automated CD detection can help experts during the diagnosis of this condition at an early stage and bring significant benefits to both patients and healthcare providers. For this purpose, scientists have created automatic and semi-automatic CD diagnostic support systems. In this study, we performed information extraction methods that were found useful for efforts to differentiate CD versus non-CD. To focus the review process, only methods for endoscopy, video capsule endoscopy (VCE) and biopsy image analyses were considered. As described herein, we have learned that statistical and non-linear methods are most important for information extraction. These information extraction tools might benefit clinical workflows by reducing intra- and inter-observer variability. However, bias, introduced by resolving design …", "total_citations": 3, "citation_graph": {"2023": 3}}, {"title": "Alcoholic index using non-linear features Extracted from different frequency bands", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:e5wmG9Sq2KIC", "authors": ["G Muralidhar Bairy", "UC Niranjan", "Shu Lih Oh", "Joel EW Koh", "Vidya K Sudarshan", "Jen Hong Tan", "Yuki Hagiwara", "Eddie YK Ng"], "publication_date": "2017/11/13", "journal": "Journal of Mechanics in Medicine and Biology", "description": "Alcoholism is a complex condition that mainly disturbs the neuronal networks in Central Nervous System (CNS). This disorder not only disturbs the brain, but also affects the behavior, emotions, and cognitive judgements. Electroencephalography (EEG) is a valuable tool to examine the neuropsychiatric disorders like alcoholism. The EEG is a well-established modality to diagnose the electrical activity produced by the populations of neurons in cerebral cortex. However, EEG signals are non-linear in nature; hence very challenging to interpret the valuable information from them using linear methods. Thus, using non-linear methods to analyze EEG signals can be beneficial in order to predict the brain signals condition. This paper presents a computer-aided diagnostic method for the detection of alcoholic EEG signals from normal by employing the non-linear techniques. First, the EEG signals are subjected to six levels of Wavelet Packet Decomposition (WPD) to obtain seven wavebands (delta (), theta (), lower …", "total_citations": 3, "citation_graph": {"2020": 1, "2021": 0, "2022": 0, "2023": 2}}, {"title": "Functional interactions between complex I and complex II with nNOS in regulating cardiac mitochondrial activity in sham and hypertensive rat hearts", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:JV2RwH3_ST0C", "authors": ["Yu Na Wu", "Vidya K Sudarshan", "Shi Chao Zhu", "Yong Feng Shao", "Sung Joon Kim", "Yin Hua Zhang"], "publication_date": "2020/12", "journal": "Pflügers Archiv-European Journal of Physiology", "description": "Nitric oxide (NO) affects mitochondrial activity through its interactions with complexes. Here, we investigated regulations of complex I (C-I) and complex II (C-II) by neuronal NO synthase (nNOS) in the presence of fatty acid supplementation and the impact on left ventricular (LV) mitochondrial activity from sham and angiotensin II (Ang-II)–induced hypertensive (HTN) rats. Our results showed that nNOS protein was expressed in sham and HTN LV mitochondrial enriched fraction. In sham, oxygen consumption rate (OCR) and intracellular ATP were increased by palmitic acid (PA) or palmitoyl-carnitine (PC). nNOS inhibitor, S-methyl-l-thiocitrulline (SMTC), did not affect OCR or cellular ATP increment by PA or PC. However, SMTC increased OCR with PA + malonate (a C-II inhibitor), but not with PA + rotenone (a C-I inhibitor), indicating that nNOS attenuates C-I with fatty acid supplementation. Indeed, SMTC increased C-I …", "total_citations": 2, "citation_graph": {"2022": 2}}, {"title": "Assessment of CT for the categorization of hemorrhagic stroke (HS) and cerebral amyloid angiopathy hemorrhage (CAAH): A review", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:vV6vV6tmYwMC", "authors": ["Vidya K Sudarshan", "U Raghavendra", "Anjan Gudigar", "Edward J Ciaccio", "Anushya Vijayananthan", "Ramesh Sahathevan", "U Rajendra Acharya"], "publication_date": "2022/7/1", "description": "The management of intracerebral hemorrhage (ICH) requires prompt diagnostic assessment and recognition. Accurate localization and categorization of ICH-type is crucial. There are two main categories of ICH: 1) hemorrhagic stroke (HS), which occurs in the deeper or subcortical regions of the brain, where the arterial network tapers to fine end-arteries, and, 2) cerebral amyloid angiopathy hemorrhage (CAAH), which occurs at the superficial or cortical-subcortical region of the grey and white matter junction. Computed tomography (CT) and magnetic resonance imaging (MRI) are the most used imaging tools in diagnosing ICH. However, availability, time, and cost often prevent emergent MRI use. Therefore, CT remains the primary tool in the diagnosis of ICH. The assessment of imaging studies is time-dependent, and a radiologist should do a detailed diagnostic evaluation. Human error can occur in a pressured …", "total_citations": 1, "citation_graph": {"2023": 1}}, {"title": "VEntNet: Hybrid deep convolutional neural network model for automated multi‐class categorization of chest X‐rays", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:RGFaLdJalmkC", "authors": ["Vidya K Sudarshan", "Reshma A. Ramachandra", "Nicole Si Min Tan", "Smit Ojha", "Ru San Tan"], "publication_date": "2022/5", "journal": "International Journal of Imaging Systems and Technology", "description": "Visual interpretation of chest X‐rays (CXRs) is tedious and prone to error. Significant amount of time is spent by the radiologist in differentiating normal from abnormal CXRs and in identifying the location and type of abnormalities. An assistance tool for automatically classifying normal and different types of abnormal CXRs can facilitate the diagnosis and potentially save time costs. In this paper, a novel hybrid model having concatenation of Visual Geometry Group (VGG19) network and Entropy features as a modified deep convolutional neural network (DCNN) architecture, called VEntNet, is proposed for the automated multi‐class categorization of CXR images into normal, coronavirus disease (COVID), tuberculosis (TB), viral pneumonia, and bacterial pneumonia. The VEntNet model implemented consists of deep features extraction from convolutional layers of VGG19 network which are then concatenated with …", "total_citations": 1, "citation_graph": {"2022": 1}}, {"title": "Automated identification of infarcted myocardium tissue characterisation using ultrasound images: A", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:LkGwnXOMwfcC", "authors": ["Vidya Sudarshan", "U Acharya", "Eddie Yin-Kwee Ng", "Chou Siaw Meng", "Ru San Tan", "Dhanjoo N Ghista"], "publication_date": "2014/3/26", "description": "Myocardial infarction (MI) or acute myocardial infarction (AMI) commonly known as heart attack is one of the major causes of cardiac death worldwide. It occurs when the blood supply to the portion of the heart muscle is blocked or stopped causing death of heart muscle cells. Early detection of MI will help to prevent the infarct expansion leading to left ventricle (LV) remodeling and further damage to the cardiac muscles. Timely identification of MI and the extent of LV remodeling are crucial to reduce the time taken for further tests, and save the cost due to early treatment. Echocardiography images are widely used to assess the differential diagnosis of normal and infarcted myocardium. The reading of ultrasound images is subjective due to inter-observer variability and may lead to inconclusive findings which may increase the anxiety for patients. Hence a computeraided diagnostic (CAD) technique which uses echocardiography images of the heart coupled with pattern recognition algorithms can accurately classify normal and infarcted myocardium images. In this review paper, we have discussed the various components that are used to develop a reliable CAD system.", "total_citations": 1, "citation_graph": {"2018": 1}}, {"title": "Interpretable hybrid model for an automated patient-wise categorization of hypertensive and normotensive electrocardiogram signals", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:NaGl4SEjCO4C", "authors": ["Chen Chen", "Hai Yan Zhao", "Shou Huan Zheng", "Reshma A Ramachandra", "Xiaonan He", "Yin Hua Zhang", "Vidya K Sudarshan"], "publication_date": "2023/1/1", "journal": "Computer Methods and Programs in Biomedicine Update", "description": "Background and Objective\nHypertension is critical risk factor of fatal cardiovascular diseases and multiple organ damage. Early detection of hypertension even at pre-hypertension stage is helpful in preventing the forthcoming complications. Electrocardiogram (ECG) has been attempted to observe the changes in electrical activities of the hearts of hypertensive patients. To automate the ECG assessment in the detection of hypertension, an interpretable hybrid model is proposed in this paper.\nMethods\nThe proposed hybrid framework consists of one dimensional - Convolutional Neural Network architecture with four blocks of convolutional layers, maxpooling followed by dropout layers fused with Support Vector Machine classifier in the final layer. The implemented hybrid model is made explainable and interpretable using Local Interpretable Model-agnostic Explanations (LIME) method. The developed hybrid model is …"}, {"title": "精准医学发展趋势: 从定量成像到放射组学", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:RYcK_YlVTxYC", "authors": ["U Rajendra Acharya", "Yuki Hagiwara", "Vidya K Sudarshan", "Wai Yee Chan", "Kwan Hoong Ng"], "publication_date": "2018/1", "description": "放射学(影像学)及影像引导的介入手段能提供 多参数的形态学及功能信息,在精准医学中扮演 着越来越重要的角色.因此,放射科医生需要理 解影像表型,并将这些表型与潜在的疾病相关 联,进而描述图像特征.但是为了能理解并描述 异质性实体肿瘤的分子表型(基因组学信息), 就需要通过活检取得这些组织更进一步的序列 信息.因此,放射科医生为了能获得详尽的影像 表型,需要从不同视图和角度采集图像,而这就 产生了大量的数据.从所有这些影像数据中提取 有意义的细节非常具有挑战性,并衍生出了大数 据这个命题.因为影像组学有对诊断支持提供有 意义的诠释性和预测性信息的潜力,所以近年来 对于影像组学的关注越来越多.影像组学是传统 的计算机辅助诊断,深度学习和人类技能的结 合,因此它能被用来定量描述肿瘤表型.本文对 影像组学流程的概览,基于不同手段(如计算机 断层扫描(CT),磁共振成像(MRI)和正电子 发射计算机断层扫描(PET))的影像组学研究结 果,面临的挑战和影像组学对于精准医学潜在的 贡献等方面进行了讨论."}, {"title": "A multicenter prospective randomized study comparing the efficacy of escalating higher biphasic versus low biphasic energy defibrillations in patients presenting with cardiac …", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:isC4tDSrTZIC", "authors": ["Seow Yian Tay", "Peter George Manning", "Swee Han Lim", "Terrance Siang Jin Chua", "Mohan Tiru", "Rabind Antony Charles", "Vidya Sudarshan"], "publication_date": "2017", "description": "Background: Biphasic defibrillation has been practiced worldwide for> 15 years. Yet, consensus does not exist on the best energy levels for optimal outcomes when used in patients with ventricular fibrillation (VF)/pulseless ventricular tachycardia (VT). Methods: This prospective, randomized, controlled trial of 235 adult cardiac arrest patients with VF/VT was conducted in the emergency and cardiology departments. One group received low-energy (LE) shocks at 150–150–150 J and the other escalating higher-energy (HE) shocks at 200–300–360 J. If return of spontaneous circulation (ROSC) was not achieved by the third shock, LE patients crossed over to the HE arm and HE patients continued at 360 J. Primary end point was ROSC. Secondary end points were 24-hour, 7-day, and 30-day survival. Results: Both groups were comparable for age, sex, cardiac risk factors, and duration of collapse and VF/VT. Of the 118 patients randomized to the LE group, 48 crossed over to the HE protocol, 24 for persistent VF, and 24 for recurrent VF. First-shock termination rates for HE and LE patients were 66.67% and 64.41%, respectively (P= 0.78, confidence interval: 0.65–1.89). First-shock ROSC rates were 25.64% and 29.66%, respectively (P= 0.56, confidence interval: 0.46–1.45). The 24-hour, 7-day, and 30-day survival rates were 85.71%, 74.29%, and 62.86% for first-shock ROSC LE patients and 70.00%, 50.00%, and 46.67% for first-shock ROSC HE patients, respectively. Conversion rates for further shocks at 200 J and 300 J were low, but increased to 38.95% at 360 J.\nConclusion: First-shock termination and ROSC rates were not significantly different …"}, {"title": "Computer support for the diagnosis of cardiovascular diseases using Ultrasound images: A Review", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:QIV2ME_5wuYC", "authors": ["Oliver Faust", "U Rajendra Acharya", "Vidya K Sudarshan", "Tan Ru San", "Chai Hong", "Filippo Molinari Yeong", "Kwan Hoong Ng"], "publication_date": "2016/8/15", "description": "The diagnosis of Coronary Artery Disease (CAD), Myocardial Infarction (MI) and carotid atherosclerosis is of paramount importance, as these cardiovascular diseases may cause medical complications and large number of death. Ultrasound (US) is a widely used imaging modality to diagnose diseases, as it captures moving images and image features correlate well with results from other imaging methods. Furthermore, US does not use ionizing radiation and it is economical when compared to other imaging modalities. However, viewing US images takes time and the relationship between image and tissue composition is complex. Therefore, the diagnostic accuracy depends on both time taken to read the images and experience of the screening practitioner. Computer support tools can reduce the inter-operator variability with lower subject specific expertise, when appropriate processing methods are used. In the current review, we analysed automatic detection methods for the diagnosis of CAD, MI and carotid atherosclerosis based on thoracic and Intravascular Ultrasound (IVUS). We found that IVUS is more often used then thoracic US for CAD. The relationship is reversed for MI and for carotid atherosclerosis IVUS is still experimental. Furthermore, thoracic US is more often used than IVUS for computer aided diagnosis systems."}, {"title": "An integrated index to detect the extent of myocardial infarction using echocardiographic texture analysis", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:hC7cP41nSMkC", "authors": ["Vidya Sudarshan"], "publication_date": "2016", "description": "Expansion of infarcted zone after Myocardial Infarction (MI) has serious short and long-term consequences and contributes to increased mortality. Early detection and quantitative assessment of MI will help to prevent further damage of the cardiac muscles. Though two-dimensional (2D) echocardiogram helps to detect MI at early stage, the reading of ultrasound images is subjective due to inter-observer variability and may lead to inconclusive findings which may increase the patient anxiety and cost of treatment. Automated detection of MI and quantification of the extent of MI will enhance the capabilities of diagnosis system. However, little work has been done in the area of computer-based texture analysis for automated detection of extent of MI in general, and existing literature is found to be largely confined only to MI detection. In this thesis, various algorithms have been proposed to identify infarcted myocardium and extent of infarcted myocardium that are categorised into (a) normal myocardium, (b) moderately infarcted myocardium, and (c) severely infarcted myocardium using 2D echocardiogram texture analysis. The automated identification of normal and infarcted myocardium algorithm is developed first, using Discrete Wavelet Transform (DWT), second order statistics calculated from Gray- Level Co-ccurrence Matrix (GLCM) and Higher-Order Spectra (HOS) texture descriptors. The proposed system is validated using 400 MI and 400 normal ultrasound images, obtained from 80 patients with MI and 80 normal subjects. Among the three techniques presented, DWT yielded the highest classification accuracy. Another efficient multi-resolution …"}, {"title": "Computer-Aided Diagnosis of Depression Using EEG Signals.", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:lSLTfruPkqcC", "authors": ["Vidya K Sudarshan", "Jayasree Santhosh", "Joel EW Koh"], "publication_date": "2015/6/1", "journal": "European Neurology", "description": "The complex, nonlinear and non-stationary electroencephalogram (EEG) signals are very tedious to interpret visually and highly difficult to extract the significant features from them. The linear and nonlinear methods are effective in identifying the changes in EEG signals for the detection of depression. Linear methods do not exhibit the complex dynamical variations in the EEG signals. Hence, chaos theory and nonlinear dynamic methods are widely used in extracting the EEG signal features for computer-aided diagnosis (CAD) of depression. Hence, this article presents the recent efforts on CAD of depression using EEG signals with a focus on using nonlinear methods. Such a CAD system is simple to use and may be used by the clinicians as a tool to confirm their diagnosis. It should be of a particular value to enable the early detection of depression.© 2015 S. Karger AG, Basel"}, {"title": "An integrated index for detection of Sudden Cardiac Death using Discrete", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:4JMBOYKVnBMC", "authors": ["U Rajendra Acharya", "Hamido Fujita", "Vidya K Sudarshan", "Vinitha Sree", "Lim Wei Jie Eugene", "Dhanjoo N Ghista", "Ru San Tan"], "publication_date": "2015/3/27", "description": "34 Early prediction of person at risk of Sudden Cardiac Death (SCD) with or without the onset of Ventricular 35 Tachycardia (VT) or Ventricular Fibrillation (VF) still remains a continuing challenge to clinicians. In this 36 work, we have presented a novel integrated index for prediction of SCD with a high level of accuracy by 37 using electrocardiogram (ECG) signals. To achieve this, nonlinear features (Fractal Dimension (FD), 38 Hurst’s exponent (H), Detrended Fluctuation Analysis (DFA), Approximate Entropy (ApproxEnt), 39 Sample Entropy (SampEnt), and Correlation Dimension (CD)) are first extracted from the second level 40 Discrete Wavelet Transform (DWT) decomposed ECG signal. The extracted nonlinear features are ranked 41 using t-value and then, a combination of highly ranked features are used in the formulation and employ-42 ment of an integrated Sudden Cardiac Death Index (SCDI). This calculated novel SCDI can be used to accu-43 rately predict SCD (four minutes before the occurrence) by using just one numerical value four minutes 44 before the SCD episode. Also, the nonlinear features are fed to the following classifiers: Decision Tree 45 (DT), k-Nearest Neighbour (KNN), and Support Vector Machine (SVM). The combination of DWT and non-46 linear analysis of ECG signals is able to predict SCD with an accuracy of 92.11%(KNN), 98.68%(SVM), 47 93.42%(KNN) and 92.11%(SVM) for first, second, third and fourth minutes before the occurrence of 48 SCD, respectively. The proposed SCDI will constitute a valuable tool for the medical professionals to 49 enable them in SCD prediction."}, {"title": "Front & Back Matter", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:7PzlFSSx8tAC", "authors": ["Ketan Jhunjhunwala", "Abhishek Lenka", "Pramod Kumar Pal", "U Rajendra Acharya", "Hojjat Adeli", "Vidya K Sudarshan", "Jayasree Santhosh", "Joel EW Koh", "Amir Adeli", "Shunji Mugikura", "Miki Fujimura", "Shoki Takahashi", "Wolfgang H Zangemeister", "Carsten Buhmann", "Christian Gerloff", "Stefanie Kraft", "Kim Hinkelmann", "Sven Krause", "Seung-Jae Lee", "Dong-Geun Lee", "Dal-Soo Lim", "Sukkeun Hong", "Kyong Jin Shin", "Tae Hyung Kim", "Yong Hee Han", "Chi Woong Mun", "Sung Eun Kim", "Sam Yeol Ha", "Jin Se Park", "Kang Min Park", "Lucio Tremolizzo", "Michele Augusto Riva", "Iacopo Bellani", "Lorenzo Lorusso", "Carlo Ferrarese", "Giancarlo Cesana", "Hiroo Ichikawa", "Masayuki Sugie", "Yuki Kamiya", "Natuko Iizuka", "Hidetomo Murakami", "Mitsuru Kawamura", "Oumei Cheng", "Ting Liang", "Rong Li", "Jun Pyo Kim", "Suk Jae Kim", "Jung Jae Lee", "Ji Hoon Cha", "Oh Young Bang", "Chin-Sang Chung", "Kwang Ho Lee", "Gyeong-Moon Kim", "Monika Turk", "Matija Zupan", "Marjan Zaletel", "Bojana Žvan", "Janja Pretnar Oblak", "Xiao-Feng Huang", "Kai-Yue Wang", "Zhan-Hua Liang", "Rong-Rong Du", "Li-Na Zhou", "Kang-Ho Choi", "Tai-Seung Nam", "Man-Seok Park", "Seong-Min Choi", "Byeong C Kim", "Jane Chang", "Joon-Tae Kim", "Seung-Han Lee", "Woong Yoon", "Mony J de Leon", "Joana Domingos", "Cláudia Ferrão", "Joana Ramalho", "Tiago Rodrigues", "Bruno Moreira", "Ernestina Santos", "Andreia Bettencourt", "Ana Martins da Silva", "Berta Silva", "Paulo Pinho e Costa", "Carlos Vasconcelos", "João Correia", "Alessandra Pompa", "Allessandro Clemenzi", "Elio Troisi", "Luca Pace", "Paolo Casillo", "Sheila Catani", "Maria Grazia Grasso", "Jean-Michel Vallat", "Stéphane Mathis", "Karima Ghorab", "Michel-André Milor", "Laurence Richard", "Laurent Magy", "Druckerei Stückle"], "publication_date": "2015", "journal": "European Neurology", "description": "73 15–6 115 print Page 1 S. Karger Medical and Scientific Publishers Basel . Freiburg . Paris . London . New York . Chennai . New Delhi . Bangkok . Beijing . Shanghai . Tokyo . Kuala Lumpur . Singapore . Sydney Eur Neurol 73(5–6) 257–366 (2015) 73 15–6 115 print ISSN 0014–3022 online e-ISSN 1421–9913 www.karger.com/ene Page 2 KI15184 ■ Festschrift Karger – Connecting the World of Biomedical Science This richly illustrated Festschrift chronicles the company’s development and contributions in the service of medicine and science since 1890. It tells the history of Karger Publishers until the present day. Please send an e-mail to 125years@karger.com to receive your free copy or discover it online. www.karger.com/festschrift Medical and Scientific Publishers Karger Publishers – 125 Years of Experience in Medical and 6FLHQWLƃF 3XEOLVKLQJ Publishing Highlights 1890–2015 Take a guided tour …"}, {"title": "精准医学发展趋势: 从定量成像到放射组学 (英文)", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=jhD-lGAAAAAJ&pagesize=100&citation_for_view=jhD-lGAAAAAJ:j3f4tGmQtD8C", "authors": ["U Rajendra ACHARYA", "Yuki HAGIWARA", "Vidya K SUDARSHAN", "Wai Yee CHAN", "Kwan Hoong NG"], "description": "放射学 (影像学) 及影像引导的介入手段能提供多参数的形态学及功能信息, 在精准医学中扮演着越来越重要的角色. 因此, 放射科医生需要理解影像表型, 并将这些表型与潜在的疾病相关联, 进而描述图像特征. 但是为了能理解并描述异质性实体肿瘤的分子表型 (基因组学信息), 就需要通过活检取得这些组织更进一步的序列信息. 因此, 放射科医生为了能获得详尽的影像表型, 需要从不同视图和角度采集图像, 而这就产生了大量的数据. 从所有这些影像数据中提取有意义的细节非常具有挑战性, 并衍生出了大数据这个命题. 因为影像组学有对诊断支持提供有意义的诠释性和预测性信息的潜力, 所以近年来对于影像组学的关注越来越多. 影像组学是传统的计算机辅助诊断, 深度学习和人类技能的结合, 因此它能被用来定量描述肿瘤表型. 本文对影像组学流程的概览, 基于不同手段 (如计算机断层扫描 (CT), 磁共振成像 (MRI) 和正电子发射计算机断层扫描 (PET)) 的影像组学研究结果, 面临的挑战和影像组学对于精准医学潜在的贡献等方面进行了讨论."}]}