{"goog_sch_url": "https://scholar.google.com/citations?hl=en&user=6QTmlnAAAAAJ", "name": "Seah Hock Soon", "interests": ["Computer Graphics", "Computer Animation", "Computer Games"], "co_authors_url": [], "citation_table": {"columns": ["All", "Since 2018"], "Citations": [3494, 1460], "h-index": [32, 19], "i10-index": [93, 40]}, "citation_graph": {"2000": 10, "2001": 16, "2002": 13, "2003": 27, "2004": 25, "2005": 55, "2006": 60, "2007": 57, "2008": 90, "2009": 109, "2010": 122, "2011": 155, "2012": 199, "2013": 170, "2014": 248, "2015": 229, "2016": 207, "2017": 180, "2018": 200, "2019": 236, "2020": 277, "2021": 249, "2022": 276, "2023": 222}, "articles": [{"title": "Phase-shifting profilometry combined with Gray-code patterns projection: unwrapping error removal by an adaptive median filter", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=6QTmlnAAAAAJ&pagesize=100&citation_for_view=6QTmlnAAAAAJ:43bX7VzcjpAC", "authors": ["Dongliang Zheng", "Feipeng Da", "Qian Kemao", "Hock Soon Seah"], "publication_date": "2017/3/6", "journal": "Optics express", "description": "Phase-shifting profilometry combined with Gray-code patterns projection has been widely used for 3D measurement. In this technique, a phase-shifting algorithm is used to calculate the wrapped phase, and a set of Gray-code binary patterns is used to determine the unwrapped phase. In the real measurement, the captured Gray-code patterns are no longer binary, resulting in phase unwrapping errors at a large number of erroneous pixels. Although this problem has been attended and well resolved by a few methods, it remains challenging when a measured object has step-heights and the captured patterns contain invalid pixels. To effectively remove unwrapping errors and simultaneously preserve step-heights, in this paper, an effective method using an adaptive median filter is proposed. Both simulations and experiments can demonstrate its effectiveness.", "total_citations": 147, "citation_graph": {"2017": 5, "2018": 13, "2019": 18, "2020": 33, "2021": 24, "2022": 28, "2023": 25}}, {"title": "Complex object correspondence construction in two-dimensional animation", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=6QTmlnAAAAAJ&pagesize=100&citation_for_view=6QTmlnAAAAAJ:eJXPG6dFmWUC", "authors": ["Jun Yu", "Dongquan Liu", "Dacheng Tao", "Hock Soon Seah"], "publication_date": "2011/5/31", "journal": "IEEE Transactions on Image Processing", "description": "Correspondence construction of objects in key frames is the precondition for inbetweening and coloring in 2-D computer-assisted animation production. Since each frame of an animation consists of multiple layers, objects are complex in terms of shape and structure. Therefore, existing shape-matching algorithms specifically designed for simple structures such as a single closed contour cannot perform well on objects constructed by multiple contours with an open shape. This paper introduces a semisupervised patch alignment framework for complex object correspondence construction. In particular, the new framework constructs local patches for each point on an object and aligns these patches in a new feature space, in which correspondences between objects can be detected by the subsequent clustering. For local patch construction, pairwise constraints, which indicate the corresponding points (must link) or …", "total_citations": 118, "citation_graph": {"2011": 1, "2012": 14, "2013": 19, "2014": 30, "2015": 21, "2016": 8, "2017": 6, "2018": 6, "2019": 2, "2020": 7, "2021": 1, "2022": 1, "2023": 2}}, {"title": "On combining multiple features for cartoon character retrieval and clip synthesis", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=6QTmlnAAAAAJ&pagesize=100&citation_for_view=6QTmlnAAAAAJ:_Re3VWB3Y0AC", "authors": ["Jun Yu", "Dongquan Liu", "Dacheng Tao", "Hock Soon Seah"], "publication_date": "2012/4/25", "journal": "IEEE Transactions on Systems, Man, and Cybernetics, Part B (Cybernetics)", "description": "How do we retrieve cartoon characters accurately? Or how to synthesize new cartoon clips smoothly and efficiently from the cartoon library? Both questions are important for animators and cartoon enthusiasts to design and create new cartoons by utilizing existing cartoon materials. The first key issue to answer those questions is to find a proper representation that describes the cartoon character effectively. In this paper, we consider multiple features from different views, i.e., color histogram, Hausdorff edge feature, and skeleton feature, to represent cartoon characters with different colors, shapes, and gestures. Each visual feature reflects a unique characteristic of a cartoon character, and they are complementary to each other for retrieval and synthesis. However, how to combine the three visual features is the second key issue of our application. By simply concatenating them into a long vector, it will end up with the …", "total_citations": 111, "citation_graph": {"2012": 3, "2013": 17, "2014": 29, "2015": 29, "2016": 12, "2017": 7, "2018": 2, "2019": 5, "2020": 2, "2021": 0, "2022": 2, "2023": 2}}, {"title": "Fringe pattern denoising using coherence-enhancing diffusion", "url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=6QTmlnAAAAAJ&pagesize=100&citation_for_view=6QTmlnAAAAAJ:4DMP91E08xMC", "authors": ["Haixia Wang", "Qian Kemao", "Wenjing Gao", "Feng Lin", "Hock Soon Seah"], "publication_date": "2009/4/15", "journal": "Optics letters", "description": "Electronic speckle pattern interferometry is one of the methods measuring the displacement on object surfaces in which fringe patterns need to be evaluated. Noise is one of the key problems affecting further processing and reducing measurement quality. We propose an application of coherence-enhancing diffusion to fringe-pattern denoising. It smoothes a fringe pattern along directions both parallel and perpendicular to fringe orientation with suitable diffusion speeds to more effectively reduce noise and improve fringe-pattern quality. It is a generalized work of Tang's et al.'s [Opt. Lett.33, 2179 (2008)] model that only smoothes a fringe pattern along fringe orientation. Since our model diffuses a fringe pattern with an additional direction, it is able to denoise low-density fringes as well as improve denoising effectiveness for high-density fringes. Theoretical analysis as well as simulation and experimental verifications …", "total_citations": 94, "citation_graph": {"2009": 2, "2010": 8, "2011": 5, "2012": 8, "2013": 6, "2014": 5, "2015": 6, "2016": 8, "2017": 6, "2018": 7, "2019": 6, "2020": 5, "2021": 9, "2022": 11}}]}