{"full_name": "Huang Shell Ying", "email": "assyhuang@ntu.edu.sg", "name_card": "Dr Huang Shell Ying", "designations": ["Senior Lecturer, School of Computer Science and Engineering"], "urls": {"dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00643"}, "biography": "Dr. Huang Shell Ying is a senior lecturer with the School of Computer Science and Engineering, Nanyang Technological University.  She obtained both her B.Sc(Eng) in Computing Science with Honours and her PhD from Imperial College, London.  Her research interests are in simulation based optimization heuristics, metaheuristics, computational science, computational logistics  and intelligent decision support systems.  She has been the principle investigator or co-principle investigator for a number of projects funded by Maritime and Port Authority of Singapore, NSTB (now the ASTAR), GINTIC (now the SimTech), PSA International, Jurong Port Pte Ltd, Surbana Consultants, APL and NTU.  She has published about 100 publications in books, international journals and international conferences.  She was awarded the Minister’s Innovation (Merit) Award by Minister for Transport of Singapore, Mr. Raymond Lim in 2007 for her contribution in the research work in optimization of container port operations.Teaching expriences:Courses she has given lectures and tutorials:  Compiler Techniques, Algorithms,  Advanced Algorithms, Simulation & Modelling,  Introduction to Programming, Discrete Mathmatics, Engineering Mathematics.Courses she has given tutorials: Operating Systems, Artificial Intelligence, Data Structures, Object-oriented Programming.Recent publications:Huang Shell Ying, Li Ya. (2017). Yard Crane Scheduling to Minimize Total Weighted Vessel Loading Time in Container Terminals. Flexible Services and Manufacturing Journal, 29(3), 689-720.Cheng Siang Lim and Shell Ying Huang. (2017). Proceedings of 2017 Future Technologies Conference: A Randomized Heuristic Algorithm for Cyclic Routing of UAVs. Future Technologies Conference 2017 (pp. 462-469)Vancouver, Canada: IEEE, Vancouver.S. Y. Huang, Y. Li and N. K. X. Tay. (2017). REAL-TIME SCHEDULING FOR TWIN YARD CRANES IN CONTAINER TERMINALS. International Conference on Computers and Industrial Engineering (CIE47).S. Y. Huang, Y. Li and W. J. Hsu. (2017). A TWO-LEVEL DYNAMIC PROGRAMMING ALGORITHM FOR QUAY CRANE SCHEDULING IN CONTAINER TERMINALS. The 47th International Conference on Computers and Industrial Engineering.Shell Ying Huang, Wen Jing Hsu, Hui Fang and Tiancheng Song. (2016). MTSS – a Marine Traffic Simulation System and Scenario Studies for a Major Hub Port. ACM Transactions on Modeling and Computer Simulation, 27(1).Shell Ying Huang, Ya Li, Meimei Lau and Teck Chin Tay. (2014). YARD CRANE DEPLOYMENT IN CONTAINER TERMINALS. 2014 Winter Simulation Conference.Shell Ying Huang, Ya Li and Xi Guo. (2014). YARD CRANE DISPATCHING TO MINIMIZE VESSEL TURNAROUND TIMES IN CONTAINER TERMINALS. 2014 Winter Simulation Conference.Shell Ying Huang and Zhun Chong Tay. (2013). A Framework for Automated Real-Time Management of Container Handling Equipment. The 2013 International Conference on Logistics and Maritime Systems.Shell Ying Huang and Xi Guo. (2013). Reducing Simulation Costs of Embedded Simulation in Yard Crane Dispatching in Container Terminals. SIGSIM-PADS’13.Shell Ying Huang, Wen Jing Hsu, Hui Fang and Tiancheng Song. (2013). A Marine Traffic Simulation System for Hub Ports. SIGSIM-PADS’13.Xi Guo, Shell Ying Huang. (2012). Dynamic Space and Time Partitioning for Yard Crane Workload Management in Container Terminals. Transportation Science, 46(1), 134-148. Shell Ying Huang, Wen Jing Hsu and Yuxiong He. (2011). Assessing Capacity and Improving Utilization of Anchorages. Transportation Research Part E: Logistics and Transportation Review, 47E(2), 216-227. Shell Ying Huang, Huiliang Zhang. (2011). Activity Scheduling for a Robotic Caretaker Agent for the Elderly. International Journal of Intelligent Information and Database Systems , 5(1), 3-23.", "grants": [], "keywords": ["Business and Management", "Computer Science and Engineering", "Info-Communication Technology", "Systems and Engineering Management", "Parallel and Distributed Computing"], "goog_sch_url": "https://scholar.google.com/citations?hl=en&user=zWYCmiAAAAAJ", "interests": ["simulation optimization", "computational logistics", "intelligent agents"], "citation_table": {"columns": ["All", "Since 2018"], "Citations": [1798, 514], "h-index": [21, 11], "i10-index": [40, 16]}, "citation_graph": {"2002": 31, "2003": 35, "2004": 36, "2005": 30, "2006": 41, "2007": 44, "2008": 64, "2009": 73, "2010": 85, "2011": 99, "2012": 115, "2013": 87, "2014": 104, "2015": 115, "2016": 97, "2017": 83, "2018": 91, "2019": 96, "2020": 110, "2021": 65, "2022": 92, "2023": 58, "2000": 37, "2001": 24, "1996": 9, "1997": 3, "1998": 11, "1999": 13, "1992": 1, "1993": 4, "1994": 3, "1995": 3}, "education": {"Bachelor Degree": "Imperial College, London", "Master Degree": null, "PhD": "Imperial College, London"}, "pub_graph": {"2002": 1, "2005": 3, "2011": 7, "2000": 3, "2012": 2, "1999": 2, "2010": 7, "2008": 5, "2009": 5, "2003": 3, "1994": 3, "1998": 4, "2013": 3, "1992": 1, "2006": 5, "1996": 2, "1997": 2, "1993": 1, "2018": 1, "2017": 2, "2016": 1, "2004": 1, "2001": 1, "2015": 1, "2014": 2, "1995": 0, "2007": 0, "2019": 0, "2020": 0, "2021": 0, "2022": 0, "2023": 0}, "h_index_graph": {"2002": 8, "2003": 9, "2004": 10, "2005": 10, "2006": 10, "2007": 11, "2008": 11, "2009": 12, "2010": 12, "2011": 12, "2012": 13, "2013": 14, "2014": 15, "2015": 16, "2016": 17, "2017": 17, "2018": 19, "2019": 19, "2020": 19, "2021": 19, "2022": 20, "2023": 21, "2000": 6, "2001": 8, "1999": 4, "1994": 2, "1995": 2, "1996": 2, "1997": 2, "1998": 3, "1992": 1, "1993": 1}, "avg_citation_graph": {"1992": 1.0, "1993": 2.5, "1994": 1.6, "1995": 2.2, "1996": 2.857142857142857, "1997": 2.5555555555555554, "1998": 2.6153846153846154, "1999": 3.1333333333333333, "2000": 4.666666666666667, "2001": 5.684210526315789, "2002": 6.95, "2003": 7.565217391304348, "2004": 8.75, "2005": 8.88888888888889, "2006": 8.78125, "2007": 10.15625, "2008": 10.513513513513514, "2009": 11.0, "2010": 11.16326530612245, "2011": 11.535714285714286, "2012": 13.120689655172415, "2013": 13.901639344262295, "2014": 15.11111111111111, "2015": 16.671875, "2016": 17.907692307692308, "2017": 18.611940298507463, "2018": 19.676470588235293, "2019": 21.08823529411765, "2020": 22.705882352941178, "2021": 23.66176470588235, "2022": 25.014705882352942, "2023": 25.86764705882353}}