{"full_name": "Liu Ziwei", "email": "ziwei.liu@ntu.edu.sg", "name_card": "Asst Prof Liu Ziwei", "designations": ["Nanyang Assistant Professor, School of Computer Science and Engineering"], "urls": {"dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00203", "website": "https://liuziwei7.github.io/"}, "biography": "Ziwei Liu is currently a Nanyang Assistant Professor at School of Computer Science and Engineering (SCSE) in Nanyang Technological University (NTU). Previously, he was a senior research fellow (2018-2020) at the Chinese University of Hong Kong with Prof. Dahua Lin. Before that, he was a postdoctoral researcher (2017-2018) at University of California, Berkeley, working with Prof. Stella Yu. Ziwei received his PhD from the Chinese University of Hong Kong in 2017, under the supervision of Prof. Xiaoou Tang and Prof. Xiaogang Wang. During his PhD, Ziwei had the privilege of interning at Microsoft Research and Google Research, where he developed Microsoft Pix and Google Clips. His research revolves around computer vision/graphics, machine learning, and robotics. He has published over 50 papers on top-tier conferences and journals in relevant fields, including CVPR, ICCV, ECCV, AAAI, IROS, SIGGRAPH, T-PAMI, TOG, and Nature - Scientific Reports. He is the recipient of Microsoft Young Fellowship, Hong Kong PhD Fellowship, ICCV Young Researcher Award, and HKSTP best paper award. He has won the championship in major computer vision competitions, including DAVIS video segmentation challenge 2017, MSCOCO instance segmentation challenge 2018, and FAIR self-supervision challenge 2019. He is also the lead contributor of several renowned computer vision benchmarks and softwares, including CelebA, DeepFashion, mmdetection and mmfashion.", "grants": ["3D Geometry and Semantic Modeling for Human‐Scene Interaction", "Google PhD Fellowship", "Human-Centric Visual Manipulation via Interactive Dialog", "Reliable Visual Sensing and Recognition under Naturally Distributed Data", "Resource-Efficient AI “Imbalanced-data Learning, Few-shot Learning, Domain Adaptation”", "Trustworthy and Explainable AI “Generative Models, Forgery Detection, Adversarial Learning”", "Trustworthy and Explainable AI “Robust Machine Learning, Domain Generalization, Explainable AI”", "Trustworthy and Explainable AI “Robust Perception, Efficient Learning, Domain Adaptation”"], "keywords": ["Computer Science and Engineering"], "goog_sch_url": "https://scholar.google.com/citations?hl=en&user=lc45xlcAAAAJ", "interests": ["Computer Vision", "Machine Learning", "Computer Graphics"], "citation_table": {"columns": ["All", "Since 2018"], "Citations": [32044, 31140], "h-index": [63, 63], "i10-index": [127, 127]}, "citation_graph": {"2016": 191, "2017": 568, "2018": 1265, "2019": 2177, "2020": 3639, "2021": 5672, "2022": 8262, "2023": 9836, "2014": 3, "2015": 10}, "education": {"Bachelor Degree": null, "Master Degree": "Chinese University of Hong Kong", "PhD": "Chinese University of Hong Kong"}, "pub_graph": {"2015": 2, "2019": 13, "2016": 4, "2020": 13, "2017": 6, "2022": 36, "2018": 5, "2021": 32, "2023": 23, "2014": 1}, "h_index_graph": {"2015": 2, "2016": 4, "2017": 8, "2018": 11, "2019": 19, "2020": 24, "2021": 34, "2022": 48, "2023": 62, "2014": 0}, "avg_citation_graph": {"2014": 3.0, "2015": 4.333333333333333, "2016": 29.142857142857142, "2017": 59.38461538461539, "2018": 113.16666666666667, "2019": 135.93548387096774, "2020": 178.47727272727272, "2021": 177.96052631578948, "2022": 194.52678571428572, "2023": 234.24444444444444}}