{"full_name": "Shen Zhiqi", "email": "zqshen@ntu.edu.sg", "name_card": "Dr Shen Zhiqi", "designations": ["Senior Lecturer, School of Computer Science and Engineering"], "urls": {"dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00227", "website": "https://personal.ntu.edu.sg/zqshen"}, "biography": "Dr. Shen Zhiqi is currently a Senior Lecturer and a Senior Research Scientist in School of Computer Engineering since Dec. 2011. He obtained BSc in Peking Univ., MEng in Beijing Univ. of Technology, and PhD in Nan. Tech. Univ. respectively. He has over ten years R&D experiences in both university institutes and leading global industry in Canada and Singapore. He successfully led a number of well known government funded research projects and applied the research results in large scale industry projects. His main research areas are in artificial and computational intelligent agents and their applications in Interactive Digital Media (IDM) and other real world systems in different domains. His research work has been published in reputable journals (IEEE transactions, IEICE transactions, etc.) and top conferences in agent (AAMAS), computational intelligence (WCCI) and artificial intelligence (IJCAI). The agent based game engine developed based on his PhD research has attracted much attention from both research and industrial communities and has been presented at AAMAS 2006, ACM Entertainment Conference 2006 and Microsoft Game conference 2006 and 2007. He has been actively involved in multidisciplinary research through collaborations involving NIE, ADM, SCI, SCE, CED at NTU and leading universities and industry world wide. In recent three years, he has been awarded over three million substantial industry and government linked research funding in agent based research including over one million NRF-MOE-IDM grant, MOE-NIE/LSL grant, HP e-Learning Grant and NGO/ASTAR grant as a Co-PI. Collaborating with Harvard, MIT and NIE/LSL researchers, “Virtual Singapura” built using his agent based game engine is the first immersive, situated and massive multi-user online role playing (MMORP) virtualized learning environment in Singapore for enabling students to learn through exploring in virtual worlds.", "grants": ["AARA-DA: AI-powered avatar, Adaptive progression and Remediation Analytics for DyscalculiA"], "keywords": ["Computational Intelligence", "Computer Vision and Sensing", "Graphics and Interactive Computing", "Ageing", "Artificial and Augmented Intelligence"], "goog_sch_url": "https://scholar.google.com/citations?hl=en&user=EA2T_lwAAAAJ", "interests": ["Goal Modeling", "Software Agents", "Intelligent Agents", "Health Games", "Educational Games"], "citation_table": {"columns": ["All", "Since 2018"], "Citations": [6397, 3503], "h-index": [39, 27], "i10-index": [125, 62]}, "citation_graph": {"2017": 197, "2018": 231, "2019": 345, "2020": 416, "2021": 470, "2022": 437, "2023": 314, "2010": 13, "2011": 40, "2012": 89, "2013": 107, "2014": 131, "2015": 224, "2016": 206, "2009": 1}, "education": {"Bachelor Degree": "Peking Univ.", "Master Degree": "Beijing Univ. of Technology", "PhD": "Nan. Tech. Univ."}, "pub_graph": {"2017": 4, "2018": 2, "2010": 4, "2013": 3, "2011": 1, "2014": 1, "2009": 3, "2012": 1, "2016": 1, "2015": 0, "2019": 0, "2020": 0, "2021": 0, "2022": 0, "2023": 0}, "h_index_graph": {"2017": 13, "2018": 15, "2019": 20, "2020": 20, "2021": 20, "2022": 20, "2023": 20, "2010": 2, "2011": 4, "2012": 7, "2013": 8, "2014": 10, "2015": 12, "2016": 13, "2009": 1}, "avg_citation_graph": {"2009": 0.3333333333333333, "2010": 2.0, "2011": 6.75, "2012": 15.88888888888889, "2013": 20.833333333333332, "2014": 29.307692307692307, "2015": 46.53846153846154, "2016": 57.92857142857143, "2017": 56.0, "2018": 61.95, "2019": 79.2, "2020": 100.0, "2021": 123.5, "2022": 145.35, "2023": 161.05}}