{"full_name": "Wei Ying", "email": "ying.wei@ntu.edu.sg", "name_card": "Asst Prof Wei Ying", "designations": ["Assistant Professor, School of Computer Science and Engineering"], "urls": {"dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp02297", "homepage": "https://wei-ying.net/"}, "biography": "Ying Wei is an Assistant Professor at the School of Computer Science and Engineering, Nanyang Technological University since Sep 2023. Prior to that, she was an Assistant Professor at the Department of Computer Science, City University of Hong Kong and a Senior Researcher at the Machine Learning Center of Tencent AI Lab from November 2017 to January 2021. She works on machine learning, and is especially interested in solving challenges in knowledge transfer by pushing the boundaries of both theories and applications. She received her Ph.D. degree from Hong Kong University of Science and Technology in 2017 with the support of Hong Kong PhD Fellowship. Before this, she completed her Bachelor degree from Huazhong University of Science and Technology in 2012, with first class honor. Her work was nominated for the best paper candidates at KDD’14. She has co-organized the first First Workshop on Pre-training: Perspectives, Pitfalls, and Paths Forward at ICML 2022, and been invited as a senior PC member for AAAI, to give invited talks at NeurIPS MetaLearn 2021 and FTL-IJCAI 2021 workshops, and as a PC member for many other top-tier conferences, such as ICML, NeurIPS, ICLR, and etc.", "grants": ["Towards Reliable Meta-learning in the Wild: a Task Distribution-aware Framework with Energy-based Models"], "keywords": ["Computational Intelligence", "Biomedical Informatics and Data Science"], "goog_sch_url": "https://scholar.google.com/citations?hl=en&user=5UpFdKsAAAAJ", "interests": ["Machine Learning", "Transfer Learning", "Continual Learning", "Meta-learning"], "citation_table": {"columns": ["All", "Since 2018"], "Citations": [2868, 2832], "h-index": [22, 21], "i10-index": [31, 30]}, "citation_graph": {"2020": 394, "2021": 600, "2022": 784, "2023": 768, "2017": 20, "2018": 83, "2019": 194, "2016": 9, "2015": 2, "2014": 0}, "education": {"Bachelor Degree": "Huazhong University of Science and Technology", "Master Degree": null, "PhD": "Hong Kong University of Science and Technology"}, "pub_graph": {"2020": 9, "2017": 3, "2019": 6, "2018": 4, "2016": 3, "2021": 6, "2014": 1, "2022": 10, "2023": 5, "2015": 0}, "h_index_graph": {"2020": 15, "2021": 18, "2022": 20, "2023": 22, "2017": 3, "2018": 5, "2019": 9, "2016": 2, "2014": 0, "2015": 1}, "avg_citation_graph": {"2014": 0.0, "2015": 2.0, "2016": 2.75, "2017": 4.428571428571429, "2018": 10.363636363636363, "2019": 18.11764705882353, "2020": 27.0, "2021": 40.6875, "2022": 49.666666666666664, "2023": 60.723404255319146}}