{"full_name": "Shen Zhiqi", "image_path": "./data_source/profile_image/shen_zhiqi.jpg", "email": "zqshen@ntu.edu.sg", "name_card": "Dr Shen Zhiqi", "designations": ["Senior Lecturer, School of Computer Science and Engineering"], "urls": {"dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00227", "orcid": null, "personal": "https://personal.ntu.edu.sg/zqshen", "google_scholar": "https://scholar.google.com/citations?hl=en&user=EA2T_lwAAAAJ", "scopus": null, "web_of_science": null}, "biography": "Dr. Shen Zhiqi is currently a Senior Lecturer and a Senior Research Scientist in School of Computer Engineering since Dec. 2011. He obtained BSc in Peking Univ., MEng in Beijing Univ. of Technology, and PhD in Nan. Tech. Univ. respectively. He has over ten years R&D experiences in both university institutes and leading global industry in Canada and Singapore. He successfully led a number of well known government funded research projects and applied the research results in large scale industry projects. His main research areas are in artificial and computational intelligent agents and their applications in Interactive Digital Media (IDM) and other real world systems in different domains. His research work has been published in reputable journals (IEEE transactions, IEICE transactions, etc.) and top conferences in agent (AAMAS), computational intelligence (WCCI) and artificial intelligence (IJCAI). The agent based game engine developed based on his PhD research has attracted much attention from both research and industrial communities and has been presented at AAMAS 2006, ACM Entertainment Conference 2006 and Microsoft Game conference 2006 and 2007. He has been actively involved in multidisciplinary research through collaborations involving NIE, ADM, SCI, SCE, CED at NTU and leading universities and industry world wide. In recent three years, he has been awarded over three million substantial industry and government linked research funding in agent based research including over one million NRF-MOE-IDM grant, MOE-NIE/LSL grant, HP e-Learning Grant and NGO/ASTAR grant as a Co-PI. Collaborating with Harvard, MIT and NIE/LSL researchers, “Virtual Singapura” built using his agent based game engine is the first immersive, situated and massive multi-user online role playing (MMORP) virtualized learning environment in Singapore for enabling students to learn through exploring in virtual worlds.", "grants": ["AARA-DA: AI-powered avatar, Adaptive progression and Remediation Analytics for DyscalculiA"], "patents": [{"link": "https://patents.google.com/patent/US20160379296A1/en", "title": "US 2016/0379296 A1", "abstract": ": This invention proposes an autonomous interaction decision support apparatus to provide the operator of an e-commerce business with a recommendation of which received orders to perform. The apparatus autonomously tracks situational information comprising the existing level of work of the e-business, for each of multiple products and/or services offered by the business, and also a desired level of work. In this way, the recommendation protects both the reputation of the business and achieves work-life balance for the business owner."}, {"link": "https://patents.google.com/patent/US20150278676A1/en", "title": "US 2015/0278676 A1", "abstract": ": The invention proposes that a software agent for assisting a user in a virtual environment defined by a first concept map, maintains a record of its experiences in the form of a second concept map. The concept maps are compared to obtain a measure of stimulation. The measure of stimulation is used to derive a comparison value indicative an emotional state of the user, and the comparison value is used in a reward function to guide the behavior of the software agent."}, {"link": "https://patents.google.com/patent/US20180012261A1/en", "title": "US 2018/0012261 A1", "abstract": ": A method and system are proposed for presenting information relating to a product to a potential customer for the product, upon the user scanning a 2D barcode using a mobile device. The information is presented to the customer as a story generated by an agent-based storytelling system. The story is personalized to the customer using online multimedia. It can be used to conduct mobile branding and advertisement, and is able thereby to augment offline shopping with online shopping experience."}, {"link": "https://patents.google.com/patent/US20170140409A1/en", "title": "US 2017/0140409 A1", "abstract": ": A computerized reward mechanism system is proposed which makes use both of presently collected data relating to the customer, and a database of historical data relating to the customer. Using this information, the system performs a customer preference analysis, which results in selecting rewards which are adapted to the customers' personal needs. In one form, the system is positioned at a shopping center, and includes cameras for recognising past customers by image processing. This may be done without requiring customers to participate in a process of signing up to use the system. The presently collected data include responses to questions put to the customer relating to his present shopping experience. Customer honesty is considered in the step of determining which rewards to offer the consumer, to encourage the consumers to express their feelings more clearly."}, {"link": "https://patents.google.com/patent/US20150278688A1/en", "title": "US 2015/0278688 A1", "abstract": ": A remembrance agent is proposed, to be hosted on a wearable computer. The remembrance agent employs a first database (WK) of knowledge about the world in the form of concept maps. Events (“episodes”) experienced by a user are each classified as relating to one or more of the concepts in WK. The episodes are used to produce a second database (episodic memory, EM), and the classification is also used to update a third database (semantic memory, SM) organised using the concepts. The semantic memory thus summarizes the user's interaction with the concepts during the episodes. A current situation of the user is classified according to the concepts, and the classification is used, with the EM and SM, to provide to the user information relevant to the current situation."}], "keywords": ["Computational Intelligence", "Computer Vision and Sensing", "Graphics and Interactive Computing", "Ageing", "Artificial and Augmented Intelligence"], "citation_table": {"columns": ["All", "Since 2018"], "Citations": [6410, 3511], "h-index": [39, 27], "i10-index": [125, 62]}, "citation_graph": {"2017": 389, "2018": 404, "2019": 528, "2020": 608, "2021": 737, "2022": 690, "2023": 537, "2010": 89, "2011": 158, "2012": 235, "2013": 282, "2014": 275, "2015": 549, "2016": 607, "2009": 67, "2005": 27, "2006": 27, "2007": 61, "2008": 77, "2003": 3, "2004": 7, "2001": 0, "2002": 0}, "co_authors_url": [], "education": {"Bachelor Degree": "Peking Univ.", "Master Degree": "Beijing Univ. of Technology", "PhD": "Nan. Tech. Univ."}, "interests": ["Cybersecurity", "Artificial Intelligence", "Reinforcement Learning", "Machine Learning", "Multimodal learning", "Natural Language Processing", "Deep Learning", "Computer Vision", "Data-Mining", "Human-Computer Interaction", "Federated Learning"], "co_author_network": {"https://scholar.google.com/citations?hl=en&user=EA2T_lwAAAAJ": []}, "pub_graph": {"2017": 13, "2018": 12, "2010": 27, "2013": 19, "2011": 19, "2014": 18, "2009": 25, "2012": 17, "2016": 11, "2004": 5, "2015": 15, "2006": 11, "2005": 12, "2007": 16, "2020": 5, "2008": 12, "2021": 13, "2002": 3, "2019": 17, "2003": 2, "2023": 17, "2022": 5, "2001": 3, "2000": 1}, "h_index_graph": {"2017": 28, "2018": 29, "2019": 33, "2020": 34, "2021": 35, "2022": 37, "2023": 39, "2010": 9, "2011": 12, "2012": 13, "2013": 16, "2014": 18, "2015": 21, "2016": 26, "2009": 8, "2004": 1, "2005": 3, "2006": 4, "2007": 6, "2008": 7, "2002": 0, "2003": 1, "2001": 0}, "i10_index_graph": {"2017": 85, "2018": 92, "2019": 100, "2020": 105, "2021": 112, "2022": 119, "2023": 124, "2010": 8, "2011": 16, "2012": 30, "2013": 42, "2014": 52, "2015": 64, "2016": 76, "2009": 8, "2004": 0, "2005": 0, "2006": 1, "2007": 1, "2008": 5, "2002": 0, "2003": 0, "2001": 0}, "avg_citation_graph": {"2000": 0, "2001": 0.0, "2002": 0.0, "2003": 0.375, "2004": 0.7692307692307693, "2005": 1.48, "2006": 1.7777777777777777, "2007": 2.4038461538461537, "2008": 3.15625, "2009": 3.0224719101123596, "2010": 3.086206896551724, "2011": 3.8222222222222224, "2012": 4.940789473684211, "2013": 6.04093567251462, "2014": 6.920634920634921, "2015": 9.102941176470589, "2016": 11.46046511627907, "2017": 12.513157894736842, "2018": 13.570833333333333, "2019": 14.727626459143968, "2020": 16.767175572519083, "2021": 18.654545454545456, "2022": 20.785714285714285, "2023": 21.404040404040405}, "avg_pub_graph": {"2000": 1.0, "2001": 2.0, "2002": 2.3333333333333335, "2003": 2.25, "2004": 2.8, "2005": 4.333333333333333, "2006": 5.285714285714286, "2007": 6.625, "2008": 7.222222222222222, "2009": 9.0, "2010": 10.636363636363637, "2011": 11.333333333333334, "2012": 11.76923076923077, "2013": 12.285714285714286, "2014": 12.666666666666666, "2015": 12.8125, "2016": 12.705882352941176, "2017": 12.722222222222221, "2018": 12.68421052631579, "2019": 12.9, "2020": 12.523809523809524, "2021": 12.545454545454545, "2022": 12.217391304347826, "2023": 12.416666666666666}}