{"full_name": "Ong Yew Soon", "email": "asysong@ntu.edu.sg", "name_card": "Prof Ong Yew Soon", "image_path": "./data_source/profile_image/ong_yew_soon.jpg", "designations": ["Co-Director,  Singtel Cognitive and Artificial Intelligence Lab (SCALE@NTU)", "President’s Chair in Computer Science", "Professor, School of Computer Science and Engineering", "Professor, School of Physical & Mathematical Sciences (Courtesy Appointment)", "Co-Director, Singtel Cognitive and Artificial Intelligence Lab for Enterprises @ NTU, Singtel Cognitive and Artificial Intelligence Lab (SCALE@NTU)", "Programme Director, Singtel Cognitive and Artificial Intelligence Lab for Enterprises @ NTU, Singtel Cognitive and Artificial Intelligence Lab (SCALE@NTU)"], "biography": "Yew-Soon Ong is currently a President's Chair Professor of Computer Science at the School of Computer Science and Engineering and Professor (Cross Appointment) of the School of Physical and Mathematical Science at Nanyang Technological University (NTU), Singapore. At the same time, he is Chief Artificial Intelligence (CAS) Scientist of the Singapore's Agency for Science, Technology and Research (A*STAR). At NTU, he serves as co-Director of the Singtel-NTU Cognitive & Artificial Intelligence Joint Lab (SCALE@NTU). He was Chair of the School of Computer Science and Engineering, Nanyang Technological University from 2016-2018, Director of the Centre for Computational Intelligence/Computational Intelligence Laboratory from 2008-2015 and Programme Principal Investigator of the Data Analytics & Complex System Programme in the Rolls-Royce@NTU Corporate Lab from 2013-2017. He received his Bachelors and Masters degrees in Electrical and Electronics Engineering (Specializing in Computing) from Nanyang Technological University and subsequently his PhD (Thesis Title: Artificial Intelligence in Complex Engineering Design) from the University of Southampton, United Kingdom. He is a Fellow of IEEE and founding Editor-In-Chief of the IEEE Transactions on Emerging Topics in Computational Intelligence, founding Technical Editor-In-Chief of Memetic Computing Journal (Springer), Associate Editor of IEEE Transactions on Evolutionary Computation, IEEE Transactions on Neural Network & Learning Systems, IEEE Transactions on Cybernetics, IEEE Transactions on Artificial Intelligence, IEEE Transactions on Big Data (2015 - 2018), IEEE Computational Intelligence Magazine (2010 - 2016), and chief co-editor of Book Series on Studies in Adaptation, Learning, and Optimization.", "keywords": ["Computer Science and Engineering", "Smart Cities"], "grants": ["Accelerating traditional workflows in animation and gaming through creative AI solutions", "Distributed Smart Value Chain (DSVC)", "Fusion Science for Clean Energy", "Memetic Computation for Human-Like Problem-Solving", "President's Chair in Computer Science", "Research Theme 1 - Anticipatory Analytics And Services", "Singtel-NTU Congnitive & Artifical Intelligence Joint Lab, Common Activities Account", "Transformative mobile learning in a first-year interdisciplinary writing class"], "patents": [{"link": "https://patents.google.com/patent/US20100106714A1/en", "title": "US-2010-0106714-A1", "abstract": ": A methodology is presented to address the need for rapid generation and optimization of algorithms that are efficient in solving a given class of problems within the framework of a software environment. The environment incorporates an evolutionary learning methodology which automatically optimizes the configurations of procedural components of the algorithm. In this way, both the efficiency and the quality of algorithm development is enhanced significantly."}], "urls": {"dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00092", "orcid": null, "personal": "http://www3.ntu.edu.sg/home/asysong/"}}