{"full_name": "Kwoh Chee Keong", "email": "asckkwoh@ntu.edu.sg", "name_card": "Assoc Prof Kwoh Chee Keong", "image_path": "./data_source/profile_image/kwoh_chee_keong.jpg", "designations": ["Associate Professor, School of Computer Science and Engineering"], "biography": "Dr.  Kwoh Chee Keong is currently in the School of Computer Engineering since 1993. He received his Bachelor degree in Electrical Engineering (1st Class) and Master in Industrial System Engineering from the National University of Singapore in 1987 and 1991 respectively. He received his Ph.D. degrees from the Imperial College, University of London in 1995. His research interests include Data Mining and Soft Computing and Graph-Based inference; applications areas include Bioinformatics and Biomedical Engineering. He has done significant research work his research areas and published over 90 quality international conferences and over 30 journal papers. He has been often invited as a organizing member or referee and reviewer for a number of premier conferences and journals, including GIW, IEEE BIBM, RECOMB, PRIB etc. Dr. Kwoh is a member of The Institution of Engineers Singapore, Association for Medical and Bio-Informatics, Imperial College Alumni Association of Singapore (ICAAS).  He has provided many service to professional bodies, and the Singapore and was conferred the Public Service Medal, the President of Singapore in 2008.", "keywords": ["Biomedical Sciences & Life Sciences", "Computer Science and Engineering", "Interface of Biology & Engineering (Engineering in Biology)", "Mathematics", "Systems and Engineering Management"], "grants": ["Hodge Laplacian based deep learning models for drug design", "Host-pathogen protein-protein interaction approaches for predicting virulence", "Investigating the regulation of 3D genome organization using machine learning", "Predict the solubility of proteins using machine learning", "Predicting large scale chromatin interaction datasets from small scale Hi-C datasets with artificial intelligence", "Structural analysis and characterization of protein complexes", "Targeted protein design via constrained denoising diffusion probabilistic models", "Towards direct and rapid mapping of RNA modifications with nanopore sequencing", "Untangling cancer re-wiring: Pan-Cancer mapping of transcription factor driven dysregulatory hotspots using AlphaFold2 and integrative machine learning"], "patents": [], "urls": {"dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00799", "orcid": null, "personal": "https://personal.ntu.edu.sg/asckkwoh"}}