{"full_name": "Zhang Hanwang", "email": "hanwangzhang@ntu.edu.sg", "name_card": "Assoc Prof Zhang Hanwang", "image_path": "./data_source/profile_image/zhang_hanwang.jpg", "designations": ["Associate Professor, School of Computer Science and Engineering"], "biography": "Hanwang Zhang is an Assistant Professor at Nanyang Technological University, Singapore. He was a research scientist at the Department of Computer Science, Columbia University, USA and a senior research fellow at the School of Computing, National University of Singapore, Singapore. He has received the B.Eng (Hons.) degree in computer science from Zhejiang University, Hangzhou, China, in 2009, and the Ph.D. degree in computer science from the National University of Singapore in 2014. His research interest includes computer vision, multimedia, and social media. Dr. Zhang is the recipient of the Best Demo runner-up award in ACM MM 2012, the Best Student Paper award in ACM MM 2013, and the Best Paper Honorable Mention in ACM SIGIR 2016. He is also the winner of Best Ph.D. Thesis Award of School of Computing, National University of Singapore, 2014.", "keywords": ["Computer Science and Engineering", "Electrical and Electronic Engineering", "Interactive Digital Media", "Language & Communication", "Mathematics"], "grants": ["Build-To-Order Neural Networks for Interactive Vision-Language Systems", "Google PhD Fellowship", "Interplay between Machine Learning and Precision Optical Measurement", "On the Completeness of Self-Supervised Learning: Group Theory, Causality, and Their Combinations", "Resource Efficient AI: Zero-shot learning, few-show learning, meta structure learning, casual learning", "SingaKids Pic2Speak: Multilingual AI Tutor – Uplifting Singapore’s Bilingual Edge", "Towards Building Unified Autonomous Vehicle Scene Representation for Physical AV Adversarial Attacks and Visual Robustness Enhancement", "XMAN: Explainable Multimodal Artificial Networks for Machine Reasoning"], "urls": {"dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp01149", "orcid": "https://orcid.org/0000-0001-7374-8739", "personal": "https://personal.ntu.edu.sg/hanwangzhang/", "google_scholar": "https://scholar.google.com/citations?user=YG0DFyYAAAAJ&hl=en&oi=ao", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=55366935100"}}