{"full_name": "Goh Wooi Boon", "email": "aswbgoh@ntu.edu.sg", "name_card": "Assoc Prof Goh Wooi Boon", "image_path": "./data_source/profile_image/goh_wooi_boon.jpg", "designations": ["Associate Professor, School of Computer Science and Engineering"], "biography": "Wooi-Boon Goh received a B.Sc (1st Class Hons) in Computer Science and Electronic Engineering from the University of Birmingham, UK (1984), a M.Phil from University of Warwick, UK (1992), and a Ph.D. from Nanyang Technological University, Singapore (2006). He is currently an Associate Professor and Associate Chair (Faculty) in the School of Computer Science and Engineering, Nanyang Technological University, and his research interests include human-computer interaction and computer vision. Before joining NTU, he was senior engineer and later engineering section manager at the Mechanization and Automation department of Hewlett Packard Singapore. His industrial engineering expertise is in the area of developing robot-assisted automation systems.", "keywords": ["Computer Science and Engineering", "Electrical and Electronic Engineering", "Interactive Digital Media", "Machines & Systems"], "grants": ["Collaborative multi-touch learning environments for children with autism"], "patents": [{"link": "https://patents.google.com/patent/US9108114B2/en", "title": "US 2014/021314 A1", "abstract": ": The present invention relates to a TUI having a plurality of faces. A sensing system is provided to detect the presence of one or more adjacent TUIs within a predetermined sensing distance of one of the faces. Thus, the sensing system is arranged to detect whether any of the faces of the TUI opposes one or more adjacent TUIs. It may further be able to detect the relative orientation of opposing faces of the TUI and the one or more adjacent TUIs. The sensing system is further configured to enable the determination of the orientation of the TUI with respect to the vertical direction."}], "urls": {"dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00693", "orcid": null, "personal": null}}