{"full_name": "Alexei Sourin", "email": "assourin@ntu.edu.sg", "name_card": "Assoc Prof Alexei Sourin", "image_path": "./data_source/profile_image/alexei_sourin.jpg", "designations": ["Associate Professor, School of Computer Science and Engineering"], "biography": "Dr. Alexei Sourin was born in Moscow and received his M.Eng. and Ph.D. degrees in computer graphics from the Moscow Engineering Physics Institute, Russia (MEPhI) in 1983 and 1988, respectively. From 1983 to 1993 he was a researcher at MEPhI where he worked on different scientific visualization and computer animation projects. Since 1993 he held faculty positions at Nanyang Technological University (NTU) in Singapore, except a period from 1999 to 2000 when he was Associate Professor at Moscow Institute of Physics and Technology (MIPT). Currently he is a tenured Associate Professor with the School of Computer Science and Engineering at NTU. His research interests are in shape modeling, multi-modal interaction, music visualization, and automated visual inspection in manufacturing. Dr. Sourin published over 230 referred research papers and was invited to give talks to many scientific events. Dr. Sourin is also one of the pioneers of electronic education in Singapore. From 2012 to 2018, he was a Chair of the IFIP WG5.10 Computer Graphics and Virtual Worlds. Dr. Sourin is a Senior Member of IEEE and a member of ACM SIGGRAPH. He is an associate editor of several international journals including The Visual Computer (Springer) and Transactions on Computational Science (Springer). He was on the program committees of over 120 international conferences. He is a coordinator of the International Conferences on Cyberworlds for which he was also General and Program Chair in many years.", "keywords": ["Computer Science and Engineering", "Interactive Digital Media", "Graphics and Interactive Computing", "Smart Cities"], "grants": ["Feasibility Study on Automatic Detection of Anomalies in Captured Images with Limited Training Data"], "patents": [], "urls": {"dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00274", "orcid": "https://orcid.org/0000-0003-4051-2927", "personal": "http://www3.ntu.edu.sg/home/assourin/", "google_scholar": "https://scholar.google.com/citations?user=8A7kHCYAAAAJ&hl=en&oi=ao", "web_of_science": "https://www.webofscience.com/wos/author/record/1371388", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=8366154100"}}