{"full_name": "Jagath Chandana Rajapakse", "email": "asjagath@ntu.edu.sg", "name_card": "Prof Jagath Chandana Rajapakse", "image_path": "./data_source/profile_image/jagath_chandana_rajapakse.jpg", "designations": ["Professor, School of Computer Science and Engineering"], "biography": "Jagath Rajapakse is Professor of Computer Science and Engineering at the Nanyang Technological University (NTU), Singapore. He has BSc degree in Electronics and Telecommunication Engineering from University of Moratuwa (UM), Sri Lanka, and MS and PhD degrees in Electrical and Computer Engineering from University at Buffalo (UB), USA. He was Visiting Scientist to the Max-Planck Institute of Cognitive and Brain Sciences, Germany, and the National Institute of Mental Health, USA. He was Visiting Professor to the Department of Biological Engineering at Massachusetts Institute of Technology (MIT).He serves as Editor for Engineering Applications in Artificial Intelligence journal (IF = 7.802) and served as Associate Editor for IEEE Transactions on medical imaging, IEEE Transaction on neural networks and learning systems, and IEEE Transactions on computational biology and bioinformatics. He was a Fulbright Scholar and appointed IEEE Fellow in 2012 in recognition of his contributions to brain image analysis.", "keywords": ["Biomedical Engineering", "Computational Intelligence", "Information Sciences and Systems", "Healthy Brain Ageing", "Mental Health", "Neuroscience", "Artificial and Augmented Intelligence", "Biomedical Informatics and Data Science"], "grants": ["Decoding the connectome by deep encoding on graphs", "Deep generative approach for de novo cancer drug discovery with desired mechanism of action", "Developing Unsupervised Machine Learning Techniques for Discovering Novel Ocular and Brain Imaging Biomarkers of Alzheimer’s Disease", "Machine learning for Demand Forecasting", "Novel methods of network modelling and personalised machine learning to understand and predict individual dementia using heterogeneous multi-omics data", "Novel MRI Toolbox to Classify and Predict Asian Mild Cognitive Impairment", "Software Application for Thermal imaging analytics"], "patents": [], "urls": {"dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00169", "orcid": "https://orcid.org/0000-0001-7944-1658", "personal": "https://personal.ntu.edu.sg/asjagath", "google_scholar": "https://scholar.google.com/citations?user=9WPWHiEAAAAJ&hl=en&oi=ao", "web_of_science": "https://www.webofscience.com/wos/author/record/1707614", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=7003412852"}}