{"full_name": "Wai Kin Adams Kong", "email": "adamskong@ntu.edu.sg", "name_card": "Assoc Prof Wai Kin Adams Kong", "image_path": "./data_source/profile_image/wai_kin_adams_kong.jpg", "designations": ["Associate Professor, School of Computer Science and Engineering"], "biography": "Since attaining his Ph.D. from the University of Waterloo, Canada in 2007, Asst Prof Adams Kong has gone on to publish 12 journal and over 20 conference papers. He has developed three patents, of which, one has been approved while two others have been filed. During his course of study, he has also gone to win the Scholastic Award from the Hong Kong Baptist University - an award presented only to the top student in his department. As a finalist of the 4th Young Inventor Awards 2002-2003, organized by Hewlett Packard and Far Eastern Economic Review, this capable inventor has received resounding media coverage for his “Palm Print Identification Algorithms for Real-Time Personal Identification”.    This palmprint identification system has earned several international and national awards.  It has aslo been applied to several real applications, including the control of access to a laboratory and a hotel. He has recently been listed as one of the “Who’s Who” in the World.", "keywords": ["Computer Science and Engineering", "Smart Cities"], "grants": ["Development of Electric Vertical Take-Off and Landing (eVTOL) Aircraft in Singapore", "Digital Trust Centre (a.k.a. The National Centre for Research in Digital Trust (NCDT))", "Multi-Modal Deception Detection in Videos", "Strategic Centre For Research In Privacy-Preserving Technologies & Systems (SCRIPTS)", "Transferable Adversarial Example Generation and Selection"], "patents": [{"link": "https://patents.google.com/patent/US20160004918A1/en", "title": "US 2016/0004918 A1", "abstract": ": Embodiments include methods, devices, software, and systems for identifying a person based on relatively permanent pigmented or vascular skin mark (RPPVSM) patterns in images. Locations of RPPVSMs in different images of people are point matched, and a correspondence probability that the point matched RPPVSMs are from different people is calculated. Other embodiments are also described. Other embodiments are also described and claimed."}, {"link": "https://patents.google.com/patent/US20140016832A1/en", "title": "US2014/0016832A1", "abstract": ": The present invention is directed to a method of determining vein patterns from a colour image for personal identification, the method comprising forming a counterpart of the colour image by applying a functional relationship obtained from optimization on the colour image, wherein the counterpart of the colour image comprises the vein patterns. An apparatus for determining vein patterns from a colour image is also disclosed."}, {"link": "https://patents.google.com/patent/US20120275663A1/en", "title": "US 2012/0275663 A1", "abstract": ": Embodiments include methods, devices, software, and systems for identifying a person based on relatively permanent pigmented or vascular skin mark (RPPVSM) patterns in images. Locations of RPPVSMs in different images of people are point matched, and a correspondence probability that the point matched RPPVSMs are from different people is calculated. Other embodiments are also described. Other embodiments are also described and claimed."}], "urls": {"dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00834", "orcid": null, "personal": null}}