{"full_name": "Liu Yang", "email": "yangliu@ntu.edu.sg", "name_card": "Prof Liu Yang", "image_path": "./data_source/profile_image/liu_yang.jpg", "designations": ["Professor, School of Computer Science and Engineering", "University Leadership Forum Chair in Computer Science and Engineering", "Executive Director for Cyber Research Programme Office (CRPO), Cyber Research Programme Office (CRPO)"], "biography": "Dr. Yang Liu obtained his bachelor and ph.d degree in the National University of Singapore in 2005 and 2010, respectively. In 2012, he joined Nanyang Technological University as a Nanyang Assistant Professor. He is currently a full professor, director of the cybersecurity lab, Program Director of HP-NTU Corporate Lab and Deputy Director of the National Satellite of Excellence of Singapore. In 2019, he received the University Leadership Forum Chair professorship at NTU.Dr. Liu specializes in software verification, security and software engineering. His research has bridged the gap between the theory and practical usage of formal methods and program analysis to evaluate the design and implementation of software for high assurance and security. By now, he has more than 270 publications in top tier conferences and journals. He has received a number of prestigious awards including MSRA Fellowship, TRF Fellowship, Nanyang Assistant Professor, Tan Chin Tuan Fellowship, Nanyang Research Award (Young Investigator) 2018, NRF Investigatorship 2020 and 10 best paper awards and one most influence system award in top software engineering conferences like ASE, FSE and ICSE.", "keywords": ["Computer Science and Engineering", "Cyber Security and Forensics"], "grants": ["2019 University Leadership Forum Chair in Computer Science and Engineering", "A Framework for Intellectual Property Protection of Deep Learning Applications", "Building Security Tools for Investigating and Introspecting Applications in Trusted Execution Environment", "CLOUDSEC: SECURITY ANALYSIS OF CLOUD INFRASTRUCTURES", "Cyber Research Programme Office (CRPO)", "Emulation Based Fuzzing Technique", "Enhancing the Robustness of Object Detection against Natural Corruption-aware Adversarial Attacks", "MAASS: Malware Authorship Attribution based on Source Code and Static Analysis", "Simulation-based SOTIF (Safety of the Intended Functionality) Testing for Autonomous Driving Systems", "Smart Safe and Robust Motion Control for Multi-Robot Systems", "The Science of Certified AI Systems", "Thrust B: Artificial Intelligence and Software Engineering (IAF-ICP)", "Thrust B: Artificial Intelligence and Software Engineering (RCA)", "Towards Building Trustworthy and Robust Intelligent Systems and Its Application on Human Brain", "Towards Building Unified Autonomous Vehicle Scene Representation for Physical AV Adversarial Attacks and Visual Robustness Enhancement", "Towards Semantic-Aware Multimodal and Multilingual Deep Learning Systems for E-Commerce Applications", "TrustFUL: Trustworthy Federated Ubiquitous Learning", "TrustFUL: Trustworthy Federated Ubiquitous Learning (SCSE)", "TRUSTWORTHY AI CENTRE NTU (TAICeN)", "TRUSTWORTHY AI CENTRE NTU (TAICeN) (NTU)", "TRUSTWORTHY AI CENTRE NTU (TAICeN) (NUS)", "TRUSTWORTHY AI CENTRE NTU (TAICeN) (SMU)", "Trustworthy and Explainable AI"], "urls": {"dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00564", "orcid": null, "personal": "https://personal.ntu.edu.sg/yangliu"}}