{"full_name": "Tan Rui", "email": "tanrui@ntu.edu.sg", "name_card": "Assoc Prof Tan Rui", "image_path": "./data_source/profile_image/tan_rui.jpg", "designations": ["Associate Professor, School of Computer Science and Engineering"], "biography": "Rui Tan received B.S.(2004) and M.S.(2007) in automation from Shanghai Jiao Tong University, and Ph.D.(2010) in computer science from City University of Hong Kong, respectively. From 2010 to 2012, he worked as a postdoctoral Research Associate at Michigan State University. From 2012 to 2015, he worked as a Research Scientist and then a Senior Research Scientist at Advanced Digital Sciences Center, a Singapore-based research center of the University of Illinois at Urbana-Champaign. He joined the School of Computer Science and Engineering (SCSE) of Nanyang Technological University (NTU) in 2016. He is currently an Associate Professor with SCSE, NTU.He has received multiple research awards including Best Paper Award from ACM/IEEE IPSN 2017, CPSR-SG 2017, Distinguished TPC Member of INFOCOM 2017, Best Paper Award Runner-Ups from ACM/IEEE IPSN 2014 and IEEE PerCom 2013, IPSN'21 Best Artifact Award Runner-Up, as well as Outstanding Academic Performance Award from City University of Hong Kong in 2009. He is now an IEEE Senior Member.", "keywords": ["Computer Science and Engineering", "Info-Communication Technology", "Energy", "Internet & Communications", "Computer Networks and Communications"], "grants": ["Build CSI based wireless sensing platforms with commodity WiFi", "Data-driven Traffic Analytics and Simulation for Incident Impact Analysis and Management", "Food Supply Chain Management built with Blockchain and Internet-of-Things (IoT)", "Holistic Moving Target Defence for Autonomous Driving Perception", "Intelligent Data Aggregation Framework for Workflow Optimisation in Smart Facility Management Solutions", "Physics-Guided Generalization of AIoT Sensing", "Sustainable Tropical Data Centre Test bed", "Sustainable Tropical Data Centre Test bed (WP1)", "Towards Zero-Carbon Autonomous Driving AI"], "urls": {"dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00504", "orcid": null, "personal": "https://personal.ntu.edu.sg/tanrui/", "dataset": "https://researchdata.ntu.edu.sg/dataverse/tanrui", "research_group": "https://ntuiot.xyz/"}}