{"full_name": "Yu Han", "email": "han.yu@ntu.edu.sg", "name_card": "Asst Prof Yu Han", "image_path": "./data_source/profile_image/yu_han.jpg", "designations": ["Nanyang Assistant Professor, School of Computer Science and Engineering"], "biography": "Dr Han Yu is a Nanyang Assistant Professor (NAP) in the School of Computer Science and Engineering (SCSE), Nanyang Technological University (NTU), Singapore. He has been a Visiting Scholar at the Department of Computer Science and Engineering, Hong Kong University of Science and Technology (HKUST) from 2017 to 2018. Between 2015 and 2018, he held the prestigious Lee Kuan Yew Post-Doctoral Fellowship (LKY PDF) at the Joint NTU-UBC Research Centre of Excellence in Active Living for the Elderly (LILY). Before joining NTU, he worked as an Embedded Software Engineer at Hewlett-Packard (HP) Pte Ltd, Singapore. He obtained his PhD from the School of Computer Science and Engineering, NTU in 2014. During his PhD study, he held the prestigious Singapore Millennium Foundation (SMF) PhD Scholarship. His research focuses on online convex optimization, ethical AI, federated machine learning and their applications in complex collaborative systems such as crowdsourcing. He has published over 150 research papers in book chapters, leading international conferences and journals including AAAI, IJCAI, CVPR, SIGIR, ASE, ACM MM, CIKM, AAMAS, NAACL, ICME and ACM/IEEE Transactions. He co-authored the book \"Federated Learning\" - the first monograph on the topic of federated learning. His research work has been recognized with 25 awards from conferences and journals. He is an Associate Editor of IEEE TNNLS. He is a founding Co-PI of the Trustworthy Federated Ubiquitous Learning (TrustFUL) Research Lab (https://trustful.federated-learning.org/).", "keywords": ["Computational Intelligence", "Information Sciences and Systems", "Parallel and Distributed Computing", "Artificial and Augmented Intelligence", "Graphics and Interactive Computing"], "grants": ["AI-Powered Crowd-computing", "Next-Generation Brain-Computer-Brain Platform – A Holistic Solution for the Restoration & Enhancement of Brain Functions (NOURISH)", "Towards Real-time, Seamless, and Ubiquitous Edge Intelligence-empowered Metaverse", "TrustFUL: Trustworthy Federated Ubiquitous Learning", "TrustFUL: Trustworthy Federated Ubiquitous Learning (SCSE)", "TrustFUL: Trustworthy Federated Ubiquitous Learning (WeBank)"], "patents": [{"link": "https://patents.google.com/patent/US20160379296A1/en", "title": "US 2016/0379296 A1", "abstract": ": This invention proposes an autonomous interaction decision support apparatus to provide the operator of an e-commerce business with a recommendation of which received orders to perform. The apparatus autonomously tracks situational information comprising the existing level of work of the e-business, for each of multiple products and/or services offered by the business, and also a desired level of work. In this way, the recommendation protects both the reputation of the business and achieves work-life balance for the business owner."}], "urls": {"dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp00334", "orcid": null, "personal": "http://hanyu.sg", "han_yu_(google_scholar)": "https://scholar.google.com.sg/citations?user=eXgoTXMAAAAJ&hl=en", "web_of_science": "https://www.webofscience.com/wos/author/record/1174765", "han_yu_(scopus)": "https://www.scopus.com/authid/detail.uri?authorId=55753004000"}}