{"full_name": "Dusit Niyato", "email": "dniyato@ntu.edu.sg", "name_card": "Prof Dusit Niyato", "image_path": "./data_source/profile_image/dusit_niyato.jpg", "designations": ["Professor, School of Computer Science and Engineering", "Courtesy Appointment, School of Physical & Mathematical Sciences (Courtesy Appointment)", "President's Chair in Computer Science and Engineering, School of Computer Science and Engineering (SCSE)"], "biography": "Prof Dusit Niyato is currently in the School of Computer Engineering since July 2008. He received his Bachelor degree in Computer Engineering from King Mongkut's Institute of Technology Ladkrabang, Thailand, Master and Ph.D. degrees from the University of Manitoba in 2005 and 2008, respectively.  His research interests include Wireless Communications, and Networking. He has done significant research work his research areas and published over 60 top quality international conference and journal papers.", "keywords": ["Computer Science and Engineering", "Electrical and Electronic Engineering", "Computer Networks and Communications"], "grants": ["Algorand Centre of Excellence at NTU (ACE@NTU) [under NTU Centre in Computational Technologies for Finance]", "Algorithm Design Of Mobile Decentralized Computing Systems", "Fusion Science for Clean Energy", "President's Chair in Computer Science and Engineering", "Reputation-driven Optimized Worker Selection for Collaborative Distributed Learning", "Technical challenges, linguistic obstacles, and cultural barriers in bringing knowledge societies into the metaverse. With a metaverse showcase of how the peoples of Afro-Eurasia saw each other transitioning into modernity", "Towards Real-time, Seamless, and Ubiquitous Edge Intelligence-empowered Metaverse", "TrustFUL: Trustworthy Federated Ubiquitous Learning", "TrustFUL: Trustworthy Federated Ubiquitous Learning (SCSE)"], "patents": [], "urls": {"dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp01008", "orcid": "https://orcid.org/0000-0002-7442-7416", "personal": "http://www3.ntu.edu.sg/home/dniyato", "google_scholar": "https://scholar.google.com/citations?user=T8sVhLMAAAAJ&hl=en&oi=ao", "scopus": "https://www.scopus.com/authid/detail.uri?authorId=8919714700"}}