{"full_name": "Guan Cuntai", "email": "ctguan@ntu.edu.sg", "name_card": "Prof Guan Cuntai", "image_path": "./data_source/profile_image/guan_cuntai.jpg", "designations": ["Professor, School of Computer Science and Engineering", "President's Chair in Computer Science and Engineering", "Director, Artificial Intelligence Research Institute (AI.R)", "NTU Co-Lab Director, S-Lab for Advanced Intelligence"], "biography": "Prof Guan is a President's Chair Professor in Computer Science and Engineering at Nanyang Technological University (NTU), Singapore. He is the Director of the Artificial Intelligence Research Institute (AI.R) of NTU. He is the Co-Director, S-Lab for Advanced Intelligence (S-Lab), NTU. He is the Director of the Centre for Brain-Computing Research (CBCR). He initiated and served as the Co-Director of the Rehabilitation Research Institute of Singapore (RRIS), 2015-2018. Prior to joining NTU in 2016, he was the founding Department Head of the Neural & Biomedical Technology Department at the Institute for Infocomm Research (I2R), Agency for Science, Technology, and Research (A*SATR), Singapore.  His research interests are in the fields of Brain-Computer Interfaces (BCI), Machine Learning, Neural Signal & Image Processing, Data Analytics, and Artificial Intelligence. He published 400 refereed journal and conference papers and holds 25 granted patents and patent applications. He licensed 15 patents/technologies to five companies in Singapore and USA. He delivered more than 70 keynote speeches and invited talks (including the keynote, Brain-Computer Interfaces for Stroke Rehabilitation, at the opening ceremony of the 7th International BCI Meeting, Asilomar, USA, May 2018). He is a recipient of the Annual BCI Research Award, the King Salman Award for Disability Research, the IES Prestigious Engineering Achievement Award, the Achiever of the Year (Research) Award, the Finalist of the President Technology Award, and the winner of BCI Competitions. He has been an Associate Editor for IEEE Transactions on Biomedical Engineering, IEEE Transactions on Artificial Intelligence, Pattern Recognition, Neurocomputing, Brain-Computer Interfaces, Frontiers in Neuroscience, Frontiers in Human Neuroscience, etc. He is on the Advisory Board of IEEE Open Access Journal of Engineering in Medicine and Biology (OJEMB). He was on the IEEE Fellow Evaluation Committee for EMBS Society. He was an APSIPA Distinguished Lecturer, 2017-2018.  He served as the General Co-Chair for IEEE ICAA’2018, Conference Chair for the Internet of Things (IoT) Asia 2015, and General Chair for the IEEE HealthCom 2008. He was the President of the Pattern Recognition and Machine Intelligence Association (PREMIA), Singapore, 2008-2010.He is an elected Fellow of the Singapore Academy of Engineering (SAEng), Fellow of NAI (National Academy of Inventors, USA), Fellow of IEEE (the Institute of Electrical and Electronics Engineers), and Fellow of AIMBE (the American Institute for Medical and Biological Engineering).", "keywords": ["Computational Intelligence", "Brain Machine Interface", "Artificial and Augmented Intelligence", "Biomedical Informatics and Data Science"], "grants": ["A Sociometric AI Screening Tool to Risk-Stratify Infant Neurodevelopmental Trajectories (STARS)", "A Sociometric AI Screening Tool to Risk-Stratify Infant Neurodevelopmental Trajectories (STARS) WP2 (AI Sociometrics)", "Artificial Intelligence Research Institute (AI.R), NTU", "Digital Sensing Lab", "Early detection of mild cognitive impairment (MCI) through a novel digital assessment", "FHT Module 3: Connected Rehabilitation and Assistive Technology", "FHT Module 3: Connected Rehabilitation and Assistive Technology (Project 2)", "Human-Machine Shared Control for Intelligent Safety and Energy of Smart Vehicles (HM Science)", "Institute for Digital Molecular Analytics and Science (IDMxS)", "Machine Learning Based Approach for Sensory Stimulated EEG Signal Classification", "MATAI: AN AI-POWERED GENERALIST MATERIAL DISCOVERY PLATFORM", "Next-Generation Brain-Computer-Brain Platform – A Holistic Solution for the Restoration & Enhancement of Brain Functions (NOURISH)", "President’s Chair in Computer Science and Engineering", "Program on Advanced Brain-Computer Interface Technologies for Mental Healthcare", "Resource-Efficient AI “Deep Transfer Learning, Adaptive Algorithms, Neurorehabilitation”", "Scent Digitalization and Computation (SDC)", "Silent Communication Proof-of-Concept Using Advanced Non-Invasive Brain Computer Interface and Machine Learning Methods", "Silent Communication Proof-of-Concept Using Advanced Non-Invasive Brain Computer Interface and Machine Learning Methods (SCSE)", "Towards human-like autonomy: driver-style-oriented motion control using deep neural networks for personalized autonomous driving", "WP4: Scent Digitalization and Computation (SDC)- PI: Guan Cuntai", "WP4: Scent Digitalization and Computation (SDC)- PI: Lin Weisi"], "urls": {"dr_ntu": "https://dr.ntu.edu.sg/cris/rp/rp01023", "orcid": null, "personal": "https://personal.ntu.edu.sg/ctguan"}}