{"intro": ["The NTU School of Computer Science and Engineering (SCSE) was established in November 1988 as the School of Applied Science (SAS) offering Bachelor Degree in Computer Technology, the first of its kind in Singapore. We were part of NTU’s predecessor,\n    Nanyang Technological Institute (NTI) that was set up in August 1981 with a charter to train three-quarters of Singapore’s engineers. Within 4 years of operation, NTI was singled out as one of the best engineering institutions in the world by\n    the Commonwealth Engineering Council. The Council reached this verdict after an extensive 4-year study of the courses offered by engineering institutions worldwide.In year 2000, SAS was renamed as School of Computer Engineering and in\n    2016, it was re-branded as School of Computer Science and Engineering to accurately reflect our diverse and niche strengths.SCSE has grown immensely since its inception, and continues to serve its critical role in the University, Singapore\n    and the world, through harnessing the power of digital technology and tech-enabled solutions to support better learning and living experiences.", "We are confident that SCSE will successfully continue to nurture leaders who will co-create the sustainable future with innovative solutions for the world’s grand challenges.", "Over 35 years, we have envisioned and developed into a leading global institution for education, research and innovation in computer science and engineering and recognised as the top in AI research/citation impact among global universities. Our faculty members are both internationally recognised researchers and inspiring teachers. Besides hosting 31 of World’s Top 2% Scientists’, as listed by Stanford University’s study (2022) and 4 ‘AI’s Top 10 to Watch’ promising faculty members, SCSE is proud of our star professors in AI, IoT, Cybersecurity, Computer Vision, Fintech and many other areas as well as brilliant researchers who make an impact in the world every day.Our pioneer batch consisted of about 140 students. Today, we have a student population of over 3000 and offer 10 undergraduate, 7 postgraduate and 3 Masters programmes in Artificial Intelligence, Cyber Security and Data Science.We have successfully produced more than 12,000 graduates who have gone on to make an impact in society as innovators and award-winning AI researchers in top academic institutions and companies, both in Singapore and around the world.We are pleased to have been educating Singapore’s and the world’s best computer engineers and scientists for the past 3 decades and are proud to have many internationally prominent entrepreneurs\n    and named experts in AI as our SCSE alumni family.As we embark on an exciting journey to the future, SCSE strives to continue providing top-notch training, facilities and opportunities to students, faculty and scientists who have chosen\n    our School.", "Connect with us"]}